{
  "id": "119bwqj",
  "timestamp": 1677024000000,
  "category": "school_life",
  "concern": "I graduated college less than a year ago (May 2022); and my undergraduate experience was already screwed up by COVID-19 - I was forced to skip out on a full year before returning to Senior year because the US did not allow international students to take hybrid classes and my university was not offering at least 3 in-person classes for me during the 2020 - 2021 lockdown. So I got to watch all my friends graduate without me; I did qualify for an accelerated Master's Program in Economics and I was accepted but I opted not to pursue it due to COVID-19 and feeling that I did not want to stay in Fordham for both undergraduate and graduate school.  \n\n\nAnyway, I somehow managed to get a short-term contract at the World Bank since they hired people from around the world, and if I work for the World Bank in a full-time job for about 15 years I am eligible for permanent residency (green card). For all intents and purposes I really want to stay and live and build a life in the US (especially now with geopolitical events in SE Asia). The problem is that I don't have options for employment in the private sector because the H1-b process is absurdly random and difficult; and the World Bank and IMF have outright told me that I can't get a fulltime job without AT LEAST a Master's Degree (it's already brutally difficult for me to get even a short-term contract role, let alone a fulltime job); and even this employment is not guaranteed.  \n\n\nI'm thinking of getting a Master's Degree in Statistics or Data Science (an MBA or Master's degree in economics isn't very helpful) but I have checked that I did not take enough undergrad courses in Math or Computer Science to qualify (at least in the US). I'm fairly certain that my math skills and coding skills are nowhere near good enough for grad school (I struggled for a 3.60 gpa even before COVID-19)  \nI'm honestly totally lost because I'm being forced to prepare for grad school so soon, just after I managed to find something solid career-wise (I'm 23 turning 24). Otherwise I have to go back to the Philippines and I probably won't have an opportunity to immigrate elsewhere anymore.  \n\n\nAny advice for my circumstances?",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hello! I'm glad you're here. Please feel free to share whatever's on your mind or any concerns you might have.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "client: Hey, thanks for having me. I'm just feeling a bit overwhelmed with my career and the future, especially with how everything's been since COVID hit.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shared a comprehensive narrative of their concern, including their educational background, career aspirations, immigration challenges, and emotional state. However, further exploration could benefit by deepening empathy and rapport to understand their feelings and clarify mutually agreed goals.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "It sounds like you're feeling quite overwhelmed with your career and future, especially given the impacts of COVID. Can you tell me more about what's been happening and how it's affecting you?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "client: Yeah, it's like everything got thrown off track because of the pandemic. I had to miss out on a year of school, and now I'm struggling to figure out how to stay in the US and continue with my career.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shared a comprehensive overview of their concerns, including the impact of COVID-19 on their education and career trajectory, challenges with immigration and employment, and their current situation and future aspirations. Empathy and rapport have been established. Goals about discussing the client's career path and potential strategies have been mutually agreed upon.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It sounds like navigating these challenges has been really difficult for you. How do you see your career ideally moving forward, and what would life look like if things aligned with your goals?",
      "phase": "guiding"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "client: I guess ideally, I'd love to land a stable job in the US, maybe at the World Bank or something similar, where I can grow professionally and work toward getting permanent residency. I'd feel settled and secure, and it'd be nice to finally plant some roots and stop worrying about the next visa or job.",
      "phase": "guiding"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has articulated a clear goal of securing a job at the World Bank to achieve permanent residency in the US, indicating Change Talk. However, there is still ambivalence about pursuing a master's degree due to perceived inadequacies. More exploration is needed to address confidence and ambivalence before developing a specific action plan.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "That vision of stability and growth sounds like a meaningful goal for you. What are some of the steps you might consider taking to move closer to that ideal future?",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "client: I think I might need to look into grad programs that could boost my chances, even if it means going back to school sooner than I wanted. I'm also trying to network more and explore any opportunities that could lead to something permanent.",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has identified a specific change goal (pursuing further education for career advancement) and is exploring steps to achieve it. Change Talk is present, expressing a desire for stability and growth. Confidence and readiness are implied through considering actionable steps like networking and education. The conversation has progressed towards tangible planning, suggesting readiness for developing specific action plans.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It sounds like you're considering a couple of avenues to achieve your goal. Based on what you said, options could include researching grad programs and actively engaging in networking. How do these options feel to you, and what would be a first step you might take in either direction?",
      "phase": "choosing"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "client: Honestly, both options seem overwhelming right now. But I guess the first step might be to reach out to people I know in the industry and ask for advice on grad programs or job leads, just to get a clearer picture of my options.",
      "phase": "choosing"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a clear goal of stability in the US and has outlined potential actions, such as pursuing grad programs and networking. However, they express feeling overwhelmed and uncertain about their qualifications and next steps. The client needs further discussion on barriers and confidence-building to solidify their plan and commitment.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "Reaching out to your network for advice sounds like a practical first step. How would you like to go about this, and are there any specific people or resources you have in mind to contact?",
      "phase": "choosing"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "client: I think I'll start with some of my former professors and colleagues from my internship. Maybe they can provide some guidance or even connect me with someone in the field. I’m also considering joining some professional groups related to economics or data science to expand my network.",
      "phase": "choosing"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has articulated a clear goal and identified concrete steps, such as reaching out to former professors and colleagues and joining professional groups. Barriers have been discussed, and self-monitoring through networking has been agreed upon. The client shows commitment to taking steps and exhibits a readiness to move forward.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "That sounds like a solid plan. You've identified some great resources by reaching out to former professors and colleagues, and joining professional groups can really widen your network. Remember, taking things one step at a time can alleviate that overwhelming feeling. You're on the right track, and it's okay to move at a pace that feels comfortable for you. Keep nurturing those connections and exploring opportunities. You're doing really well, and I'm here to support you in this journey. Let's touch base again soon to see how you're progressing and to talk through anything new that comes up. Take care and keep moving forward!",
      "phase": "terminating"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Thanks, I'll try to keep that in mind. I guess I'll see how it goes and maybe we can catch up next time.",
      "phase": "terminating"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "{{\n\"reasoning\": \"The conversation covered the client's concerns, identified achievable steps, and outlined a plan involving networking and professional groups. The therapist reinforced coping strategies, inviting natural closure and a follow-up session.\",\n\"determination\": \"move\"\n}}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hello! I'm glad you're here. Please feel free to share whatever's on your mind or any concerns you might have.\nclient: client: Hey, thanks for having me. I'm just feeling a bit overwhelmed with my career and the future, especially with how everything's been since COVID hit.\ntherapist: It sounds like you're feeling quite overwhelmed with your career and future, especially given the impacts of COVID. Can you tell me more about what's been happening and how it's affecting you?\nclient: client: Yeah, it's like everything got thrown off track because of the pandemic. I had to miss out on a year of school, and now I'm struggling to figure out how to stay in the US and continue with my career.\ntherapist: It sounds like navigating these challenges has been really difficult for you. How do you see your career ideally moving forward, and what would life look like if things aligned with your goals?\nclient: client: I guess ideally, I'd love to land a stable job in the US, maybe at the World Bank or something similar, where I can grow professionally and work toward getting permanent residency. I'd feel settled and secure, and it'd be nice to finally plant some roots and stop worrying about the next visa or job.\ntherapist: That vision of stability and growth sounds like a meaningful goal for you. What are some of the steps you might consider taking to move closer to that ideal future?\nclient: client: I think I might need to look into grad programs that could boost my chances, even if it means going back to school sooner than I wanted. I'm also trying to network more and explore any opportunities that could lead to something permanent.\ntherapist: It sounds like you're considering a couple of avenues to achieve your goal. Based on what you said, options could include researching grad programs and actively engaging in networking. How do these options feel to you, and what would be a first step you might take in either direction?\nclient: client: Honestly, both options seem overwhelming right now. But I guess the first step might be to reach out to people I know in the industry and ask for advice on grad programs or job leads, just to get a clearer picture of my options.\ntherapist: Reaching out to your network for advice sounds like a practical first step. How would you like to go about this, and are there any specific people or resources you have in mind to contact?\nclient: client: I think I'll start with some of my former professors and colleagues from my internship. Maybe they can provide some guidance or even connect me with someone in the field. I’m also considering joining some professional groups related to economics or data science to expand my network.\ntherapist: That sounds like a solid plan. You've identified some great resources by reaching out to former professors and colleagues, and joining professional groups can really widen your network. Remember, taking things one step at a time can alleviate that overwhelming feeling. You're on the right track, and it's okay to move at a pace that feels comfortable for you. Keep nurturing those connections and exploring opportunities. You're doing really well, and I'm here to support you in this journey. Let's touch base again soon to see how you're progressing and to talk through anything new that comes up. Take care and keep moving forward!\nclient: Thanks, I'll try to keep that in mind. I guess I'll see how it goes and maybe we can catch up next time.",
  "completed": false
}