{
  "id": "121bbga",
  "timestamp": 1679702400000,
  "category": "emotional",
  "concern": "By “safe route” I mean sticking to online classes or going to community college. I’m 22 and I’ve been doing online classes since 2020. Everything was fine at first. I did zoom meetings my first year and then started doing classes asynchronously. I’ll be done with my associates this year, thankfully. Took me a bit longer than usual since I switched schools but other than that it’s not too bad. I don’t regret my choice but recently I’ve been feeling a lot of FOMO. I don’t do much outside of school and work and I feel like if I would’ve stayed in a dorm then my social life would’ve been better. I try to hang out with the few friends I have but that gets hard. I also traveled a few times last year which was fun but now I just feel like I could be doing so much more with my time and it sucks that I’m not. I just wish I had more people to hang with. I didn’t see the point in staying in a dorm when I first started school since it was online and then I didn’t care about dorming for my second year. The dorms at the school I was going to were pretty crappy, and then on top of that, my school was super far from me and since I didn’t have a car there was just no way for me to get there which is why I stayed online. \n\nI didn’t feel like this before, I just think FOMO is starting to get to me now because my older sister thinks I’m “wasting my youth” and then I see my old school friends on social media having so much fun at college and it just makes me feel left out. I know we can’t always control our situations and sometimes we just have to deal with it, it just sucks. I’d love to know if anyone else is currently dealing with this and how you’re managing :)",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hey there! How's your day going so far? Is there anything on your mind you'd like to talk about?",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "My day is going alright, but I've been feeling a bit isolated lately. Yes, I'd like to talk about some feelings of missing out on social experiences.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist initiated with an open question and the client shared a detailed story about their experience with online classes and feelings of FOMO, indicating the client's primary concern was elicited. The therapist demonstrated empathy by acknowledging the client's emotions and the challenges faced. Although the client expressed distress and some ambivalence, there is minimal resistance. However, the client has not yet expressed explicit Change Talk or linked change to personal values/goals, nor asked for next steps. The exploration of feelings and situation is thorough but motivation for change or commitment statements are not prominent yet.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "It sounds like you're feeling a bit lonely and disconnected. It's great that you're reaching out to talk about it. Can you tell me more about what's been happening lately that's making you feel this way?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "I've been mostly sticking to online classes and work, which has left me feeling more isolated from social activities. Lately, seeing friends' posts about their college experiences has amplified this sense of missing out on building connections.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively elicited the client's story and reflected feelings of isolation and FOMO (turns 1-4). Empathy is demonstrated consistently, and the client has shared detailed context about their current situation and emotional state, indicating psychological safety. However, there is no explicit mutual agreement on session goals yet, nor clear signs of emerging Change Talk or client linking change to personal values. The client is primarily expressing concerns and emotional experience without expressing motivation or readiness to consider change steps. Resistance is low but Change Talk is minimal at this stage.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "That must be really tough, especially when you're seeing your friends having these experiences that you feel you're missing out on. It's completely understandable to feel a sense of isolation and longing for connection. Have you considered reaching out to your friends or trying to find ways to build connections in your own life, even if they might look a bit different than your friends' experiences?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "I've thought about reaching out to my friends more, but it hasn't been easy with my current schedule. I'm trying to find ways to build connections on my own, though it's challenging when I feel like I'm missing out on typical college experiences.",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively elicited the client's story about feelings of isolation and FOMO related to online classes and social life. Empathy is consistently demonstrated through reflective listening, validating the client's emotions and experiences. While the client has acknowledged challenges in building connections and expressed some desire to reach out to friends, there is minimal explicit Change Talk indicating strong motivation for change or linking change to personal values/goals. Resistance is low, and rapport is good, but the conversation remains focused on exploring feelings and circumstances without clear movement toward change strategies or plans.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It seems like you've been feeling a sense of disconnection and loneliness due to your current circumstances, and it's completely valid to feel that way. It's great that you're taking steps to build connections on your own, even if it may be challenging at times. Remember that everyone's experiences are unique, and it's important to find what works best for you. Have you considered any specific activities or hobbies that might help you feel more connected to others, even if they're not typical college experiences?",
      "phase": "exploring"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "I've considered joining local meetups or online communities related to my hobbies, like hiking or book clubs, to connect with others outside of my usual routine. However, it's been tough to follow through because of my packed schedule and the ongoing sense of missing out on more traditional social experiences.",
      "phase": "exploring"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has successfully elicited the client's story about feelings of isolation and FOMO related to online classes and social disconnection, reflected these feelings empathetically, and validated the client's experience repeatedly (turns 2, 4, 6, 8). The client has articulated current challenges and some tentative ideas for connection, indicating psychological safety and rapport. However, there is minimal explicit Change Talk—client expresses desire and attempts to build connections but also highlights barriers without strong commitment or activation (turns 4, 6, 8). No overt request for next steps or strong linkage to personal values is present yet. Given the current phase is Exploring and the client’s ambivalence remains, continuing to deepen understanding and evoke motivation is appropriate before moving forward.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It sounds like you've been putting in a lot of effort to find ways to connect with others, despite the challenges you've been facing. It can be difficult to balance your responsibilities and your desire for social experiences, but it's important to remember that even small steps can make a difference. Have you thought about setting aside a specific time each week to participate in one of those activities, like a book club or a hiking group, so that it becomes a part of your routine?",
      "phase": "exploring"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "I've thought about scheduling specific times for activities like hiking groups, but my packed routine often makes it hard to commit. Even so, I'm trying to push through that hesitation to build those connections despite feeling like I'm missing out on more traditional college social life.",
      "phase": "exploring"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited and reflected back the client's story about feeling isolated and experiencing FOMO due to online classes and missing traditional college experiences. Empathy is consistently demonstrated, creating psychological safety as the client openly discusses emotions and challenges. Session goals about exploring the client's feelings and social difficulties are mutually understood. While the client expresses efforts to build connections, Change Talk remains limited and ambivalent with no explicit commitment or activation yet. Resistance is minimal. Given that the Exploring phase objectives are substantially met but strong Change Talk is not yet evident, the session should continue exploring before advancing.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "It's understandable that finding time for new activities can be challenging, especially with a busy schedule. It's great that you're trying to push through that hesitation, as building connections can be an important part of feeling less isolated. Have you considered starting with smaller commitments, such as joining an online community or participating in a one-time event, to help you ease into these new social experiences?",
      "phase": "exploring"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Yes, I've considered starting with smaller commitments like online communities, but it's still tough because I often feel like these don't fully replace the traditional college social life I'm missing out on. I'm willing to try a one-time event to see if it helps ease into building those connections.",
      "phase": "exploring"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively elicited and reflected the client's story about isolation and FOMO related to online schooling, demonstrating empathy and building rapport throughout the session (e.g., 'It's completely understandable to feel a sense of isolation and longing for connection'). The client has articulated feelings and barriers clearly and engaged in exploring possible actions (joining meetups, online communities). Goals are implicitly agreed upon, focusing on connection-building despite challenges. Resistance is low, and the client displays some activation/change talk—willingness to try smaller commitments and push through hesitation. However, the client has not yet explicitly linked change to core personal values or requested specific next steps. Given the current phase (Exploring), the session has substantially met objectives and shows readiness signals with emerging change talk and minimal resistance, supporting a move to Guiding.\",\n  \"determination\": \"move\"\n}",
      "phase": "exploring"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "That's a great idea! Attending a one-time event can be a low-pressure way to explore your interests and meet new people without the commitment of a regular schedule. It might also help you gauge which activities you enjoy most and would like to pursue further. Have you started looking for any upcoming events in your area that align with your hobbies or interests?",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Yes, I've started looking into some upcoming events related to hiking and local meetups that match my interests. Even though it's hard to balance with my schedule, I'm hoping this will help me feel more connected and less like I'm missing out on typical college experiences.",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist successfully evoked discrepancy between the client's current isolation and their value of social connection, as seen in discussions about missing out and efforts to build social ties through new activities. The client explored pros and cons of change, expressing willingness to try one-time events and joining communities despite scheduling challenges, showing Activation/Commitment language (e.g., 'I'm willing to try a one-time event,' 'I've started looking into some upcoming events'). Ambivalence remains but has lessened, with minimal Sustain Talk. The therapist used reflective listening and concise summaries, and the client articulated specific next steps. Importance and confidence appear sufficient given the client's expressed intentions. Thus, guiding objectives are substantially met, signaling readiness to move forward.\",\n  \"determination\": \"move\"\n}",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "It's great to see your determination in seeking out these events despite your busy schedule. Remember, even attending one event can be a positive step towards building connections and alleviating those feelings of isolation. When you find an event that piques your interest, would you like to share it with me so we can discuss any concerns or expectations you might have?",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "Yes, I'd like to share an event with you once I find one that really interests me. It could help me work through those feelings of missing out by discussing any worries beforehand.",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has identified a specific, clear goal: attending one-time local or online social events related to their interests (hiking, book clubs) as a manageable step to combat isolation and FOMO. They have started looking for such events and are willing to try these smaller commitments despite schedule challenges. The therapist and client collaboratively discussed action plans including attending low-pressure events, easing into social activities, and sharing event choices for support. The client expressed sustained commitment by actively searching for events and agreeing to follow-up discussions. There is minimal resistance; the client refines plans to fit their circumstances. Confidence and a plan for monitoring progress via future sessions are evident, signaling readiness to move forward.\",\n  \"determination\": \"move\"\n}",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "It's wonderful to see your commitment to finding events that align with your hobbies and interests. I'm confident that attending these events will help you create meaningful connections and feel more engaged in social experiences. Please do share the event details with me when you find one, and we can discuss any concerns or expectations you may have. Remember, even small steps can lead to significant changes. I look forward to hearing about your progress during our next contact.",
      "phase": "terminating"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "I'll make sure to share details about an event once I find one, as I'm hoping it helps ease my FOMO from missing out on college social life. Thanks for the supporttalk to you next time.",
      "phase": "terminating"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively summarized the client's goals and progress by reflecting on the client's efforts to build social connections despite challenges. The client acknowledges these reflections and expresses readiness to share event details and continue working on social engagement. The therapist reinforces responsibility and arranges next contact by inviting the client to share event information in the future and expressing confidence in the client's steps forward. Additionally, a gentle closure invitation is explicitly communicated with the phrase 'talk to you next time.' These elements fulfill the Termination phase objectives naturally.\",\n  \"determination\": \"stop\"\n}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hey there! How's your day going so far? Is there anything on your mind you'd like to talk about?\nclient: My day is going alright, but I've been feeling a bit isolated lately. Yes, I'd like to talk about some feelings of missing out on social experiences.\ntherapist: It sounds like you're feeling a bit lonely and disconnected. It's great that you're reaching out to talk about it. Can you tell me more about what's been happening lately that's making you feel this way?\nclient: I've been mostly sticking to online classes and work, which has left me feeling more isolated from social activities. Lately, seeing friends' posts about their college experiences has amplified this sense of missing out on building connections.\ntherapist: That must be really tough, especially when you're seeing your friends having these experiences that you feel you're missing out on. It's completely understandable to feel a sense of isolation and longing for connection. Have you considered reaching out to your friends or trying to find ways to build connections in your own life, even if they might look a bit different than your friends' experiences?\nclient: I've thought about reaching out to my friends more, but it hasn't been easy with my current schedule. I'm trying to find ways to build connections on my own, though it's challenging when I feel like I'm missing out on typical college experiences.\ntherapist: It seems like you've been feeling a sense of disconnection and loneliness due to your current circumstances, and it's completely valid to feel that way. It's great that you're taking steps to build connections on your own, even if it may be challenging at times. Remember that everyone's experiences are unique, and it's important to find what works best for you. Have you considered any specific activities or hobbies that might help you feel more connected to others, even if they're not typical college experiences?\nclient: I've considered joining local meetups or online communities related to my hobbies, like hiking or book clubs, to connect with others outside of my usual routine. However, it's been tough to follow through because of my packed schedule and the ongoing sense of missing out on more traditional social experiences.\ntherapist: It sounds like you've been putting in a lot of effort to find ways to connect with others, despite the challenges you've been facing. It can be difficult to balance your responsibilities and your desire for social experiences, but it's important to remember that even small steps can make a difference. Have you thought about setting aside a specific time each week to participate in one of those activities, like a book club or a hiking group, so that it becomes a part of your routine?\nclient: I've thought about scheduling specific times for activities like hiking groups, but my packed routine often makes it hard to commit. Even so, I'm trying to push through that hesitation to build those connections despite feeling like I'm missing out on more traditional college social life.\ntherapist: It's understandable that finding time for new activities can be challenging, especially with a busy schedule. It's great that you're trying to push through that hesitation, as building connections can be an important part of feeling less isolated. Have you considered starting with smaller commitments, such as joining an online community or participating in a one-time event, to help you ease into these new social experiences?\nclient: Yes, I've considered starting with smaller commitments like online communities, but it's still tough because I often feel like these don't fully replace the traditional college social life I'm missing out on. I'm willing to try a one-time event to see if it helps ease into building those connections.\ntherapist: That's a great idea! Attending a one-time event can be a low-pressure way to explore your interests and meet new people without the commitment of a regular schedule. It might also help you gauge which activities you enjoy most and would like to pursue further. Have you started looking for any upcoming events in your area that align with your hobbies or interests?\nclient: Yes, I've started looking into some upcoming events related to hiking and local meetups that match my interests. Even though it's hard to balance with my schedule, I'm hoping this will help me feel more connected and less like I'm missing out on typical college experiences.\ntherapist: It's great to see your determination in seeking out these events despite your busy schedule. Remember, even attending one event can be a positive step towards building connections and alleviating those feelings of isolation. When you find an event that piques your interest, would you like to share it with me so we can discuss any concerns or expectations you might have?\nclient: Yes, I'd like to share an event with you once I find one that really interests me. It could help me work through those feelings of missing out by discussing any worries beforehand.\ntherapist: It's wonderful to see your commitment to finding events that align with your hobbies and interests. I'm confident that attending these events will help you create meaningful connections and feel more engaged in social experiences. Please do share the event details with me when you find one, and we can discuss any concerns or expectations you may have. Remember, even small steps can lead to significant changes. I look forward to hearing about your progress during our next contact.\nclient: I'll make sure to share details about an event once I find one, as I'm hoping it helps ease my FOMO from missing out on college social life. Thanks for the supporttalk to you next time.",
  "completed": true
}