{
  "id": "170tz10",
  "timestamp": 1696464000000,
  "category": "academic",
  "concern": "\nLooking to make the switch to either civil or biomedical engineering. Unfortunately realized this way too late and have already obtained my bachelors in biology and had a subpar gpa (2.89). I do understand biomedical would be the easier switch but I favor civil/architectural a bit more since I have interest in designing and construction of buildings (I guess for certain masters programs it would fall under architectural engineering- but a civim degree is applicable to most jobs that I had interest in as well since it has somewhat of a similar basis) What would be the best way to make the switch: \n\n1- restart with a 2nd bachelors with a CC first and transfer somewhere that allows a 2nd bachelors essentially re-doing the 4 years (not all schools allow a 2nd bachelors)\n\n2- take some CC credits related to engineering and apply for internships to get my foot in the door and ultimately apply for a masters with work experience\n\n3- get an AA/AS degree in an engineering pathway + my BS in biology behind me + future internships, then apply to masters programs\n\nThe ability to complete and get decent grades is not the problem, to keep it short I was taking care of one of my parents (immigrant family so additionally I was somewhat in charge of taking care of my younger sibling) and working 2-3 jobs in undergrad while also just pursuing a degree I wasn’t super interested in- not an excuse at all but provides a bit of background.  I do have previous internships from med device companies/practices with 3D designing their products from scratch(which I liked doing as well), the previous medical companies + Dr’s also said they could write me a glowing letters of rec for my work with them over 4 years. Just looking to see feedback on which route is most beneficial or any other ideas someone might have, not worried about the time it would take for any option!",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Welcome! Is there something you'd like to talk about today? I'm here to listen and offer support in any way I can.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Yes, I'd like to talk about some career decisions I'm navigating right now. It's related to my future path after my biology degree.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist welcomed the client warmly and invited them to share their concerns, which the client did in detail, outlining their story, background, and specific challenges. Empathy is demonstrated by the therapist’s open invitation and the client’s comfort in sharing personal circumstances, including caregiving responsibilities. The client clearly states their goals and expresses openness about the path forward, indicating psychological safety. However, there are no explicit Change Talk utterances or signals of motivation for specific change steps yet. The dialogue is rich in exploring issues and goals but has not yet moved toward evoking motivation or planning. Thus, the session meets Exploring objectives but is not ready to advance.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "That sounds like an important decision. It's great that you're thinking about your future and exploring your options. Can you tell me a bit more about the different paths you're considering?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "I'm considering switching from my biology background to engineering fields like civil or biomedical, and I'm weighing options such as pursuing additional coursework, gaining work experience through internships, or applying to advanced degree programs. Ultimately, I'm focused on finding the path that best matches my interests in design and construction while building on my existing skills.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited the client's story in detail, reflecting empathy towards the client's situation, background, and goals. The client has openly shared concerns, motivations, and potential pathways, demonstrating psychological safety and low resistance. Session goals around exploring career options and educational pathways have been mutually understood. However, there is minimal explicit Change Talk about commitment or next steps, though the client is clearly engaged and seeking direction. Given the rich exploration and minimal resistance, and to avoid circular discussion, it is appropriate to advance to the Guiding phase to strengthen motivation and evoke Change Talk.\",\n  \"determination\": \"move\"\n}",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It's great that you're exploring a variety of options and considering how your interests can align with different career paths. It sounds like you have a strong foundation in biology, and you're looking to expand your skills into engineering fields like civil or biomedical. How confident do you feel in your ability to make this transition?",
      "phase": "guiding"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "I feel fairly confident in my ability to transition, given my past experiences and determination to build on my skills. However, I'm still navigating the best path to align my interests in design and construction with a new field.",
      "phase": "guiding"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited the client's story and explored different options for career transition, reflecting empathy and understanding of the client's values and goals. The client has articulated specific potential next steps (e.g., pursuing a second bachelor's, taking community college credits, obtaining an AA/AS degree plus internships). Confidence in making the transition is expressed, and the therapist's questions have encouraged exploration of pros and cons. However, there is no explicit commitment or activation change talk (e.g., 'I will apply for internships') yet, and ambivalence remains present regarding the best path. The importance/confidence rulers have been briefly touched on but not fully completed. Thus, readiness signals are emerging but not fully solidified.\",\n  \"determination\": \"continue\"\n}",
      "phase": "guiding"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It's great to hear that you're feeling fairly confident about your ability to transition. Making a career change can be challenging, but having self-confidence and determination can make a significant difference. As you continue to explore your options, have you considered seeking advice from professionals in the engineering fields you're interested in? They may be able to provide valuable insights and guidance to help you navigate this transition.",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "I've considered seeking advice from professionals in engineering fields, drawing from my existing connections in related industries. This approach aligns with my goal to build on my skills for a smoother transition into design and construction areas.",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist successfully evoked discrepancy by highlighting the client's career interests versus their current biology background and GPA. The client explored pros and cons of pathways, showing awareness of challenges and options. Confidence was expressed regarding transition ability, and seeking advice from professionals was mentioned as a concrete next step. Although no explicit importance/confidence rulers were used, the client's detailed consideration of multiple plans and readiness to engage in internships and further education signals commitment. Ambivalence decreased as the client articulated preferences and feasible steps. A clear activation statement was present in the client’s intent to leverage connections and internships.\",\n  \"determination\": \"move\"\n}",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "That's a great idea to leverage your existing connections and seek advice from professionals in engineering fields. It's important to gather as much information as possible to make informed decisions about your career transition. Have you thought about setting up informational interviews with some of these professionals in the coming weeks?",
      "phase": "choosing"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Yes, I've thought about setting up informational interviews with professionals soon, as it would help me explore engineering paths that align with my design interests. This step feels like a natural way to build on my existing experiences and move forward confidently.",
      "phase": "choosing"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has identified a clear, specific goal: transitioning into civil or biomedical engineering with a preference for civil/architectural fields, and has articulated three concrete pathways with pros and cons. The client has agreed on concrete next steps, such as setting up informational interviews soon, showing a commitment statement: \\\"This step feels like a natural way to build on my existing experiences and move forward confidently.\\\" Anticipated barriers like GPA concerns and decision complexity were indirectly addressed by exploring multiple options and leveraging past experience. The client demonstrates confidence and readiness to proceed, and the conversation is naturally preparing for follow-up actions. Therefore, the Choosing phase objectives are met, signaling readiness to move to Terminating.\",\n  \"determination\": \"move\"\n}",
      "phase": "choosing"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "It sounds like you have a clear plan to gather more information and make informed decisions about your career transition. Setting up informational interviews with professionals in engineering fields will provide valuable insights and help you explore paths that align with your interests in design and construction. Remember to stay focused on your goals and keep building on your skills and experiences. I wish you the best of luck in your career journey. Feel free to reach out again if you need further support or guidance.",
      "phase": "terminating"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Thank you for your guidance I'll move forward with those informational interviews to explore my engineering switch options and build on my design interests. Take care.",
      "phase": "terminating"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist offers a clear summary of the client's plan to gather information through informational interviews and encourages continued focus on goals and skill-building (last therapist turn). The client acknowledges this summary and expresses gratitude and readiness to proceed with their plan. The therapist also gently closes by inviting the client to reach out again for support, which serves as a closure invitation. Therefore, all Termination objectives are met: summary of goals and action steps, client acknowledgment and readiness, and discussion of next-step options. The conversation has reached a natural conclusion without circularity.\",\n  \"determination\": \"stop\"\n}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Welcome! Is there something you'd like to talk about today? I'm here to listen and offer support in any way I can.\nclient: Yes, I'd like to talk about some career decisions I'm navigating right now. It's related to my future path after my biology degree.\ntherapist: That sounds like an important decision. It's great that you're thinking about your future and exploring your options. Can you tell me a bit more about the different paths you're considering?\nclient: I'm considering switching from my biology background to engineering fields like civil or biomedical, and I'm weighing options such as pursuing additional coursework, gaining work experience through internships, or applying to advanced degree programs. Ultimately, I'm focused on finding the path that best matches my interests in design and construction while building on my existing skills.\ntherapist: It's great that you're exploring a variety of options and considering how your interests can align with different career paths. It sounds like you have a strong foundation in biology, and you're looking to expand your skills into engineering fields like civil or biomedical. How confident do you feel in your ability to make this transition?\nclient: I feel fairly confident in my ability to transition, given my past experiences and determination to build on my skills. However, I'm still navigating the best path to align my interests in design and construction with a new field.\ntherapist: It's great to hear that you're feeling fairly confident about your ability to transition. Making a career change can be challenging, but having self-confidence and determination can make a significant difference. As you continue to explore your options, have you considered seeking advice from professionals in the engineering fields you're interested in? They may be able to provide valuable insights and guidance to help you navigate this transition.\nclient: I've considered seeking advice from professionals in engineering fields, drawing from my existing connections in related industries. This approach aligns with my goal to build on my skills for a smoother transition into design and construction areas.\ntherapist: That's a great idea to leverage your existing connections and seek advice from professionals in engineering fields. It's important to gather as much information as possible to make informed decisions about your career transition. Have you thought about setting up informational interviews with some of these professionals in the coming weeks?\nclient: Yes, I've thought about setting up informational interviews with professionals soon, as it would help me explore engineering paths that align with my design interests. This step feels like a natural way to build on my existing experiences and move forward confidently.\ntherapist: It sounds like you have a clear plan to gather more information and make informed decisions about your career transition. Setting up informational interviews with professionals in engineering fields will provide valuable insights and help you explore paths that align with your interests in design and construction. Remember to stay focused on your goals and keep building on your skills and experiences. I wish you the best of luck in your career journey. Feel free to reach out again if you need further support or guidance.\nclient: Thank you for your guidance I'll move forward with those informational interviews to explore my engineering switch options and build on my design interests. Take care.",
  "completed": true
}