{
  "id": "10pknnn",
  "timestamp": 1675123200000,
  "category": "academic",
  "concern": "I have never been in an academic setting that challenged me so much. In undergrad I was always on top of my work and had enough time to enjoy myself, go to the gym, and even party. In my second year of my PhD program all I do is work and on the weekends I usually sleep or go out somewhere just to try to enjoy myself. Now that the semester has begun I lost my Sundays to a full day of class work. I am so lucky to do what I love, but I love it a lot less when I am being overworked. It does not help that my PI is an absolute workaholic. How do people not burn out working 6 days a week with such mentally involved tasks?",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hello! I'm glad you're here today. Feel free to share whatever's on your mind or anything you'd like to explore together.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Hey, thanks. I'm just trying to figure out how to balance everything. It's starting to feel like all I do is work and it's kind of draining.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shared their main concern about work-life balance and feeling overwhelmed. However, more detailed exploration of thoughts and feelings, context, and developing empathy and rapport are needed before moving to the next phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "therapist: That sounds really overwhelming, feeling like work is taking over everything. What does a typical day look like for you right now?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "client: Well, I usually wake up, head straight to my lab or classes, and then it's nonstop until late evening. By the time I get home, I'm too exhausted to do much else.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shared their main concern about balancing work and personal life, providing insight into their routine and feelings. However, deeper exploration of the emotional impact and further context around their current situation is still needed to fully meet the Exploring phase goals.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "therapist: It sounds exhausting to have such a packed schedule. How do you feel about the way your days are structured right now?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "Honestly, it feels like I'm trapped in this cycle of work and exhaustion. I miss having time to just relax or do things that aren't related to my studies.",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has detailed their schedule and feelings of exhaustion, revealing the underlying struggle with work-life balance and burnout. There is a clear understanding of their concerns and feelings, and rapport is evident. The exploration goals are met, setting the stage to guide the client towards motivation for change.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "That sounds really tough, feeling trapped like that. What would it mean for you to have more time to relax or pursue other activities?",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "I think having more time would help me feel more balanced and less overwhelmed. It'd be nice to have some space to recharge and maybe even reconnect with hobbies or just hang out with friends without feeling guilty about not working.",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a discrepancy between their current situation and their values, recognizing a lack of balance and desire for personal time. They have not yet articulated specific goals or next steps, and Change Talk is emerging but not fully explored. The dialogue is still at an early stage to ensure confidence and readiness for change.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It sounds like having that balance would bring a lot of positive changes to your life. What are some small steps you might consider to create more space for relaxation and connection in your routine?",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Maybe I could try setting some boundaries, like a strict cut-off time to stop working in the evenings. I think even just committing to a short break during the day to step outside, or have lunch away from my desk could make a difference too.",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a specific concern and a desire for change, and they have identified potential steps to improve their situation, such as setting boundaries and taking breaks. However, the conversation is still exploring options and building motivation. More guidance on refining these steps and addressing barriers is needed before moving to the Choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "therapist: Those sound like really thoughtful ideas. How confident do you feel, on a scale from 0 to 10, about trying out these small changes to create more balance in your life?",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Honestly, I'm probably around a 5 or 6. It's tough to break out of the habit of just working all the time, especially when there's always something I feel like I should be doing. But I do want to try and make it work, even if it's just starting small.",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed some Change Talk by identifying potential steps for creating balance and their confidence level is at a 5 or 6. They've expressed a desire for change but still exhibit some ambivalence about overcoming habits. More exploration may solidify their readiness for action.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "Therapist: It's great to hear that you're willing to give it a try, even if it's challenging. What might help increase your confidence from a 5 or 6 to a higher number?",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Having some accountability might help, like maybe sharing my goals with a friend who can check in with me. Also, seeing some positive results from taking breaks, like feeling more refreshed and focused, would probably make me more confident in sticking to it.",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a clear discrepancy between their current behavior and desired values (work-life balance). They have identified specific change goals, such as setting work boundaries and taking breaks, and their confidence is at a 5-6, showing room for improvement but readiness to try. Change Talk is present, and ambivalence is addressed with potential strategies for increasing confidence. It's appropriate to move to the Choosing phase.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "Let's build on those ideas to create a plan that works for you. Based on what you've mentioned, possible steps could include setting a specific cut-off time for work, taking a daily break outside, and sharing your goals with a supportive friend. What do you think about starting with these, and how might you approach any potential challenges that come up?",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "Yeah, that sounds like a solid plan to start with. I think I'll need to remind myself that it's okay to step away from work and that it's not going to fall apart if I take a break. Keeping in mind that these changes are meant to help in the long run could be motivating.",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has a clear goal and action plan to create a more balanced lifestyle, acknowledging potential barriers and considering accountability and self-reminders to increase confidence. However, further discussion and self-monitoring strategies are needed to ensure these changes are sustainable and address the concern of burnout fully.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "Therapist: It sounds like you have a clear understanding of how stepping away can be beneficial. What specific goal would you like to set for this coming week to begin implementing these changes? And how might you keep track of your progress to stay motivated?",
      "phase": "choosing"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "I think I'll aim to have at least one hour each day where I disconnect from work completely, maybe by going for a walk or doing something unrelated to my research. To keep track, I'll probably jot down a quick note about how I felt after each break in my journal or on my phone, just to see any patterns or improvements over time.",
      "phase": "choosing"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has articulated a clear action plan involving setting work boundaries, taking breaks, and seeking accountability. They discussed potential barriers and ways to self-monitor progress, such as journaling. Confidence levels were addressed, and the client is actively seeking ways to improve this. The plan is specific and actionable, indicating readiness for testing these changes. As such, the client is ready to move beyond the Choosing phase.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "It sounds like you’ve set a meaningful goal for yourself by planning to take an hour each day to disconnect from work and recharge. By choosing to walk or engage in activities unrelated to your research, you’re creating space for rest and reflection, which can certainly lead to positive changes over time. Tracking how you feel afterwards in a journal or your phone is a wise way to notice patterns and celebrate the improvements you’re making. \n\nYou're taking thoughtful steps toward your well-being, and that's truly commendable. As you move forward, remember that it's perfectly okay to make adjustments along the way—these changes are for your benefit, and you’re the best judge of what works for you. \n\nIf you ever feel overwhelmed or encounter any bumps in the road, don’t hesitate to reach out for support. Checking in with a friend or even revisiting our conversations can help reinforce your progress. \n\nYou’ve got a strong start here, and I’m confident in your ability to make these positive changes stick. Please feel free to reach out anytime for guidance or just to share your successes. Wishing you a refreshing week ahead!",
      "phase": "terminating"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "Thanks, I really appreciate your support and encouragement. I'll definitely reach out if I hit any roadblocks or want to share how things are going.",
      "phase": "terminating"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The session has covered summary of goals, steps, and coping strategies, and the client has a clear next-step plan. The client's determination and understanding of adjustments suggest readiness to conclude naturally.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hello! I'm glad you're here today. Feel free to share whatever's on your mind or anything you'd like to explore together.\nclient: Hey, thanks. I'm just trying to figure out how to balance everything. It's starting to feel like all I do is work and it's kind of draining.\ntherapist: therapist: That sounds really overwhelming, feeling like work is taking over everything. What does a typical day look like for you right now?\nclient: client: Well, I usually wake up, head straight to my lab or classes, and then it's nonstop until late evening. By the time I get home, I'm too exhausted to do much else.\ntherapist: therapist: It sounds exhausting to have such a packed schedule. How do you feel about the way your days are structured right now?\nclient: Honestly, it feels like I'm trapped in this cycle of work and exhaustion. I miss having time to just relax or do things that aren't related to my studies.\ntherapist: That sounds really tough, feeling trapped like that. What would it mean for you to have more time to relax or pursue other activities?\nclient: I think having more time would help me feel more balanced and less overwhelmed. It'd be nice to have some space to recharge and maybe even reconnect with hobbies or just hang out with friends without feeling guilty about not working.\ntherapist: It sounds like having that balance would bring a lot of positive changes to your life. What are some small steps you might consider to create more space for relaxation and connection in your routine?\nclient: Maybe I could try setting some boundaries, like a strict cut-off time to stop working in the evenings. I think even just committing to a short break during the day to step outside, or have lunch away from my desk could make a difference too.\ntherapist: therapist: Those sound like really thoughtful ideas. How confident do you feel, on a scale from 0 to 10, about trying out these small changes to create more balance in your life?\nclient: Honestly, I'm probably around a 5 or 6. It's tough to break out of the habit of just working all the time, especially when there's always something I feel like I should be doing. But I do want to try and make it work, even if it's just starting small.\ntherapist: Therapist: It's great to hear that you're willing to give it a try, even if it's challenging. What might help increase your confidence from a 5 or 6 to a higher number?\nclient: Having some accountability might help, like maybe sharing my goals with a friend who can check in with me. Also, seeing some positive results from taking breaks, like feeling more refreshed and focused, would probably make me more confident in sticking to it.\ntherapist: Let's build on those ideas to create a plan that works for you. Based on what you've mentioned, possible steps could include setting a specific cut-off time for work, taking a daily break outside, and sharing your goals with a supportive friend. What do you think about starting with these, and how might you approach any potential challenges that come up?\nclient: Yeah, that sounds like a solid plan to start with. I think I'll need to remind myself that it's okay to step away from work and that it's not going to fall apart if I take a break. Keeping in mind that these changes are meant to help in the long run could be motivating.\ntherapist: Therapist: It sounds like you have a clear understanding of how stepping away can be beneficial. What specific goal would you like to set for this coming week to begin implementing these changes? And how might you keep track of your progress to stay motivated?\nclient: I think I'll aim to have at least one hour each day where I disconnect from work completely, maybe by going for a walk or doing something unrelated to my research. To keep track, I'll probably jot down a quick note about how I felt after each break in my journal or on my phone, just to see any patterns or improvements over time.\ntherapist: It sounds like you’ve set a meaningful goal for yourself by planning to take an hour each day to disconnect from work and recharge. By choosing to walk or engage in activities unrelated to your research, you’re creating space for rest and reflection, which can certainly lead to positive changes over time. Tracking how you feel afterwards in a journal or your phone is a wise way to notice patterns and celebrate the improvements you’re making. \n\nYou're taking thoughtful steps toward your well-being, and that's truly commendable. As you move forward, remember that it's perfectly okay to make adjustments along the way—these changes are for your benefit, and you’re the best judge of what works for you. \n\nIf you ever feel overwhelmed or encounter any bumps in the road, don’t hesitate to reach out for support. Checking in with a friend or even revisiting our conversations can help reinforce your progress. \n\nYou’ve got a strong start here, and I’m confident in your ability to make these positive changes stick. Please feel free to reach out anytime for guidance or just to share your successes. Wishing you a refreshing week ahead!\nclient: Thanks, I really appreciate your support and encouragement. I'll definitely reach out if I hit any roadblocks or want to share how things are going.",
  "completed": false
}