{
  "id": "10hyi0s",
  "timestamp": 1674259200000,
  "category": "emotional",
  "concern": "I just got a PSM degree and I ended up getting a good job so I can’t complain too much. But does anyone else feel a little embarrassed that they have a PSM vs an MS? If someone asks, I usually just say Masters and don’t get into it. But if someone asks for more detail I tell them its a PSM not an MS and they seem to get confused on what it is and just nod. Lol.\n\nAlso, does it seem to anyone else that most employers don’t know the difference between the two degrees? Do you put “Professional Science Masters” on your resume of just “Masters of xx”? \n\nPart of me is insecure because my undergrad is in a social science and my grad STEM. So I feel like an imposter at my job. Part of me wishes I just got an MS…..",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hi there! I'm really glad you're here. I'd love to hear what's been on your mind lately. Take your time, and don't hesitate to share whatever feels important to you.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Hey, thanks for being here to listen. I’ve just been feeling a bit off about my degree and how it’s perceived, and I’m kinda wrestling with some insecurity about my background and place in my job.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has only had one turn. The client has shared their concern about feeling insecure regarding their degree and job. More exploration is needed to fully understand the client's thoughts, feelings, and context before moving to the Guiding phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "It sounds like there's a lot weighing on you right now. Can you tell me a bit more about what's been making you feel this way?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "Client: Yeah, for sure. I just feel like my degree isn’t quite what people expect or understand, and since my background isn’t fully aligned with my current field, I sometimes worry I don’t really belong or measure up, you know?",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has less than 3 turns, and the client has shared initial thoughts and concerns about their degree and perceived professional identity. More exploration is needed to fully understand the client's feelings and context before moving to the Guiding phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "That must be really frustrating, feeling like you're being judged or underestimated because of something that's supposed to be a positive aspect of your life. Can you tell me more about how that insecurity manifests in your daily work?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "Client: Yeah, it’s tough. Like, I’m always second-guessing myself in meetings or when I’m working on projects, wondering if my colleagues can tell I don’t have the “typical” background or degree they might expect.\n\nI guess it just makes me feel like I have to prove myself extra hard, you know? I’m constantly worried that someone’s gonna call me out or think I’m not qualified, even though I landed a decent gig. Does that kind of anxiety ever go away, or am I just stuck overthinking this stuff?",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shared a detailed account of their concerns related to their degree, background, and work environment. The therapist has demonstrated empathy and understanding, and the client has expressed feelings of insecurity and impostor syndrome. With three turns completed, the essence of the client's story is clear, meeting the goals of the Exploring phase.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It's clear that you've been carrying a heavy load of self-doubt, and it's completely understandable to feel that way when you're navigating unfamiliar terrain. The good news is that this anxiety doesn't have to define your journey. By acknowledging and addressing these feelings, you can begin to shift your focus away from perceived shortcomings and toward your strengths and accomplishments. It's not about being \"\"stuck\"\"—it's about finding ways to reframe your mindset and build confidence in your abilities.",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "Thanks for saying that. It’s nice to hear that I’m not just doomed to feel this way forever, but honestly, I’m not sure how to even start shifting my mindset when I keep getting hung up on this degree thing and my background. Like, I know I’ve got skills and I’ve done well enough to get this job, but every time someone asks about my education, I just brace myself for confusion or judgment. Do you have any ideas on how I can stop letting that bother me so much?",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is in the early stages of the Guiding phase, with only 1 turn completed. The therapist has begun to explore the client's insecurities, but key elements like exploring discrepancies and evoking Change Talk are still in progress. Therefore, it's too early to move to the Choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "I can see how that constant self-doubt must be exhausting. It's like you're carrying this invisible weight, always ready to defend your worth. One idea is to reframe those moments when people ask about your education as opportunities to highlight your unique strengths and experiences, rather than just focusing on the degree itself. By shifting the narrative, you might start to see these interactions as chances to showcase your value rather than as potential pitfalls.",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Thanks, that makes sense. I guess I’ve been so focused on what I think people might assume about my degree that I haven’t really thought about flipping the convo to what I bring to the table. It’s just hard to shake that initial gut punch of insecurity when the topic comes up. Like, how do I even start practicing that kind of reframing without feeling like I’m just faking confidence? I want to own it, but I don’t know where to begin.",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation history shows exploration of the client's feelings and initial attempts to reframe their perspective. However, it's early in the Guiding phase with only 2 turns focusing on motivation and reframing strategies. Additional exploration is needed to solidify motivation and address ambivalence.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "It's completely understandable that it feels challenging to shift your mindset and reframe these interactions, especially when you've been conditioned to expect judgment. Perhaps we can start by exploring some specific moments when you've felt that \"\"gut punch\"\" of insecurity, and then work together to reframe those moments as opportunities to showcase your strengths. Would you be open to trying that?",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Yeah, I’m definitely open to that. I mean, there are plenty of moments where I’ve felt that insecurity kick in, and I’d like to figure out how to handle them better without just spiraling into doubt. Can we maybe start with a recent example, like when someone at work asked about my degree and I just froze up? I want to get a grip on how to respond without feeling so exposed.",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has not yet fully explored specific change goals or steps, even though the client has shown willingness and some openness to reframing situations. We have had 3 turns in the guiding phase, and there is active engagement in exploring strategies. Continuation in the guiding phase can further solidify confidence and reduce ambivalence.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "That's a great place to start. Let's take a closer look at that recent moment when you froze up. Can you walk me through what was going through your mind when the person asked about your degree? What thoughts or feelings came up for you in that moment?",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "I’m glad we’re digging into this. When they asked about my degree, I just got this instant wave of panic, like I was about to be judged or seen as less qualified. My mind went straight to worrying they’d think I don’t belong in a STEM role since my undergrad wasn’t even in a related field, and I just stumbled over my words trying to explain it. I felt so small, like I had to prove myself on the spot. What do you think I could’ve done differently right then to not get so stuck in my head?",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has engaged in Change Talk, discussing their insecurity and willingness to explore reframing their mindset. They've identified a specific change goal: to reframe interactions about their degree. The therapist and client explored a recent moment of insecurity and began discussing strategies. Although confidence levels haven't been explicitly mentioned, the client is open to solutions, indicating readiness. Guiding phase goals have been met, and progression is indicated.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "In that moment, it sounds like your mind was racing with worst-case scenarios and self-doubt, which made it hard to respond confidently. One possible strategy could be to pause and take a deep breath when you feel that panic rising, giving yourself a moment to ground yourself and shift your focus from worrying about what others might think to what you can share about your unique strengths and experiences. You might also consider preparing a few key phrases in advance that highlight your relevant skills and accomplishments, so you have a go-to response ready when these situations arise.",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "I appreciate that idea of taking a breath and having something prepared to say. It’s just tough because even thinking about prepping a response makes me feel like I’m putting on a front, you know? Like, what if I still sound unsure when I say it, or what if they ask follow-up questions I’m not ready for? I guess I’m worried I’ll still come off as insecure no matter how much I practice. How do I get past that fear of not sounding genuine or convincing enough?",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has just entered the Choosing phase with the therapist offering strategies to reframe the client's mindset and handle insecurity, but the client still expresses doubts about feeling genuine and convincing. More time is needed to solidify commitment and confidence before readiness to move forward.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "It's completely normal to feel that way, especially if you're worried about coming off as insincere. One thing that might help is to focus on what you genuinely bring to the table—your unique strengths, skills, and experiences. By emphasizing those things that you truly believe in and are passionate about, you'll come across as more confident and authentic. It's not about putting on a front, but rather about sharing your genuine self with others.",
      "phase": "choosing"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "Thanks for saying that, it makes sense to focus on what I actually believe in about my skills. I guess I just need to remind myself that I earned this job and my degree, even if it feels weird sometimes to own it. I’m still kinda stuck on how to not overthink every word when I’m talking about my background, though. Like, how do I stop worrying so much about how I’m being perceived and just... be myself in those moments?",
      "phase": "choosing"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a willingness to practice reframing their mindset and acknowledges the need to focus on their strengths. They have also agreed to explore specific examples and proposed strategies like taking a breath and preparing responses. However, they still express concerns about authenticity and overthinking, indicating that the action plan is not yet fully concrete. Therefore, further work is needed before moving to Terminating.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "It sounds like a lot of this comes down to trust in your own abilities and a shift in focus—from how you think you're being judged to what you truly bring to the table. One approach could be to practice those key phrases in low-pressure situations, like with a friend or in front of a mirror, until they feel more like second nature. This way, when the moment comes, you can lean into your preparation without overthinking it, trusting that your words are rooted in your authentic strengths. Would that feel like a manageable step, or are there other ways you think might help you find that balance between preparation and authenticity?",
      "phase": "choosing"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "Thanks for the suggestion about practicing in low-pressure settings—that does sound like something I could try without feeling too overwhelmed. I’m just wondering, though, if even with practice, I’ll still get that knot in my stomach when the real moment hits, you know? Like, what if I’ve got my lines down but still feel like a fraud inside? How do I deal with that feeling creeping up, especially when I’m already in the middle of a convo?",
      "phase": "choosing"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client and therapist have identified a clear goal of reframing interactions about the client's degree as opportunities to highlight strengths. The client is open to practicing responses, yet there are concerns about feeling like a fraud during real interactions. Given the current phase has 3 turns, the client has expressed readiness to try new strategies, but still needs more support to build confidence.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 20,
      "role": "therapist",
      "statement": "It's natural to still feel some nervousness, even with practice. Instead of trying to eliminate the feeling entirely, you might consider reframing it as a sign that you care about the outcome and are invested in sharing your genuine strengths. In those moments, remind yourself that it's okay to feel a bit uncomfortable, and trust that your preparation has equipped you with the tools to navigate the conversation authentically.",
      "phase": "choosing"
    },
    {
      "index": 21,
      "role": "client",
      "statement": "Thanks for that perspective—it’s helpful to think of the nervousness as just caring about the outcome rather than something to fight against. I guess I’ve always seen that knot in my stomach as a bad thing, but maybe it’s not entirely negative if I look at it that way. I’m still kinda curious, though, about how to handle it right in the moment when it hits, like if I’m mid-sentence and suddenly feel like I’m spiraling. Do you have any quick tricks or mental reminders I can use to ground myself without totally losing my train of thought?",
      "phase": "choosing"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has a clear action plan to reframe their mindset, practice in low-pressure settings, and use mental reminders to ground themselves during conversations. Barriers have been discussed, and the client is committed to taking steps towards genuine self-presentation. The conversation has not been stuck in circles, so moving forward to termination seems appropriate.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 22,
      "role": "therapist",
      "statement": "Great question! When you feel that knot in your stomach mid-sentence, try using the 5-4-3-2-1 grounding technique. This involves quickly naming 5 things you see, 4 things you feel, 3 things you hear, 2 things you smell, and 1 thing you taste. It may sound a bit silly, but this exercise can help you refocus your mind and prevent spiraling thoughts. Additionally, you can use a mental reminder, such as silently repeating a calming phrase like \"\"I am prepared, and I trust my abilities,\"\" to help you regain confidence in the moment.",
      "phase": "terminating"
    },
    {
      "index": 23,
      "role": "client",
      "statement": "Thanks for sharing that technique—it sounds like a practical way to pull myself back when I’m starting to spiral. I’ll definitely give the 5-4-3-2-1 thing a shot, even if it feels a bit odd at first. I’m just wondering, though, if there’s a way to practice this kind of grounding ahead of time so it feels more natural when I actually need it. Like, should I try it out in less stressful moments to get the hang of it?",
      "phase": "terminating"
    },
    {
      "index": "al",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The therapist and client have discussed coping strategies and specific techniques to address the client's concerns. A next-step plan involving practice is outlined, meeting termination goals. Session closure feels natural.\",\n\"determination\": \"stop\"\n}\n```",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hi there! I'm really glad you're here. I'd love to hear what's been on your mind lately. Take your time, and don't hesitate to share whatever feels important to you.\nclient: Hey, thanks for being here to listen. I’ve just been feeling a bit off about my degree and how it’s perceived, and I’m kinda wrestling with some insecurity about my background and place in my job.\ntherapist: It sounds like there's a lot weighing on you right now. Can you tell me a bit more about what's been making you feel this way?\nclient: Client: Yeah, for sure. I just feel like my degree isn’t quite what people expect or understand, and since my background isn’t fully aligned with my current field, I sometimes worry I don’t really belong or measure up, you know?\ntherapist: That must be really frustrating, feeling like you're being judged or underestimated because of something that's supposed to be a positive aspect of your life. Can you tell me more about how that insecurity manifests in your daily work?\nclient: Client: Yeah, it’s tough. Like, I’m always second-guessing myself in meetings or when I’m working on projects, wondering if my colleagues can tell I don’t have the “typical” background or degree they might expect.\n\nI guess it just makes me feel like I have to prove myself extra hard, you know? I’m constantly worried that someone’s gonna call me out or think I’m not qualified, even though I landed a decent gig. Does that kind of anxiety ever go away, or am I just stuck overthinking this stuff?\ntherapist: It's clear that you've been carrying a heavy load of self-doubt, and it's completely understandable to feel that way when you're navigating unfamiliar terrain. The good news is that this anxiety doesn't have to define your journey. By acknowledging and addressing these feelings, you can begin to shift your focus away from perceived shortcomings and toward your strengths and accomplishments. It's not about being \"\"stuck\"\"—it's about finding ways to reframe your mindset and build confidence in your abilities.\nclient: Thanks for saying that. It’s nice to hear that I’m not just doomed to feel this way forever, but honestly, I’m not sure how to even start shifting my mindset when I keep getting hung up on this degree thing and my background. Like, I know I’ve got skills and I’ve done well enough to get this job, but every time someone asks about my education, I just brace myself for confusion or judgment. Do you have any ideas on how I can stop letting that bother me so much?\ntherapist: I can see how that constant self-doubt must be exhausting. It's like you're carrying this invisible weight, always ready to defend your worth. One idea is to reframe those moments when people ask about your education as opportunities to highlight your unique strengths and experiences, rather than just focusing on the degree itself. By shifting the narrative, you might start to see these interactions as chances to showcase your value rather than as potential pitfalls.\nclient: Thanks, that makes sense. I guess I’ve been so focused on what I think people might assume about my degree that I haven’t really thought about flipping the convo to what I bring to the table. It’s just hard to shake that initial gut punch of insecurity when the topic comes up. Like, how do I even start practicing that kind of reframing without feeling like I’m just faking confidence? I want to own it, but I don’t know where to begin.\ntherapist: It's completely understandable that it feels challenging to shift your mindset and reframe these interactions, especially when you've been conditioned to expect judgment. Perhaps we can start by exploring some specific moments when you've felt that \"\"gut punch\"\" of insecurity, and then work together to reframe those moments as opportunities to showcase your strengths. Would you be open to trying that?\nclient: Yeah, I’m definitely open to that. I mean, there are plenty of moments where I’ve felt that insecurity kick in, and I’d like to figure out how to handle them better without just spiraling into doubt. Can we maybe start with a recent example, like when someone at work asked about my degree and I just froze up? I want to get a grip on how to respond without feeling so exposed.\ntherapist: That's a great place to start. Let's take a closer look at that recent moment when you froze up. Can you walk me through what was going through your mind when the person asked about your degree? What thoughts or feelings came up for you in that moment?\nclient: I’m glad we’re digging into this. When they asked about my degree, I just got this instant wave of panic, like I was about to be judged or seen as less qualified. My mind went straight to worrying they’d think I don’t belong in a STEM role since my undergrad wasn’t even in a related field, and I just stumbled over my words trying to explain it. I felt so small, like I had to prove myself on the spot. What do you think I could’ve done differently right then to not get so stuck in my head?\ntherapist: In that moment, it sounds like your mind was racing with worst-case scenarios and self-doubt, which made it hard to respond confidently. One possible strategy could be to pause and take a deep breath when you feel that panic rising, giving yourself a moment to ground yourself and shift your focus from worrying about what others might think to what you can share about your unique strengths and experiences. You might also consider preparing a few key phrases in advance that highlight your relevant skills and accomplishments, so you have a go-to response ready when these situations arise.\nclient: I appreciate that idea of taking a breath and having something prepared to say. It’s just tough because even thinking about prepping a response makes me feel like I’m putting on a front, you know? Like, what if I still sound unsure when I say it, or what if they ask follow-up questions I’m not ready for? I guess I’m worried I’ll still come off as insecure no matter how much I practice. How do I get past that fear of not sounding genuine or convincing enough?\ntherapist: It's completely normal to feel that way, especially if you're worried about coming off as insincere. One thing that might help is to focus on what you genuinely bring to the table—your unique strengths, skills, and experiences. By emphasizing those things that you truly believe in and are passionate about, you'll come across as more confident and authentic. It's not about putting on a front, but rather about sharing your genuine self with others.\nclient: Thanks for saying that, it makes sense to focus on what I actually believe in about my skills. I guess I just need to remind myself that I earned this job and my degree, even if it feels weird sometimes to own it. I’m still kinda stuck on how to not overthink every word when I’m talking about my background, though. Like, how do I stop worrying so much about how I’m being perceived and just... be myself in those moments?\ntherapist: It sounds like a lot of this comes down to trust in your own abilities and a shift in focus—from how you think you're being judged to what you truly bring to the table. One approach could be to practice those key phrases in low-pressure situations, like with a friend or in front of a mirror, until they feel more like second nature. This way, when the moment comes, you can lean into your preparation without overthinking it, trusting that your words are rooted in your authentic strengths. Would that feel like a manageable step, or are there other ways you think might help you find that balance between preparation and authenticity?\nclient: Thanks for the suggestion about practicing in low-pressure settings—that does sound like something I could try without feeling too overwhelmed. I’m just wondering, though, if even with practice, I’ll still get that knot in my stomach when the real moment hits, you know? Like, what if I’ve got my lines down but still feel like a fraud inside? How do I deal with that feeling creeping up, especially when I’m already in the middle of a convo?\ntherapist: It's natural to still feel some nervousness, even with practice. Instead of trying to eliminate the feeling entirely, you might consider reframing it as a sign that you care about the outcome and are invested in sharing your genuine strengths. In those moments, remind yourself that it's okay to feel a bit uncomfortable, and trust that your preparation has equipped you with the tools to navigate the conversation authentically.\nclient: Thanks for that perspective—it’s helpful to think of the nervousness as just caring about the outcome rather than something to fight against. I guess I’ve always seen that knot in my stomach as a bad thing, but maybe it’s not entirely negative if I look at it that way. I’m still kinda curious, though, about how to handle it right in the moment when it hits, like if I’m mid-sentence and suddenly feel like I’m spiraling. Do you have any quick tricks or mental reminders I can use to ground myself without totally losing my train of thought?\ntherapist: Great question! When you feel that knot in your stomach mid-sentence, try using the 5-4-3-2-1 grounding technique. This involves quickly naming 5 things you see, 4 things you feel, 3 things you hear, 2 things you smell, and 1 thing you taste. It may sound a bit silly, but this exercise can help you refocus your mind and prevent spiraling thoughts. Additionally, you can use a mental reminder, such as silently repeating a calming phrase like \"\"I am prepared, and I trust my abilities,\"\" to help you regain confidence in the moment.\nclient: Thanks for sharing that technique—it sounds like a practical way to pull myself back when I’m starting to spiral. I’ll definitely give the 5-4-3-2-1 thing a shot, even if it feels a bit odd at first. I’m just wondering, though, if there’s a way to practice this kind of grounding ahead of time so it feels more natural when I actually need it. Like, should I try it out in less stressful moments to get the hang of it?",
  "completed": true
}