{
  "id": "123ppzd",
  "timestamp": 1679875200000,
  "category": "school_life",
  "concern": "In undergrad, I was on top of my shit. Gears changing constantly. Though the classes were easier, there were more of them and the subjects were more varied. Work/internship/research. Student organizations. Events and planning. Prep for professional life and grad school. Social life. So many things, and I rarely if ever dropped the ball. I felt like a machine. Fulfilling and purposeful work. We were all ready to change the world.\n\nIn grad school, dropping the ball has become business as usual. Throughout my department, people drop commitments without announcement, show up late to meetings, miss deadlines, and send emails after the fact - sometimes apologetic and others accusatory. Presentations and papers are thrown together last minute, and lectures are permeated with the constant undertone, \"There are much better uses of my time than this,\" from both instructors and students. Resources to prepare for industry or education (anything outside of research, really) are scant - treated as obligatory by the department - and those who seek them out are viewed as admitting burnout or a lack of commitment or skill. Research is carried out with petty comments and measuring contests. People trade shady favors, becoming authors of papers to which they didn't contribute and exchanging techniques to fudge numbers and buy time. Those who are seated in tenured research positions seem constantly frazzled. If you ever ask them how to develop yourself, where to find meaning, how to generate questions and goals, you get a weak laugh and some half-hearted talk for 5min. Watching them work has been like watching someone stuck in a bad marriage. The encouragements that have come my way feel like the lies people tell themselves while losing religion.\n\nI've never caved to academic dishonesty, but I can't deny that the lack of professionalism has rubbed off on me. It's hard for anyone to generate sincerity and drive in a system this demoralizing. What happened?? How do I dig out?",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hi there! I'm glad you're here. Take your time to share whatever's on your mind - I'm all ears and ready to listen with care.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Hey, thanks for being here. I’m just feeling really lost with grad school and the whole environment—it’s nothing like I expected, and I’m struggling to keep my head above water.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shared a detailed and comprehensive story about their struggles in grad school, including their perceptions and feelings about the environment. However, this exchange only consists of one turn. To ensure a complete understanding and establish rapport, further exploration is needed before moving to the next phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "That sounds really tough. It's understandable that you're feeling overwhelmed, especially when things aren't what you expected. Can you tell me more about what's been the hardest part so far?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "client: Yeah, it’s just this constant sense of disappointment, you know? Like, I thought grad school would be challenging in a good way, but instead, it feels like I’m stuck in a mess of unprofessionalism and apathy that’s dragging me down.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has only had 2 turns, and while the client has shared their concerns about graduate school, more dialogue is needed to fully explore their thoughts and context. Empathy and rapport appear to be building, but mutually agreed goals have not been established yet.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It sounds like you’re feeling a real disconnect between what you imagined and what you’re actually experiencing. That sense of disappointment must be really frustrating and disheartening.",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "client: Yeah, exactly, it’s super frustrating. I just don’t know how to push through when it feels like the whole system is working against any kind of motivation or progress.",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has spanned three turns, and the client’s story about their struggles with grad school is well-articulated, revealing their concerns and feelings towards the environment. The therapist has shown empathy and understanding. However, more exploration is needed to understand the client’s thoughts and goals fully.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It's so disheartening when the system you're a part of doesn't seem to support your growth and progress. Can you tell me more about what you mean by unprofessionalism and apathy in your grad school environment?",
      "phase": "exploring"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "Yeah, it’s like there’s just no accountability or passion around me, and it’s really draining. I guess I’m seeing a lot of behaviors and attitudes that make it hard to stay focused or care as much as I used to. \n\nI don’t know, maybe I’m just being too hard on myself or expecting too much, but it’s tough to keep pushing when it feels like no one else is even trying. How do you even start to rebuild that drive when the environment is just... bleh? Like, I want to get back to that sense of purpose I had before, but I’m not sure where to look for it right now.",
      "phase": "exploring"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has reached 4 turns, meeting the goal of eliciting the essence of the client's story. The therapist demonstrated empathy, and the client shared thoughts and context, identifying unprofessionalism and apathy as core issues. Mutually agreed goals of finding drive and purpose emerged. It's productive to advance to the Guiding phase to focus on strengthening motivation for change.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "I hear you, and it's clear that the environment you're in is really affecting your motivation and sense of purpose. It's important to remember that you're not the problem here, and your feelings are valid. Have you thought about what would need to change for you to feel more supported and motivated in your grad school journey?",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Yeah, I’ve thought about it a bit, but I’m not really sure what could realistically change. Like, I wish there was more structure or accountability, or just some genuine encouragement from the people around me.\n\nHonestly, I feel kinda stuck trying to figure out what I can even control in this mess. Do you think it’s possible to find that motivation again without the whole environment shifting, or am I just fighting a losing battle here?",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has just entered the guiding phase with only one turn focusing on understanding the client's challenges and evoking change talk. There's no indication yet of a specific change goal or substantial reduction in ambivalence. It's too early to move to the choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "It's a really tough situation, and I can understand why you're feeling stuck. But it's important to remember that you're not powerless, and even small changes can make a difference. Let's focus on what you can control, like setting your own goals and finding ways to stay motivated and encouraged, even if the environment isn't ideal.",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Yeah, that makes sense, I guess focusing on what I can control could help. I’m just not sure where to start with setting those goals when everything feels so off around me.\n\nLike, I want to get back to feeling driven, but it’s hard to even picture what that looks like right now. Do you have any ideas on how I can start small and kinda rebuild that sense of purpose without getting dragged down by the vibes in my department?",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is still in its early stages with only 2 turns in the guiding phase, focusing on understanding the client's struggle and exploring feelings of frustration and loss of motivation in grad school. More time is needed to fully explore and strengthen motivation for change before moving to the choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "It sounds like you're open to exploring ways to regain your sense of purpose, and that's a positive step. Let's start by identifying one small goal that you can set for yourself, something that's achievable and aligns with your values. We can then brainstorm strategies to help you stay motivated and focused, even in a less-than-ideal environment.",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Cool, I’m down to try that. I guess maybe a small goal could be getting back to a routine with my research, like setting aside specific times each week to really focus without distractions, since that used to make me feel productive.\n\nI’m not sure if that’s enough to get me feeling purposeful again, though. How do you think I can keep myself on track with something like that when I’m surrounded by so much apathy?",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client expressed a desire to regain motivation and purpose, identified a small goal (re-establishing a research routine), and showed openness to exploring strategies to stay motivated. However, they are still unsure how to maintain this in a negative environment. Change Talk is present, but the confidence to succeed in this environment remains unclear, suggesting the need for further exploration and support before moving to the Choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "That's a great first step, and I think setting aside dedicated time for research is a smart way to start rebuilding your sense of purpose. To help you stay on track, you could try creating a schedule and tracking your progress, which can provide a sense of accomplishment and motivation. Additionally, finding ways to connect with others outside of your department who share your passion for research might help counterbalance the apathy you're experiencing. What do you think?",
      "phase": "guiding"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "Yeah, I like the idea of tracking progress—maybe even just jotting down what I get done each day could give me a little boost. And connecting with people outside my department sounds good too, though I’m not sure where to start with that since most of my network is tied up in this mess.\n\nI guess I could look for some online forums or local meetups for researchers in my field. Do you think that’s a decent way to find people who might actually care about the same stuff I do, or should I be looking somewhere else?",
      "phase": "guiding"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed Change Talk by acknowledging a specific change goal of setting a research routine, exploring motivational strategies, and considering connecting with others outside their department. The confidence seems to have increased, and there's a decrease in sustain talk. With 4 turns in the current phase, the necessary conditions to move forward are met.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "Online forums and local meetups could be great places to start. You might also consider reaching out to old colleagues or classmates who share your passion for research. Even a small conversation with someone who understands your drive could help counterbalance the apathy around you.",
      "phase": "choosing"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "Cool, I think reaching out to some old classmates could work—I’ve got a few in mind who were always pretty motivated, and it’d be nice to catch up anyway. I’ll also poke around for some online groups or events in my field to see what’s out there.\n\nI’m just a bit worried that even if I find these connections, I might still feel stuck if the environment in my department doesn’t change. How do I keep pushing forward with my own goals without letting the negativity around me pull me back down?",
      "phase": "choosing"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client and therapist have collaboratively developed a clear goal and action plan, including setting a research routine and connecting with motivated peers. Barriers such as environmental negativity were discussed, with self-monitoring strategies like tracking progress implemented. The client shows commitment and readiness to take steps by reaching out to old classmates and exploring forums, signaling readiness to move to the next phase.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "Client, I'm glad to hear you're open to exploring these options and setting a small goal for yourself. Remember that rebuilding your sense of purpose is a process, and it's important to focus on what you can control, like your own routine and support network. While it's understandable to worry about the environment in your department, try to focus on the progress you're making and the positive connections you're creating. You might also consider finding small ways to take care of yourself and practice self-compassion, like taking short breaks or engaging in activities that bring you joy. As you work towards your goal and connect with others who share your passion, you might find that your motivation and sense of purpose start to return.",
      "phase": "terminating"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "Hey, I appreciate the reminder to focus on what I can control and to take care of myself—it’s easy to forget that sometimes. I’ll try to keep my eyes on my own progress and sprinkle in some little things that make me happy.\n\nI guess I’m just curious, do you think it’s worth bringing up some of these frustrations with my advisor or someone in the department, or should I just keep focusing on my own stuff for now?",
      "phase": "terminating"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"Termination goals have not been fully met, as the client is still seeking advice on addressing frustrations with their department. No next-step plan is clearly established.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "terminating"
    },
    {
      "index": 20,
      "role": "therapist",
      "statement": "Closing the session:\nGreat job today, client! You've made some excellent progress by identifying small steps to regain motivation and purpose. Remember that rebuilding your sense of direction takes time, so be patient and kind to yourself. Focus on what you can control, such as your research routine, support network, and self-care. As you make progress and connect with like-minded individuals, you might find that your motivation and sense of purpose return.\nAs for discussing your frustrations with your advisor or the department, consider taking some time to think about it. While it's important to express your concerns, it's also crucial to prioritize your well-being. If you decide to address these issues, try to approach the conversation calmly and constructively, focusing on potential solutions rather than just venting your frustrations. If you choose not to bring it up, that's okay too—your primary focus should be on your own growth and progress.\nIn our next session, we can continue to explore ways to maintain your momentum and discuss any challenges or successes you've experienced. Keep up the great work, and remember that you have the power to create positive change in your life.",
      "phase": "terminating"
    },
    {
      "index": 21,
      "role": "client",
      "statement": "Thanks for the advice on approaching that conversation—I’ll take some time to think it over and figure out what feels right for me. I’m looking forward to chatting more about how things are going in our next session.",
      "phase": "terminating"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The session successfully reviewed goals, strategies, and next steps for the client. The client is prepared to take actionable steps and appeared satisfied with the session's conclusion. It's natural to conclude here.\",\n\"determination\": \"stop\"\n}\n```",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hi there! I'm glad you're here. Take your time to share whatever's on your mind - I'm all ears and ready to listen with care.\nclient: Hey, thanks for being here. I’m just feeling really lost with grad school and the whole environment—it’s nothing like I expected, and I’m struggling to keep my head above water.\ntherapist: That sounds really tough. It's understandable that you're feeling overwhelmed, especially when things aren't what you expected. Can you tell me more about what's been the hardest part so far?\nclient: client: Yeah, it’s just this constant sense of disappointment, you know? Like, I thought grad school would be challenging in a good way, but instead, it feels like I’m stuck in a mess of unprofessionalism and apathy that’s dragging me down.\ntherapist: It sounds like you’re feeling a real disconnect between what you imagined and what you’re actually experiencing. That sense of disappointment must be really frustrating and disheartening.\nclient: client: Yeah, exactly, it’s super frustrating. I just don’t know how to push through when it feels like the whole system is working against any kind of motivation or progress.\ntherapist: It's so disheartening when the system you're a part of doesn't seem to support your growth and progress. Can you tell me more about what you mean by unprofessionalism and apathy in your grad school environment?\nclient: Yeah, it’s like there’s just no accountability or passion around me, and it’s really draining. I guess I’m seeing a lot of behaviors and attitudes that make it hard to stay focused or care as much as I used to. \n\nI don’t know, maybe I’m just being too hard on myself or expecting too much, but it’s tough to keep pushing when it feels like no one else is even trying. How do you even start to rebuild that drive when the environment is just... bleh? Like, I want to get back to that sense of purpose I had before, but I’m not sure where to look for it right now.\ntherapist: I hear you, and it's clear that the environment you're in is really affecting your motivation and sense of purpose. It's important to remember that you're not the problem here, and your feelings are valid. Have you thought about what would need to change for you to feel more supported and motivated in your grad school journey?\nclient: Yeah, I’ve thought about it a bit, but I’m not really sure what could realistically change. Like, I wish there was more structure or accountability, or just some genuine encouragement from the people around me.\n\nHonestly, I feel kinda stuck trying to figure out what I can even control in this mess. Do you think it’s possible to find that motivation again without the whole environment shifting, or am I just fighting a losing battle here?\ntherapist: It's a really tough situation, and I can understand why you're feeling stuck. But it's important to remember that you're not powerless, and even small changes can make a difference. Let's focus on what you can control, like setting your own goals and finding ways to stay motivated and encouraged, even if the environment isn't ideal.\nclient: Yeah, that makes sense, I guess focusing on what I can control could help. I’m just not sure where to start with setting those goals when everything feels so off around me.\n\nLike, I want to get back to feeling driven, but it’s hard to even picture what that looks like right now. Do you have any ideas on how I can start small and kinda rebuild that sense of purpose without getting dragged down by the vibes in my department?\ntherapist: It sounds like you're open to exploring ways to regain your sense of purpose, and that's a positive step. Let's start by identifying one small goal that you can set for yourself, something that's achievable and aligns with your values. We can then brainstorm strategies to help you stay motivated and focused, even in a less-than-ideal environment.\nclient: Cool, I’m down to try that. I guess maybe a small goal could be getting back to a routine with my research, like setting aside specific times each week to really focus without distractions, since that used to make me feel productive.\n\nI’m not sure if that’s enough to get me feeling purposeful again, though. How do you think I can keep myself on track with something like that when I’m surrounded by so much apathy?\ntherapist: That's a great first step, and I think setting aside dedicated time for research is a smart way to start rebuilding your sense of purpose. To help you stay on track, you could try creating a schedule and tracking your progress, which can provide a sense of accomplishment and motivation. Additionally, finding ways to connect with others outside of your department who share your passion for research might help counterbalance the apathy you're experiencing. What do you think?\nclient: Yeah, I like the idea of tracking progress—maybe even just jotting down what I get done each day could give me a little boost. And connecting with people outside my department sounds good too, though I’m not sure where to start with that since most of my network is tied up in this mess.\n\nI guess I could look for some online forums or local meetups for researchers in my field. Do you think that’s a decent way to find people who might actually care about the same stuff I do, or should I be looking somewhere else?\ntherapist: Online forums and local meetups could be great places to start. You might also consider reaching out to old colleagues or classmates who share your passion for research. Even a small conversation with someone who understands your drive could help counterbalance the apathy around you.\nclient: Cool, I think reaching out to some old classmates could work—I’ve got a few in mind who were always pretty motivated, and it’d be nice to catch up anyway. I’ll also poke around for some online groups or events in my field to see what’s out there.\n\nI’m just a bit worried that even if I find these connections, I might still feel stuck if the environment in my department doesn’t change. How do I keep pushing forward with my own goals without letting the negativity around me pull me back down?\ntherapist: Client, I'm glad to hear you're open to exploring these options and setting a small goal for yourself. Remember that rebuilding your sense of purpose is a process, and it's important to focus on what you can control, like your own routine and support network. While it's understandable to worry about the environment in your department, try to focus on the progress you're making and the positive connections you're creating. You might also consider finding small ways to take care of yourself and practice self-compassion, like taking short breaks or engaging in activities that bring you joy. As you work towards your goal and connect with others who share your passion, you might find that your motivation and sense of purpose start to return.\nclient: Hey, I appreciate the reminder to focus on what I can control and to take care of myself—it’s easy to forget that sometimes. I’ll try to keep my eyes on my own progress and sprinkle in some little things that make me happy.\n\nI guess I’m just curious, do you think it’s worth bringing up some of these frustrations with my advisor or someone in the department, or should I just keep focusing on my own stuff for now?\ntherapist: Closing the session:\nGreat job today, client! You've made some excellent progress by identifying small steps to regain motivation and purpose. Remember that rebuilding your sense of direction takes time, so be patient and kind to yourself. Focus on what you can control, such as your research routine, support network, and self-care. As you make progress and connect with like-minded individuals, you might find that your motivation and sense of purpose return.\nAs for discussing your frustrations with your advisor or the department, consider taking some time to think about it. While it's important to express your concerns, it's also crucial to prioritize your well-being. If you decide to address these issues, try to approach the conversation calmly and constructively, focusing on potential solutions rather than just venting your frustrations. If you choose not to bring it up, that's okay too—your primary focus should be on your own growth and progress.\nIn our next session, we can continue to explore ways to maintain your momentum and discuss any challenges or successes you've experienced. Keep up the great work, and remember that you have the power to create positive change in your life.\nclient: Thanks for the advice on approaching that conversation—I’ll take some time to think it over and figure out what feels right for me. I’m looking forward to chatting more about how things are going in our next session.",
  "completed": true
}