{
  "id": "wwd3sq",
  "timestamp": 1661299200000,
  "category": "emotional",
  "concern": "I’m 25, and will be graduating this year (my last term this fall). I will be 26 by then.\n\nI dropped out of uni. Immigrated as a student when I was 20. Worked a few part time jobs and took a few summer off to work and did a few internships, just to get myself through college.\n\nI feel beyond shit for being way too behind everyone I know. People in my uni are mostly around 18-21 and I just feel embarrassed sometime. I mean, I know “it’s not a race” but I get severe axiety sometime just to think about it.\n\nAnyone graduated in their mid-late 20s, how did you get over overthinking and how is life going?",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hi there! I'm glad you're here. I'm here to listen, and I'd love to hear what's been on your mind lately. What would you like to share with me today?",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Hey, thanks for being here. I’ve just been feeling really overwhelmed lately with graduating soon and being older than most of my peers, and it’s messing with my head a lot.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is still in the initial phase with only one turn, and the client has shared their background and concerns. We need more exchanges to explore the client's thoughts, feelings, and context more thoroughly, and to establish rapport and mutual understanding.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "That sounds incredibly challenging, and it's understandable that you're feeling overwhelmed. I'm here for you, and I'm ready to listen whenever you're ready to share more.",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "Thanks, I appreciate that. I just keep thinking about how I’m hitting 26 soon and still finishing up school while everyone else seems way ahead, and it’s hard not to feel like I’ve messed up somehow.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation consists of only 2 turns, which is less than the required 3-4 turns. The therapist has begun to explore the client's feelings about being older than peers, but more rapport building and exploration of context are needed.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It's clear that these thoughts have been weighing heavily on you, and it's understandable that you'd feel frustrated and concerned about your situation. It's also important to remember that everyone has their own unique path in life, and there's no one-size-fits-all timeline for success.",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "Yeah, I get that everyone’s on their own path, but it’s tough not to compare myself when I see others moving on so much faster. I just feel stuck sometimes, you know?",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation consists of 3 turns, during which the client has shared the essence of their story, feelings, and relevant context, with empathy and rapport being established. However, mutually agreed goals have not appeared yet. Further exploration is needed to understand more about the client's feelings and thoughts before moving to the Guiding phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "I hear you, and it's natural to feel that way when you're surrounded by others who seem to be moving forward at a different pace. I'm curious, what would it mean for you to feel less stuck and more on track with your own path?",
      "phase": "exploring"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "Honestly, I think feeling less stuck would mean not constantly worrying about where I’m supposed to be at this age. Like, if I could just focus on my own goals without the anxiety of being behind, that’d be a huge weight off my shoulders.",
      "phase": "exploring"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The therapist has effectively elicited the essence of the client's story, including the client's thoughts and relevant context. Empathy and rapport are evident, with mutually agreed goals starting to appear. With four conversation turns, the foundation for moving to the Guiding phase is established.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It sounds like that would bring you a sense of relief and clarity. I wonder, what would your life look like if you could focus on your goals without that anxiety holding you back?",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "I think it’d be like actually enjoying what I’m doing, you know, like being proud of finishing school and starting my career without this nagging feeling of being late to the game. I’d probably feel more confident, maybe even excited about what’s next instead of just stressing over the past.",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is still in the early stages of the guiding phase with only one turn completed. The client has begun to explore their feelings and express desires for change, indicating potential for further exploration of motivations and confidence.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "That sounds like a really empowering vision, and it's great that you can see the positive impact it would have on your life. How would it feel to take the first step towards letting go of that anxiety and focusing on your own journey?",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Honestly, it’d feel pretty freeing, like I’m finally giving myself permission to just be where I am without all the guilt. I guess I’m just not sure how to even start letting go of that constant worry, you know?",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed Change Talk by envisioning a less anxious future and identified the desire to focus on personal goals. However, no specific change goal or next step has been set, and there’s still notable ambivalence. The conversation is early in the Guiding phase with less than 3 turns, suggesting continued exploration of motivation and change talk is needed.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "I'm so glad you're open to the idea of letting go of that anxiety, and I hear the desire for freedom in your words. What if we explored a small, manageable step that could help you begin to shift your focus away from the worry and toward your own journey?",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Yeah, I’m definitely up for trying something small to shift my focus, ‘cause this worry just eats at me all the time. Like, what kind of step are we talking about here?",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a change talk by expressing a desire to feel less stuck and focus on personal goals without anxiety. A specific next step is being explored, and the client is open to taking action. With key readiness signals present, it's appropriate to advance.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "Based on what you've shared, one possibility could be setting aside a short time each day to focus solely on your goals, maybe even jotting down one thing you're proud of accomplishing or excited about. Another option might be challenging those anxious thoughts by asking yourself if they're based in reality or if they're just stories you've been telling yourself. Which of these resonates more with you, or do you have another idea in mind?",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "I think the idea of jotting down something I’m proud of each day sounds kinda doable, like it might help me focus on the good stuff instead of the spiral. Which one do you think would stick better for someone like me who overthinks everything?",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has identified a clear action plan to manage anxiety by jotting down accomplishments. They have shown tentative commitment to this plan. However, there is only one turn in the Choosing phase, and more discussion may be needed to strengthen their commitment and address potential barriers.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "It sounds like the daily reflection practice could be a great starting point for you, especially since it feels doable and might help shift your focus away from overthinking. How would you feel about trying this approach for a few days, and we could check in on how it's working for you?",
      "phase": "choosing"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "I’m definitely willing to give it a shot for a few days, see if it helps me get out of my head a bit. Can we maybe talk about how to handle it if I start overthinking while I’m trying to write stuff down?",
      "phase": "choosing"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has committed to trying a daily reflection practice and expressed willingness to address overthinking. However, since action plans are still forming and potential barriers like overthinking need further discussion, the conversation is not yet ready to transition to the Terminating phase. There have been less than 3 turns in the Choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "It’s great that you’re thinking ahead about potential challenges, and I’m glad we can explore this together. When you notice yourself slipping into overthinking while writing, one strategy could be to pause, take a few deep breaths, and gently remind yourself that this practice is about small, positive steps—not perfection. We could also consider setting a timer for just 5 minutes to help keep the task grounded and manageable, so the act of writing itself doesn’t become another source of stress. How does that sound to you?",
      "phase": "choosing"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "That sounds pretty helpful, actually, like setting a timer could keep me from going down a rabbit hole while I’m writing. I’m just worried I might still get stuck on negative stuff—do you have any other tricks to kinda snap me out of that if it happens?",
      "phase": "choosing"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has a clear action plan, including daily reflections and managing overthinking with strategies like setting a timer, which demonstrates commitment and readiness to change. They have discussed potential barriers and accepted solutions, showing confidence and engagement in the process.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 20,
      "role": "therapist",
      "statement": "Based on our conversation, here are your key goals, action steps, and coping strategies:\n**Goals:** Focus on your own achievements, reduce anxiety about being behind, and let go of comparison.\n**Action Steps:** Practice daily reflections on your accomplishments, set a 5-minute timer to stay grounded, and gently remind yourself to focus on small, positive steps.\n**Coping Strategies:** Pause and take a few deep breaths when overthinking occurs, and consider using physical grounding techniques like touching an object nearby to redirect your focus.\nRemember, it's normal to encounter challenges, but with these strategies, you'll be better equipped to manage overthinking and stay focused on your progress. I'm here to support you every step of the way. Let's schedule a follow-up session to check in on your progress and continue refining your approach. You've got this!",
      "phase": "terminating"
    },
    {
      "index": 21,
      "role": "client",
      "statement": "Thanks for laying it all out like that—it helps to see everything clearly. I’m feeling a bit more hopeful about trying these strategies, and I’d definitely like to schedule that follow-up to keep things on track.",
      "phase": "terminating"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The session included a summary of goals, steps, and coping strategies. A next-step plan and follow-up were discussed, providing closure. Client expressed feeling hopeful and committed to the plan, suggesting readiness to end this session.\",\n\"determination\": \"stop\"\n}\n```",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hi there! I'm glad you're here. I'm here to listen, and I'd love to hear what's been on your mind lately. What would you like to share with me today?\nclient: Hey, thanks for being here. I’ve just been feeling really overwhelmed lately with graduating soon and being older than most of my peers, and it’s messing with my head a lot.\ntherapist: That sounds incredibly challenging, and it's understandable that you're feeling overwhelmed. I'm here for you, and I'm ready to listen whenever you're ready to share more.\nclient: Thanks, I appreciate that. I just keep thinking about how I’m hitting 26 soon and still finishing up school while everyone else seems way ahead, and it’s hard not to feel like I’ve messed up somehow.\ntherapist: It's clear that these thoughts have been weighing heavily on you, and it's understandable that you'd feel frustrated and concerned about your situation. It's also important to remember that everyone has their own unique path in life, and there's no one-size-fits-all timeline for success.\nclient: Yeah, I get that everyone’s on their own path, but it’s tough not to compare myself when I see others moving on so much faster. I just feel stuck sometimes, you know?\ntherapist: I hear you, and it's natural to feel that way when you're surrounded by others who seem to be moving forward at a different pace. I'm curious, what would it mean for you to feel less stuck and more on track with your own path?\nclient: Honestly, I think feeling less stuck would mean not constantly worrying about where I’m supposed to be at this age. Like, if I could just focus on my own goals without the anxiety of being behind, that’d be a huge weight off my shoulders.\ntherapist: It sounds like that would bring you a sense of relief and clarity. I wonder, what would your life look like if you could focus on your goals without that anxiety holding you back?\nclient: I think it’d be like actually enjoying what I’m doing, you know, like being proud of finishing school and starting my career without this nagging feeling of being late to the game. I’d probably feel more confident, maybe even excited about what’s next instead of just stressing over the past.\ntherapist: That sounds like a really empowering vision, and it's great that you can see the positive impact it would have on your life. How would it feel to take the first step towards letting go of that anxiety and focusing on your own journey?\nclient: Honestly, it’d feel pretty freeing, like I’m finally giving myself permission to just be where I am without all the guilt. I guess I’m just not sure how to even start letting go of that constant worry, you know?\ntherapist: I'm so glad you're open to the idea of letting go of that anxiety, and I hear the desire for freedom in your words. What if we explored a small, manageable step that could help you begin to shift your focus away from the worry and toward your own journey?\nclient: Yeah, I’m definitely up for trying something small to shift my focus, ‘cause this worry just eats at me all the time. Like, what kind of step are we talking about here?\ntherapist: Based on what you've shared, one possibility could be setting aside a short time each day to focus solely on your goals, maybe even jotting down one thing you're proud of accomplishing or excited about. Another option might be challenging those anxious thoughts by asking yourself if they're based in reality or if they're just stories you've been telling yourself. Which of these resonates more with you, or do you have another idea in mind?\nclient: I think the idea of jotting down something I’m proud of each day sounds kinda doable, like it might help me focus on the good stuff instead of the spiral. Which one do you think would stick better for someone like me who overthinks everything?\ntherapist: It sounds like the daily reflection practice could be a great starting point for you, especially since it feels doable and might help shift your focus away from overthinking. How would you feel about trying this approach for a few days, and we could check in on how it's working for you?\nclient: I’m definitely willing to give it a shot for a few days, see if it helps me get out of my head a bit. Can we maybe talk about how to handle it if I start overthinking while I’m trying to write stuff down?\ntherapist: It’s great that you’re thinking ahead about potential challenges, and I’m glad we can explore this together. When you notice yourself slipping into overthinking while writing, one strategy could be to pause, take a few deep breaths, and gently remind yourself that this practice is about small, positive steps—not perfection. We could also consider setting a timer for just 5 minutes to help keep the task grounded and manageable, so the act of writing itself doesn’t become another source of stress. How does that sound to you?\nclient: That sounds pretty helpful, actually, like setting a timer could keep me from going down a rabbit hole while I’m writing. I’m just worried I might still get stuck on negative stuff—do you have any other tricks to kinda snap me out of that if it happens?\ntherapist: Based on our conversation, here are your key goals, action steps, and coping strategies:\n**Goals:** Focus on your own achievements, reduce anxiety about being behind, and let go of comparison.\n**Action Steps:** Practice daily reflections on your accomplishments, set a 5-minute timer to stay grounded, and gently remind yourself to focus on small, positive steps.\n**Coping Strategies:** Pause and take a few deep breaths when overthinking occurs, and consider using physical grounding techniques like touching an object nearby to redirect your focus.\nRemember, it's normal to encounter challenges, but with these strategies, you'll be better equipped to manage overthinking and stay focused on your progress. I'm here to support you every step of the way. Let's schedule a follow-up session to check in on your progress and continue refining your approach. You've got this!\nclient: Thanks for laying it all out like that—it helps to see everything clearly. I’m feeling a bit more hopeful about trying these strategies, and I’d definitely like to schedule that follow-up to keep things on track.",
  "completed": true
}