{
  "id": "y9d0sj",
  "timestamp": 1666224000000,
  "category": "emotional",
  "concern": "So basically I got caught in a room with a bunch of alcohol and we were all underage. (18) It wasn't even my room either it was some dumbasses room and these dudes started fighting in there. Long story short the RA's were called and I was caught, and put on probation. Now if I get caught again I'll probably be kicked out of here or worse. \n\nNone of my other friends have probation like me so they're just living their lives care free, while I'm paranoid to even go to another person's place. I don't know I feel like none of this was even deserved on my part, and even tonight I was invited to do drinking games with some other friends. Should I even go? I'm so nervous and upset. Probation lasts a whole year man... GOD",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hello! Welcome to our session today. I'm here to listen and support you. Is there anything specific that's been on your mind lately that you'd like to talk about?",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Hey, thanks for being here. I’ve just been really stressed out about this whole situation with probation and feeling like I’m walking on eggshells all the time.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is still in the initial stage of the Exploring phase, with only one turn completed. The client has shared their primary concern, but further exploration is needed to fully understand their thoughts, feelings, and context. Empathy and rapport-building are in progress, and more dialogue is required to meet the goals of this phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "That sounds incredibly overwhelming. Can you tell me more about what's been contributing to that stress and how it's been affecting your daily life?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "Yeah, it’s just been really hard to relax or enjoy anything because I’m constantly worried about messing up again. It’s like I can’t even hang out with friends without overthinking every little thing.\n\nMan, I don’t even know how to deal with this. Like, I want to be part of stuff, you know, hang out and have fun, but I’m scared I’ll end up in the wrong place at the wrong time again. And with my friends not having to worry about any of this, it just makes me feel so left out and kinda bitter. What am I supposed to do? I can’t just sit in my room for a whole year, but I also don’t wanna risk everything.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has only gone through 2 turns. While the client shared their situation and emotional context, the therapist needs further exploration to fully understand the client's story and build rapport. More conversation is needed to develop mutually agreed goals.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It sounds like you're feeling really torn between wanting to live your life and being afraid of making a mistake. That must be so frustrating, and it makes sense that you're feeling left out and bitter when your friends don't have the same worries. Have you been able to talk to them about how you're feeling, or does it feel too hard to explain?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "Yeah, I haven’t really brought it up with them because I don’t want to seem like I’m whining or bringing the vibe down. It’s just awkward, you know, trying to explain why I’m so on edge when they’re all just chilling and having fun. I’m worried they might not get it or might even think I’m overreacting. Like, I don’t even know if I should tell them I’m on probation or just keep making excuses to avoid stuff. What do you think—should I open up to them, or just keep this to myself for now?",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shared their primary concerns and context, revealing a sense of stress and isolation due to probation. Empathy and rapport have been established, with goals around understanding social dynamics and decision-making. Three conversation turns have been completed, which is sufficient to capture the essence of the client's story and move to the Guiding phase.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It's completely understandable that you're hesitant to open up to your friends, especially when you're worried about their reactions. It might be helpful to think about what you'd hope to gain from sharing this with them, and what your ideal outcome would be if they did understand. Maybe there's a way to start small, like sharing how you're feeling without going into all the details right away, to see how they respond.",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "Yeah, that makes sense, I guess. Like, maybe just telling one or two close friends that I’m dealing with some stuff and need to be careful without spilling everything. I just don’t know if I’m ready for them to look at me differently, you know? It’s already hard enough feeling like I’m on the outside looking in. Do you think starting with something small like that could actually help, or am I just gonna end up feeling more weird about it?",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is still in the early stages of the Guiding phase, as it has only one turn. The client is expressing ambivalence and exploring feelings and options but hasn't yet shown readiness signals such as decreased ambivalence or specific change talk. More exploration is needed.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "Taking that small step could help you gauge their reactions without putting everything on the table right away. It might feel uncomfortable at first, but it could also open up a space for them to show you they care, even if they don't fully understand. What would that look like for you, if just one person responded with support instead of judgment?",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Man, I think if just one of them was cool about it, like if they just listened and didn’t make a big deal outta it, that’d be huge. I’d probably feel a little less alone in all this, you know, like I’ve got someone in my corner. I guess I’m just scared it’ll go the other way, and they’ll start treating me like I’m some kinda liability or something. How do I even bring it up without making it this big, heavy thing? I don’t wanna sound like I’m asking for pity or anything.",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has voiced ambivalence, feeling torn between avoiding risky situations and wanting to participate with friends. They've considered a small step forward by talking to a close friend, showing emerging Change Talk. However, specific change plans or a clear confidence level have not been established yet, and the guiding phase has only 2 turns. Further exploration is needed to strengthen motivation and clarify action steps.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "One approach could be to start by mentioning that you've been dealing with some stuff and it's been weighing on your mind, without diving into specifics right away. You might say something like, \"\"I've been going through some things that make it hard for me to fully enjoy myself right now, but I'm trying to work through it.\"\" This gives your friends a chance to respond with support and understanding, and if they do, you can gradually open up more. It's about finding a balance between sharing what you're comfortable with and not overloading them with details. Remember, you're not asking for pity, but rather expressing your current situation in a way that invites empathy and connection.",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Thanks for the suggestion, I like the idea of keeping it light at first. That phrasing kinda feels like something I could actually say without it being too much. I’m still nervous, though, like what if they push for more details and I’m not ready to get into it? I don’t wanna come off as secretive or weird, but I also don’t wanna spill everything just ‘cause they ask. How do I handle it if they start asking questions I’m not cool with answering yet?",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client is expressing significant ambivalence and fear about their current situation, and although there has been some exploration of potential strategies, there is no specific change goal or next step identified yet. The client remains uncertain about how to proceed, indicating a need for continued guidance to explore their values and build confidence.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "It's a valid concern, and you're not obligated to share more than you're comfortable with. You could respond by saying something like, \"\"I'm not quite ready to talk about the specifics just yet, but I appreciate your willingness to listen. I'll share more when I feel like it's the right time.\"\" This approach acknowledges their interest in supporting you while setting boundaries and maintaining control over the conversation. It's important to remember that you're not being secretive or weird by protecting your privacy and taking things at your own pace.",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Thanks for that, I feel like having a line ready to go makes it less scary to think about. I’m gonna try that if it comes up, just to keep things chill while still being honest.\n\nMan, I just keep thinking about how much this whole probation thing is messing with my head. Like, I wanna be normal and hang out, but every time I even think about going somewhere, I get this knot in my stomach, worrying I’ll get caught up in something again. It’s like I can’t even trust myself to make a good call anymore. How do I start feeling okay with just living my life without this constant fear hanging over me?",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed change talk by contemplating opening up to friends and considering ways to manage stress and fear. One specific change goal is identified: cautiously sharing their situation with friends. Confidence is implied as they are preparing lines for conversation. With met goals and readiness signals, transitioning to planning is timely.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "It sounds like you're really struggling with the weight of probation and how it's affecting your ability to enjoy life without fear. That knot in your stomach is a sign that you're still processing the experience, and it's understandable to feel uncertain about trusting yourself. One way to start building confidence in your decision-making might be to focus on small, low-risk situations where you can practice trusting your instincts. For example, if you're thinking about going somewhere, try to identify specific factors that might contribute to your anxiety, and then weigh them against your own judgment. By gradually exposing yourself to these situations and reflecting on the outcomes, you may start to feel more confident in your ability to make good choices.",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "Thanks for breaking it down like that, I can see how starting small might help me get some of that confidence back. It just feels so overwhelming right now, you know, like even the small stuff seems risky when I’ve got this probation hanging over me.\n\nI guess I’m just stuck on how to even pick what’s “low-risk” when everything feels like it could blow up in my face. Like, going to a friend’s place to just chill sounds fine, but what if someone pulls out drinks or something and I’m back in the same mess? I don’t wanna be that guy who’s always saying no and bailing, but I’m legit scared of screwing up again. How do I figure out what’s actually safe to do without overthinking every little thing?",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is in the initial stages of the Choosing phase. The client has started exploring potential actions and strategies, and there's clear hesitancy and need for further discussion on specific action plans and barriers. With only one turn in this phase, it is premature to consider moving to Termination.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "You're right, it can be tough to assess what's low-risk when everything feels uncertain, especially with the added pressure of probation. One way to approach this might be to focus on the things that you know you can control in a situation, and use those as a starting point. For instance, if you're invited to a friend's place, you could suggest doing something specific that you know aligns with your goals, like watching a movie or playing a game, and avoid situations where alcohol might be present. Over time, as you build confidence in your decision-making, you can gradually expand your comfort zone and explore new situations. Remember, it's okay to take things one step at a time and to prioritize your safety and well-being above all else.",
      "phase": "choosing"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "Thanks for the advice, I like the idea of suggesting something specific to do when I’m with friends. It kinda gives me a bit of control over the vibe without making it obvious I’m stressing.\n\nI just still feel so on edge, you know? Like, even if I plan something safe, my brain keeps jumping to worst-case scenarios, and I end up second-guessing everything. It’s exhausting to always be worrying about what *could* happen. Is there a way to just calm my mind down when I start spiraling like that?",
      "phase": "choosing"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client and therapist have addressed identifying low-risk situations and maintaining control over social settings to help the client participate safely. There's a concrete plan in suggesting specific activities to avoid risky scenarios. The client has expressed nervousness but shows willingness to apply the plan. Since this is the second turn in the Choosing phase, it's appropriate to continue to ensure further discussion of self-monitoring and readiness signals.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "You're doing a great job of recognizing the patterns in your thoughts and acknowledging how they affect you. One strategy that might help when your mind starts spiraling is to practice grounding techniques, like focusing on your breath or the physical sensations in your body. For example, you could try the 5-4-3-2-1 method: name 5 things you can see, 4 things you can touch, 3 things you can hear, 2 things you can smell, and 1 thing you can taste. This can help bring you back to the present moment and disrupt the cycle of worst-case scenarios. Additionally, reminding yourself that it's okay to feel uncertain and that you're doing the best you can might also help ease some of the pressure.",
      "phase": "choosing"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "Thanks for the suggestion, that grounding thing sounds like something I could actually try when I’m freaking out. I just wanna get to a point where I’m not constantly overthinking every move, you know?\n\nMan, it’s just rough because I feel like I’m missing out on so much with my friends while I’m stuck in this headspace. Like, I see them posting stuff online, having fun, and I’m just sitting here worrying about screwing up. I don’t wanna be left out, but I also don’t wanna risk everything. How do I balance wanting to be part of things with keeping myself safe?",
      "phase": "choosing"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has identified specific strategies to manage social situations and anxiety, and is ready to apply them. They've shown readiness by accepting and planning to use suggested techniques. They also expressed a strong commitment to avoid risky situations, indicating readiness for change.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 20,
      "role": "therapist",
      "statement": "Alright, let's wrap up today's session by summarizing what we've discussed and outlining some action steps you can take moving forward. First, we identified that your probation situation is causing you significant stress, leading to anxiety and making it difficult for you to enjoy social activities. You expressed a desire to connect with friends but feel hesitant due to fears of judgment and making mistakes.\nTo help you regain confidence in your decision-making, we discussed focusing on small, low-risk situations where you can practice trusting your instincts. For example, you could identify specific factors contributing to your anxiety in social situations and weigh them against your own judgment. By gradually exposing yourself to these situations and reflecting on the outcomes, you may start to feel more confident in your ability to make good choices.\nWe also talked about strategies for managing your anxiety, such as using grounding techniques like the 5-4-3-2-1 method to bring yourself back to the present moment and disrupt the cycle of worst-case scenarios. Additionally, reminding yourself that it's okay to feel uncertain and that you're doing the best you can may help ease some of the pressure.\nTo balance wanting to be part of social activities with keeping yourself safe, consider focusing on the things you know you can control in a situation. For instance",
      "phase": "terminating"
    },
    {
      "index": 21,
      "role": "client",
      "statement": "Thanks for summing everything up and giving me these steps to work on. I’ll try focusing on what I can control and using that grounding trick when my mind starts racing.\n\nIt’s been really helpful talking this out today. I guess I’m just hoping I can start feeling a bit more normal soon, you know? Do you think we could keep digging into ways to handle that balance between joining in with friends and staying safe next time?",
      "phase": "terminating"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The session ended with a summary of goals and coping strategies, and the client has a plan for next steps. The client acknowledged the session's helpfulness and expressed readiness to continue exploring their concerns in future sessions.\",\n\"determination\": \"stop\"\n}\n```",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hello! Welcome to our session today. I'm here to listen and support you. Is there anything specific that's been on your mind lately that you'd like to talk about?\nclient: Hey, thanks for being here. I’ve just been really stressed out about this whole situation with probation and feeling like I’m walking on eggshells all the time.\ntherapist: That sounds incredibly overwhelming. Can you tell me more about what's been contributing to that stress and how it's been affecting your daily life?\nclient: Yeah, it’s just been really hard to relax or enjoy anything because I’m constantly worried about messing up again. It’s like I can’t even hang out with friends without overthinking every little thing.\n\nMan, I don’t even know how to deal with this. Like, I want to be part of stuff, you know, hang out and have fun, but I’m scared I’ll end up in the wrong place at the wrong time again. And with my friends not having to worry about any of this, it just makes me feel so left out and kinda bitter. What am I supposed to do? I can’t just sit in my room for a whole year, but I also don’t wanna risk everything.\ntherapist: It sounds like you're feeling really torn between wanting to live your life and being afraid of making a mistake. That must be so frustrating, and it makes sense that you're feeling left out and bitter when your friends don't have the same worries. Have you been able to talk to them about how you're feeling, or does it feel too hard to explain?\nclient: Yeah, I haven’t really brought it up with them because I don’t want to seem like I’m whining or bringing the vibe down. It’s just awkward, you know, trying to explain why I’m so on edge when they’re all just chilling and having fun. I’m worried they might not get it or might even think I’m overreacting. Like, I don’t even know if I should tell them I’m on probation or just keep making excuses to avoid stuff. What do you think—should I open up to them, or just keep this to myself for now?\ntherapist: It's completely understandable that you're hesitant to open up to your friends, especially when you're worried about their reactions. It might be helpful to think about what you'd hope to gain from sharing this with them, and what your ideal outcome would be if they did understand. Maybe there's a way to start small, like sharing how you're feeling without going into all the details right away, to see how they respond.\nclient: Yeah, that makes sense, I guess. Like, maybe just telling one or two close friends that I’m dealing with some stuff and need to be careful without spilling everything. I just don’t know if I’m ready for them to look at me differently, you know? It’s already hard enough feeling like I’m on the outside looking in. Do you think starting with something small like that could actually help, or am I just gonna end up feeling more weird about it?\ntherapist: Taking that small step could help you gauge their reactions without putting everything on the table right away. It might feel uncomfortable at first, but it could also open up a space for them to show you they care, even if they don't fully understand. What would that look like for you, if just one person responded with support instead of judgment?\nclient: Man, I think if just one of them was cool about it, like if they just listened and didn’t make a big deal outta it, that’d be huge. I’d probably feel a little less alone in all this, you know, like I’ve got someone in my corner. I guess I’m just scared it’ll go the other way, and they’ll start treating me like I’m some kinda liability or something. How do I even bring it up without making it this big, heavy thing? I don’t wanna sound like I’m asking for pity or anything.\ntherapist: One approach could be to start by mentioning that you've been dealing with some stuff and it's been weighing on your mind, without diving into specifics right away. You might say something like, \"\"I've been going through some things that make it hard for me to fully enjoy myself right now, but I'm trying to work through it.\"\" This gives your friends a chance to respond with support and understanding, and if they do, you can gradually open up more. It's about finding a balance between sharing what you're comfortable with and not overloading them with details. Remember, you're not asking for pity, but rather expressing your current situation in a way that invites empathy and connection.\nclient: Thanks for the suggestion, I like the idea of keeping it light at first. That phrasing kinda feels like something I could actually say without it being too much. I’m still nervous, though, like what if they push for more details and I’m not ready to get into it? I don’t wanna come off as secretive or weird, but I also don’t wanna spill everything just ‘cause they ask. How do I handle it if they start asking questions I’m not cool with answering yet?\ntherapist: It's a valid concern, and you're not obligated to share more than you're comfortable with. You could respond by saying something like, \"\"I'm not quite ready to talk about the specifics just yet, but I appreciate your willingness to listen. I'll share more when I feel like it's the right time.\"\" This approach acknowledges their interest in supporting you while setting boundaries and maintaining control over the conversation. It's important to remember that you're not being secretive or weird by protecting your privacy and taking things at your own pace.\nclient: Thanks for that, I feel like having a line ready to go makes it less scary to think about. I’m gonna try that if it comes up, just to keep things chill while still being honest.\n\nMan, I just keep thinking about how much this whole probation thing is messing with my head. Like, I wanna be normal and hang out, but every time I even think about going somewhere, I get this knot in my stomach, worrying I’ll get caught up in something again. It’s like I can’t even trust myself to make a good call anymore. How do I start feeling okay with just living my life without this constant fear hanging over me?\ntherapist: It sounds like you're really struggling with the weight of probation and how it's affecting your ability to enjoy life without fear. That knot in your stomach is a sign that you're still processing the experience, and it's understandable to feel uncertain about trusting yourself. One way to start building confidence in your decision-making might be to focus on small, low-risk situations where you can practice trusting your instincts. For example, if you're thinking about going somewhere, try to identify specific factors that might contribute to your anxiety, and then weigh them against your own judgment. By gradually exposing yourself to these situations and reflecting on the outcomes, you may start to feel more confident in your ability to make good choices.\nclient: Thanks for breaking it down like that, I can see how starting small might help me get some of that confidence back. It just feels so overwhelming right now, you know, like even the small stuff seems risky when I’ve got this probation hanging over me.\n\nI guess I’m just stuck on how to even pick what’s “low-risk” when everything feels like it could blow up in my face. Like, going to a friend’s place to just chill sounds fine, but what if someone pulls out drinks or something and I’m back in the same mess? I don’t wanna be that guy who’s always saying no and bailing, but I’m legit scared of screwing up again. How do I figure out what’s actually safe to do without overthinking every little thing?\ntherapist: You're right, it can be tough to assess what's low-risk when everything feels uncertain, especially with the added pressure of probation. One way to approach this might be to focus on the things that you know you can control in a situation, and use those as a starting point. For instance, if you're invited to a friend's place, you could suggest doing something specific that you know aligns with your goals, like watching a movie or playing a game, and avoid situations where alcohol might be present. Over time, as you build confidence in your decision-making, you can gradually expand your comfort zone and explore new situations. Remember, it's okay to take things one step at a time and to prioritize your safety and well-being above all else.\nclient: Thanks for the advice, I like the idea of suggesting something specific to do when I’m with friends. It kinda gives me a bit of control over the vibe without making it obvious I’m stressing.\n\nI just still feel so on edge, you know? Like, even if I plan something safe, my brain keeps jumping to worst-case scenarios, and I end up second-guessing everything. It’s exhausting to always be worrying about what *could* happen. Is there a way to just calm my mind down when I start spiraling like that?\ntherapist: You're doing a great job of recognizing the patterns in your thoughts and acknowledging how they affect you. One strategy that might help when your mind starts spiraling is to practice grounding techniques, like focusing on your breath or the physical sensations in your body. For example, you could try the 5-4-3-2-1 method: name 5 things you can see, 4 things you can touch, 3 things you can hear, 2 things you can smell, and 1 thing you can taste. This can help bring you back to the present moment and disrupt the cycle of worst-case scenarios. Additionally, reminding yourself that it's okay to feel uncertain and that you're doing the best you can might also help ease some of the pressure.\nclient: Thanks for the suggestion, that grounding thing sounds like something I could actually try when I’m freaking out. I just wanna get to a point where I’m not constantly overthinking every move, you know?\n\nMan, it’s just rough because I feel like I’m missing out on so much with my friends while I’m stuck in this headspace. Like, I see them posting stuff online, having fun, and I’m just sitting here worrying about screwing up. I don’t wanna be left out, but I also don’t wanna risk everything. How do I balance wanting to be part of things with keeping myself safe?\ntherapist: Alright, let's wrap up today's session by summarizing what we've discussed and outlining some action steps you can take moving forward. First, we identified that your probation situation is causing you significant stress, leading to anxiety and making it difficult for you to enjoy social activities. You expressed a desire to connect with friends but feel hesitant due to fears of judgment and making mistakes.\nTo help you regain confidence in your decision-making, we discussed focusing on small, low-risk situations where you can practice trusting your instincts. For example, you could identify specific factors contributing to your anxiety in social situations and weigh them against your own judgment. By gradually exposing yourself to these situations and reflecting on the outcomes, you may start to feel more confident in your ability to make good choices.\nWe also talked about strategies for managing your anxiety, such as using grounding techniques like the 5-4-3-2-1 method to bring yourself back to the present moment and disrupt the cycle of worst-case scenarios. Additionally, reminding yourself that it's okay to feel uncertain and that you're doing the best you can may help ease some of the pressure.\nTo balance wanting to be part of social activities with keeping yourself safe, consider focusing on the things you know you can control in a situation. For instance\nclient: Thanks for summing everything up and giving me these steps to work on. I’ll try focusing on what I can control and using that grounding trick when my mind starts racing.\n\nIt’s been really helpful talking this out today. I guess I’m just hoping I can start feeling a bit more normal soon, you know? Do you think we could keep digging into ways to handle that balance between joining in with friends and staying safe next time?",
  "completed": true
}