{
  "id": "10yqi80",
  "timestamp": 1675987200000,
  "category": "school_life",
  "concern": "TLDR: How feasible is it to switch from a humanities major like the undermentioned to a science major like biology/biochem, especially in the first 2 years of college?\n\nHere's a bit on my situation:\n\nI am a high school senior with many broad interests. My favorite classes at school have always been bio/chem and English, although I've loved every subject I've taken (excluding a bad experience with physics). While my peers were deciding what major/specialization to apply for, I was still trying to decide between STEM and the humanities. Ultimately, I chose to apply for business and social science programs (e.g. intl relations, economics, psychology).\n\nI did this because I felt the opportunity cost of choosing STEM was greater than choosing a humanities-based major, as creativity/eloquence are my strengths and public speaking is a passion of mine. However, I am constantly regretting not even trying for a STEM major like biology, especially because STEM subjects always came naturally to me. All I want at this point in my life is to find enjoyment in my career without, ya know, going broke.\n\nI have constantly heard that it is easier to switch from STEM to humanities than vice versa, but I'm really hoping to have the choice to try out or switch to biology at some point in my first half of college.\n\nI am looking at schools in the US and Canada. Thanks in advance for any help/advice!",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hi there! What's on your mind today? I'm here to listen and support you in any way I can.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "I'm feeling uncertain about my college major decision and whether it's the right fit for me. I'm exploring options to switch to a science field to better align with my interests.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has shared a detailed personal story about their uncertainty around choosing a college major, showing psychological safety and openness. The therapist has demonstrated empathy by inviting the client to share their thoughts. The client has expressed motivation for change by considering switching to a science major, linking it to personal interests and career enjoyment, indicating emerging Change Talk around Desire and Reason. However, no explicit agreement on session goals is evident yet, and the client has not asked for next steps. Resistance is low, but the conversation is still in the information-gathering phase without strong commitment or activation statements.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "It sounds like you're at a crossroads, and it's completely normal to feel uncertain about your college major. It's great that you're exploring your interests and considering a switch to a science field. Have you identified any specific science majors that interest you?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "Yes, I'm particularly interested in biology and biochemistry as potential majors. Exploring these options would help me better align my studies with my natural strengths in science subjects.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist elicited the client's story about uncertainty regarding their major and interest in switching to a science field, reflecting this back empathetically. The client shared specific interests (biology and biochemistry) and linked their change consideration to personal strengths and values. There is minimal resistance, and the client is exploring options. However, no explicit Change Talk indicating commitment or activation has yet emerged. The session effectively meets Exploring objectives but hasn't yet evoked strong Change Talk or an explicit request for next steps.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "That's fantastic! Biology and biochemistry are both fascinating fields with many exciting career opportunities. It's great that you're considering majors that play to your strengths in science. Have you had a chance to speak with an academic advisor or any professors in those departments to get a better understanding of what the programs entail?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "I haven't spoken with an academic advisor or professors in those departments yet. I'm eager to reach out to better understand if switching to biology could work for me.",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited the client's story regarding uncertainty about their major and reflected it back empathetically, affirming the client's feelings and strengths. The client has identified specific interests in biology and biochemistry and expressed eagerness to explore options by speaking with academic advisors, demonstrating psychological safety and engagement. While there is some change talk regarding exploring new majors ('eager to reach out'), the frequency and strength of explicit Change Talk about commitment or activation remain limited. No resistance is evident. Session goals appear to be mutually understood, but the client has not yet explicitly asked for next steps or linked change to personal values deeply. Therefore, the Exploring phase objectives are substantially met, but further guidance to evoke stronger Change Talk is warranted.\",\n  \"determination\": \"move\"\n}",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It's great that you're taking the initiative to explore your options and find a major that aligns with your strengths and interests. Reaching out to an academic advisor or professors in the biology and biochemistry departments can provide valuable insights and guidance as you make your decision. What steps do you plan to take next in gathering more information about these majors?",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "I plan to schedule a meeting with an academic advisor in the biology department soon to discuss program requirements and switching options. Afterward, I'll reach out to a professor for more insights into how these majors might align with my interests.",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has successfully guided the client to explore the discrepancy between current major choice and their interests and strengths in science. The client has articulated specific potential majors (biology, biochemistry) and expressed plans to take concrete next steps—scheduling meetings with advisors and professors—to gather information. This indicates activation and taking steps change talk. Ambivalence has decreased as the client expresses eagerness and clarity about exploring a switch. Although importance and confidence rulers were not explicitly used, the client's statements demonstrate readiness. The therapist's concise reflections and open questions have supported client motivation and planning.\",\n  \"determination\": \"move\"\n}",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It's great to have a clear plan in place. Speaking with an academic advisor will provide you with essential information on program requirements and the process of switching majors. Following up with a professor will give you a deeper understanding of how these majors align with your interests and career goals. Would you like to set a specific date by which you'll have completed these steps?",
      "phase": "choosing"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Yes, I'd like to set a specific date to help me stay accountable and move forward with exploring my options. How about aiming to complete these steps within the next two weeks?",
      "phase": "choosing"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has identified a clear, specific goal: exploring a switch to biology or biochemistry as a major. They have collaboratively developed a concrete action plan that includes scheduling a meeting with an academic advisor and reaching out to a professor, with a timeline of completing these steps within two weeks. Potential barriers, such as understanding program requirements and deciding feasibility, are implicitly acknowledged through planned information gathering. The client expressed commitment to these steps and agreed on a follow-up method by setting a date to ensure accountability. There is sustained commitment talk with minimal resistance, and the conversation is focused on next steps and follow-up.\",\n  \"determination\": \"move\"\n}",
      "phase": "choosing"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "That sounds like a reasonable timeframe to gather the information you need. Within the next two weeks, you'll have the opportunity to consult with an academic advisor and a professor, which will help you make an informed decision about your major. Remember to take your time and consider all the information you gather before making a final decision. I wish you the best of luck, and feel free to reach out if you need further assistance.",
      "phase": "terminating"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Thank you I'll follow through with these steps in the next two weeks to see if switching to biology aligns with my interests and career goals without compromising my future.",
      "phase": "terminating"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively summarized the client's goals and action steps, including contacting an academic advisor and a professor within two weeks. The client acknowledged the plan and expressed readiness to follow through. The therapist also offered encouragement and an open invitation for future support. However, the therapist did not explicitly provide a gentle closure invitation or discuss next steps such as follow-up sessions or additional resources. Because a clear closing invitation is missing, the conversation should continue to ensure proper session termination.\",\n  \"determination\": \"continue\"\n}",
      "phase": "terminating"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "It's great to see that you're taking initiative to explore your options and make informed decisions about your academic journey. Within the next two weeks, you'll gather valuable insights from your advisor and professor to determine if switching to a biology-related major is the right choice for you. Remember, this process is about finding the best fit for your interests and strengths, so trust in your ability to make the best decision for yourself. Good luck, and don't hesitate to reach out if you need any further support.",
      "phase": "terminating"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Thank you for your support I'll use these next two weeks to explore switching to biology and ensure it aligns with my love for STEM while securing a stable future. Goodbye for now.",
      "phase": "terminating"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The counselor has summarized the client's goals and action steps clearly, including contacting an academic advisor and professor within two weeks to explore switching to biology. The client acknowledges this plan and expresses readiness to follow through. The counselor also offers encouragement and invites further contact if needed. The conversation includes a natural closure with the client's 'Goodbye for now,' indicating satisfaction and readiness. However, an explicit invitation for closure from the counselor is missing, which is a key objective in Termination. Despite this, the client's final statement and overall summary satisfy the termination objectives sufficiently.\",\n  \"determination\": \"stop\"\n}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hi there! What's on your mind today? I'm here to listen and support you in any way I can.\nclient: I'm feeling uncertain about my college major decision and whether it's the right fit for me. I'm exploring options to switch to a science field to better align with my interests.\ntherapist: It sounds like you're at a crossroads, and it's completely normal to feel uncertain about your college major. It's great that you're exploring your interests and considering a switch to a science field. Have you identified any specific science majors that interest you?\nclient: Yes, I'm particularly interested in biology and biochemistry as potential majors. Exploring these options would help me better align my studies with my natural strengths in science subjects.\ntherapist: That's fantastic! Biology and biochemistry are both fascinating fields with many exciting career opportunities. It's great that you're considering majors that play to your strengths in science. Have you had a chance to speak with an academic advisor or any professors in those departments to get a better understanding of what the programs entail?\nclient: I haven't spoken with an academic advisor or professors in those departments yet. I'm eager to reach out to better understand if switching to biology could work for me.\ntherapist: It's great that you're taking the initiative to explore your options and find a major that aligns with your strengths and interests. Reaching out to an academic advisor or professors in the biology and biochemistry departments can provide valuable insights and guidance as you make your decision. What steps do you plan to take next in gathering more information about these majors?\nclient: I plan to schedule a meeting with an academic advisor in the biology department soon to discuss program requirements and switching options. Afterward, I'll reach out to a professor for more insights into how these majors might align with my interests.\ntherapist: It's great to have a clear plan in place. Speaking with an academic advisor will provide you with essential information on program requirements and the process of switching majors. Following up with a professor will give you a deeper understanding of how these majors align with your interests and career goals. Would you like to set a specific date by which you'll have completed these steps?\nclient: Yes, I'd like to set a specific date to help me stay accountable and move forward with exploring my options. How about aiming to complete these steps within the next two weeks?\ntherapist: That sounds like a reasonable timeframe to gather the information you need. Within the next two weeks, you'll have the opportunity to consult with an academic advisor and a professor, which will help you make an informed decision about your major. Remember to take your time and consider all the information you gather before making a final decision. I wish you the best of luck, and feel free to reach out if you need further assistance.\nclient: Thank you I'll follow through with these steps in the next two weeks to see if switching to biology aligns with my interests and career goals without compromising my future.\ntherapist: It's great to see that you're taking initiative to explore your options and make informed decisions about your academic journey. Within the next two weeks, you'll gather valuable insights from your advisor and professor to determine if switching to a biology-related major is the right choice for you. Remember, this process is about finding the best fit for your interests and strengths, so trust in your ability to make the best decision for yourself. Good luck, and don't hesitate to reach out if you need any further support.\nclient: Thank you for your support I'll use these next two weeks to explore switching to biology and ensure it aligns with my love for STEM while securing a stable future. Goodbye for now.",
  "completed": true
}