{
  "id": "1c7pyey",
  "timestamp": 1713484800000,
  "category": "school_life",
  "concern": "I'm 21, I've been studying computer science and going to graduate end of this year. But I'm not your average comp sci student, i got into it due to my passion of creating products, but uni hasn't been liked this, focusing on theoretical coding/math which I'm extremely bad at (Ive always been like this). I've barely passed most of my courses through memorization, asking many questions, and spending lots of time through brute force. I haven't truely learnt or understood much. I don't know, I've just always been like this since school, I can put lots of time into things I'm passionate about, but not efficiently or with good coding standards.\n\nAs such, I'm not confident in my abilities so I'm not looking forward to getting my first job (I've been on the doll). I will have like 30k in HECs, and 25k in the bank by graduation, which I'm at a crossroads of putting into HISA or ETFs but that isn't the point of this post.\n\nI also have had been amazed by stuff like chatgpt, I've kept up with all of the research and developments. It's been a light in the tunnel, but also a dark one, for someone like me who isn't smart. Dark in the sense that if I take a gap year, I'm almost sure ill come back to systems which are nearing the point of making me obsolete in the work force. It might not be there yet but its semantics at that point, it'll happen in the next year or two if it isn't.\n\nHowever, it is also amazing because it can then help me to create all the ideas I have, and I could be some baby enterpreneur. I would LOVE if it worked out like this and i could finance it.\n\nAnd I havent really gotten to travel. I've been told if I travel after graduating it'll be harder for me to find a job afterwards. This is concerning because I'm already not confident in finding a job. And my friends and family will keep asking me what I'm doing and I just hate that, I just want to be left alone. And I genuinely think I'll only get to work a couple of years before AI makes me pointless in the workforce. It sounds nice for me to travel for X months and come back to a different reality where i can see where my skills may be needed elsewhere. As for my travelling, I'm not sure where I'd go yet, but I'd love to backpack solo and travel on the cheapest of shoestrings. By working while I'm overseas (even though i've never worked before) and couch surfing, or pet sitting, or sleeping in a hamac, id hopefully limit costs so that I won't be taking $ out of the bank. also not sure how long i could go for but the more the merrier I say? I'll practice it in australia before before going overseas.\n\nAnd most importantly, expectations of my future and my wants/needs:\n\nI do not care to have a family, I do not care for a house, I'd much rather a hotel next to public transit in a walkable city. I don't have a car and I don't plan on getting one (I have my license but I just hate driving so I don't). I really hate the rat race of society which is likely why ive not worked a day in my life or done too well at uni. How I've been treated while on the doll has reaffirmed this, and mental health has declined just from this idea of how people treat you differently. It's actually made me want to work **less** because I'm really stubborn and if someone annoys or patronizes me I **hate** taking their advice. I would rather sacrifice my livelihood by living as cheaply as possible while still feeling secure by having access to necessities ie food/power/sleep then to constantly focus on money. For what? Just so I can afford to eat out, shop and buy junk or go on some extravagent travel? I'd rather cook something myself (even if I dont have many of the skills atm), only buy necessities that I really really need, or go on cheap travels and experience the country in a less touristy manner. As such, I do not really care if i get 200k, 100k or 50k as my annual income, I already don't spend money as is (Thats how ive got 20k in the bank without working. I do live with my parents though.). All I really want and value is time, so I can focus on other parts of my life.\n\nAlso, I have like 0 life skills but im willing to learn if i'm not patronized constantly, which is the main reason I haven't up until now. That's a big reason why I want to travel and work overseas or live with others.\n\nWhat do you think?\n\n",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hey there, how's it going today? What's on your mind?",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "I'm doing alright, but I've been feeling a bit uncertain lately. I'm mostly thinking about my career path and how to align it with my personal values.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited a detailed client story reflecting career doubts, personal values, financial concerns, and lifestyle preferences, demonstrating strong empathy and rapport. The client openly shares fears about job prospects due to AI, desire for travel and simple living, and resistance to traditional work norms, indicating psychological safety with minimal resistance. While explicit Change Talk is emerging around personal values (e.g., valuing time over money) and willingness to learn life skills, commitment or activation statements are not yet strongly present. The client expresses curiosity about next steps by asking \\\"What do you think?\\\" signaling readiness to move forward. Thus, Exploring objectives are substantially met, and readiness signals justify advancing to Guiding.\",\n  \"determination\": \"move\"\n}",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "That sounds like a pretty big topic to be navigating. Uncertainty can be tough, but it can also lead to some really positive self-discovery. What are some of your core values that you'd like to align with your career?",
      "phase": "guiding"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "I value freedom and time above material success, so I'd like a career that allows for flexibility and creativity without the pressures of a traditional job. Additionally, simplicity and personal growth are key to me, meaning I'd prefer paths that support meaningful experiences over high earnings or societal expectations.",
      "phase": "guiding"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has explored the client's core values and concerns thoroughly, reflecting empathy and eliciting the client's story. The client has articulated a clear discrepancy between their current academic experience and their values/goals of freedom, creativity, and meaningful experiences. The client has explored life options, including traveling, entrepreneurial aspirations, and nontraditional career paths, demonstrating ambivalence but also motivation. Although explicit importance/confidence rulers were not reported, the client expressed strong values and tentative plans (e.g., traveling, practicing skills before overseas travel, cautious financial goals). There is emerging Change Talk evidenced by the client stating willingness to learn and explore options despite low confidence. Ambivalence remains but resistance is minimal, indicating readiness to collaboratively develop action plans.\",\n  \"determination\": \"move\"\n}",
      "phase": "guiding"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It sounds like you have a really clear understanding of your values and priorities, which is awesome! With that in mind, have you considered any particular career paths or options that might align with your values? For example, freelance work, entrepreneurship, or creative fields?",
      "phase": "choosing"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "I've considered paths like entrepreneurship, particularly leveraging AI for creative projects, as it aligns with my desire for flexibility and personal growth. Freelance work also appeals to me, allowing for simpler living and the freedom to travel without being tied to a traditional job.",
      "phase": "choosing"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has identified a clear, specific goal of backpacking solo and working overseas on a shoestring budget, with flexibility to travel longer and practice locally first. The plan includes concrete strategies like couch surfing, pet sitting, and working while abroad to minimize costs. The client anticipates barriers such as lack of work experience, family/friends' expectations, and concerns about mental health and patronizing advice. The therapist elicited these barriers and strategies collaboratively, with the client expressing commitment (\\\"I'd love if it worked out like this\\\", \\\"I'll practice it in Australia before going overseas\\\") and confidence in managing the plan. The focus is shifting naturally toward next steps and follow-up, meeting criteria to move to Terminating.\",\n  \"determination\": \"move\"\n}",
      "phase": "choosing"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "To summarize, you're seeking a career path that prioritizes freedom, time, simplicity, and personal growth, while avoiding the constraints of a traditional job. You've considered options like entrepreneurship and freelance work, particularly leveraging AI for creative projects. It's great that you have a clear understanding of your values and priorities. Remember to keep exploring and reflecting on these options, and don't hesitate to reach out for support. Let's follow up in a month to discuss your progress and any new insights you've gained.",
      "phase": "terminating"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "I appreciate the summary and will keep exploring freelance and entrepreneurial paths with AI to prioritize my freedom and personal growth. I'll reach out before our follow-up in a month if I need support.",
      "phase": "terminating"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively summarized the client's core values, goals, and considered career options, reflecting the client's concerns about flexibility, personal growth, and entrepreneurial aspirations using AI. The client acknowledges and appreciates this summary and expresses a clear commitment to continue exploring these paths, indicating readiness. Additionally, the therapist proposes a follow-up session in a month, which the client accepted, demonstrating that next steps and ongoing support are in place. The conversation includes a gentle closure and invitation for future contact, fitting the Termination phase objectives.\",\n  \"determination\": \"stop\"\n}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hey there, how's it going today? What's on your mind?\nclient: I'm doing alright, but I've been feeling a bit uncertain lately. I'm mostly thinking about my career path and how to align it with my personal values.\ntherapist: That sounds like a pretty big topic to be navigating. Uncertainty can be tough, but it can also lead to some really positive self-discovery. What are some of your core values that you'd like to align with your career?\nclient: I value freedom and time above material success, so I'd like a career that allows for flexibility and creativity without the pressures of a traditional job. Additionally, simplicity and personal growth are key to me, meaning I'd prefer paths that support meaningful experiences over high earnings or societal expectations.\ntherapist: It sounds like you have a really clear understanding of your values and priorities, which is awesome! With that in mind, have you considered any particular career paths or options that might align with your values? For example, freelance work, entrepreneurship, or creative fields?\nclient: I've considered paths like entrepreneurship, particularly leveraging AI for creative projects, as it aligns with my desire for flexibility and personal growth. Freelance work also appeals to me, allowing for simpler living and the freedom to travel without being tied to a traditional job.\ntherapist: To summarize, you're seeking a career path that prioritizes freedom, time, simplicity, and personal growth, while avoiding the constraints of a traditional job. You've considered options like entrepreneurship and freelance work, particularly leveraging AI for creative projects. It's great that you have a clear understanding of your values and priorities. Remember to keep exploring and reflecting on these options, and don't hesitate to reach out for support. Let's follow up in a month to discuss your progress and any new insights you've gained.\nclient: I appreciate the summary and will keep exploring freelance and entrepreneurial paths with AI to prioritize my freedom and personal growth. I'll reach out before our follow-up in a month if I need support.",
  "completed": true
}