{
  "id": "106itcf",
  "timestamp": 1673136000000,
  "category": "academic",
  "concern": "I’m a freshman and at the beginning of my first semester, I got extremely sick for about a month and was testing negative for every covid test I took. I only felt well enough to go to class on some days but there were others where I couldn’t even get out of bed. My mom knew I was sick but there’s not much she could do because I go to school extremely far away from her. I didn’t tell her I wasn’t going to class on some days because she would’ve wanted me to go anyway. I ended up having to withdraw from one of my classes because I got too far behind and will be retaking it this following semester. I was left with only 3 classes. Two of my professors were extremely understanding of my illness and I was still getting my work done, so I was able to still end up doing well in those classes. \n\nIn my German class, my professor was extremely rude and did not answer a single one of my emails about me missing class. When I was able to return to class in person and explained, she didn’t really care. I struggled with my work a bit in the beginning, but was able to eventually start earning A’s on my tests and assignments with the professor even telling me I’ve made fantastic progress and that I was doing great. This professor never input a single grade into Canvas throughout the semester, and when I would ask her about my grade, she would just shrug and say she doesn’t know but she’ll check. When I would follow up, she’d say the same thing. This repeated for the entire semester. The class ended and I had no idea what my grade was, so I anxiously waited over winter break. My other two professors had inputed my grades, so I was only waiting on that one. \n\nGrades were due January 3rd and my final grade was posted on the 6th. She gave me an F, which I did not at all expect. This dropped my GPA below a 2.0 and puts me at risk of being put on academic probation. I’ve already contacted my advisor about appealing and will be calling the financial aid office on Monday, but I don’t know how to tell my mom without it sounding like i’m deflecting blame. She pays for all of my schooling and expenses, so I really don’t know what to do. She told me if I ever got an F she’d pull me out of school, but I genuinely don’t believe it was my fault in this situation. What should I do?",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hi there! What's on your mind today? I'm here to listen and offer support.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "I'm really stressed about a recent issue with one of my professors that affected my grades, and it's making me anxious about how to handle the fallout with my family. I'm worried this could impact my academic standing and future opportunities.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited a detailed client story with empathy, reflecting the client's concerns about illness, academic struggles, and family pressures, demonstrating strong rapport. The client has expressed anxiety and uncertainty but has shared plans to appeal and contact financial aid, indicating some movement towards change. However, there is no explicit agreement on session goals or expressed Change Talk beyond describing the problem and current steps. Resistance appears low, but the client has not yet clearly linked change to personal values or requested next steps. Therefore, Exploring objectives are substantially met, but readiness signals for advancing to Guiding are not sufficiently present.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "That sounds like a really tough situation, especially with the added pressure of family expectations. It's understandable that you're feeling anxious. Have you considered reaching out to your professor to discuss the issue?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "I've already tried reaching out to my professor during the semester, but it didn't lead to any resolution, which adds to my anxiety. I'm hesitant to try again because I'm worried it might not change the outcome and could worsen my stress about family expectations.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist elicited the client’s story and reflected empathy about the client’s anxiety and family pressure (turn 2). The client shared detailed concerns about the professor and academic consequences, showing psychological safety with low resistance. However, there is no strong Change Talk expressing desire, ability, reason, or commitment to change yet, nor client linkage of change to personal values or explicit request for next steps. The conversation is still focused on exploring the problem and emotions without moving toward motivation or planning.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It can be frustrating when attempts to address a problem don't yield the desired results. It's natural to feel hesitant about trying again, especially when there's so much at stake. It sounds like your family's expectations are a significant source of stress. Have you thought about discussing your concerns with a trusted family member or friend?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "I've thought about talking to a trusted friend, but I'm hesitant because I'm worried it might lead to more stress about my family's high expectations. I'm not sure if discussing it would help without first resolving the academic issues myself.",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited and reflected the client's story in detail, demonstrating empathy and building rapport (turns 1, 3, 5). The client openly shares their concerns and stressors, with mutual understanding of goals. The client expresses hesitance and anxiety but no overt resistance, indicating psychological safety. However, the client has not yet explicitly linked change to personal values or requested next steps, and Change Talk is limited to expressions of concern and hesitation rather than motivation for change. Given these factors, the Exploring phase objectives are mostly met, but readiness signals for moving to Guiding are not yet strong.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It's clear that you're feeling caught between a rock and a hard place. On one hand, you're dealing with the stress of unresolved academic issues, and on the other, you're worried about the potential fallout from your family's expectations. It's a lot to handle. It sounds like you're feeling a bit stuck, unsure of how to move forward. Is that accurate?",
      "phase": "exploring"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "Yes, that feels accurateI'm definitely feeling stuck between handling these academic challenges and the weight of my family's expectations. It's making it hard for me to figure out my next steps without escalating my anxiety.",
      "phase": "exploring"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist effectively elicited the client's story and reflected back key emotions and struggles, showing empathy and building rapport (turns 2, 4, 6, 8). The client clearly expressed feelings of anxiety and being stuck, which the therapist acknowledged accurately. However, no explicit session goals were mutually agreed upon yet, and the client has not yet begun expressing strong Change Talk or linking change to personal values/goals. Resistance remains low, but the conversation is still focused on exploring the problem rather than evoking motivation or planning. Therefore, while the Exploring phase objectives are substantially met, the session is not quite ready to move to Guiding.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It can be incredibly overwhelming to feel like you're facing a problem from multiple angles, especially when it's impacting your mental health. It's important to remember that you're not alone in this. Many people experience similar struggles, and there are resources available to help. Have you considered seeking support from your school's counseling services? They may be able to offer guidance and strategies to help you manage your anxiety and navigate the academic challenges you're facing.",
      "phase": "exploring"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Yes, I've already sought support from my school's counseling services to help manage my anxiety and navigate these academic challenges. It's been reassuring to have that resource, as it allows me to address my feelings of being stuck without immediately escalating the stress from family expectations.",
      "phase": "exploring"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively elicited and reflected the client's story, demonstrating empathy and building rapport (turns 1, 3, 5, 7). The client has shared detailed concerns and feels stuck, indicating psychological safety with minimal resistance (turns 2, 4, 6, 8). However, there is minimal Change Talk present; the client expresses hesitancy and worry but no clear statements about desire, ability, reason, or commitment to change yet. The client acknowledges supports accessed but does not explicitly link change to personal values or request next steps. Thus, the Exploring phase objectives are substantially met, but readiness signals for moving forward are not yet strong enough to advance.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "It's great that you've already taken the initiative to seek support from your school's counseling services. That's a really positive step in managing your anxiety and navigating these academic challenges. It sounds like you're trying to find a balance between addressing your feelings of being stuck and minimizing the stress from your family's expectations. How have the counseling services been helping you so far?",
      "phase": "exploring"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "The counseling services have been helping me by providing strategies to manage my anxiety and offering a supportive space to process my feelings. This has allowed me to gain some clarity on handling academic pressures without immediately involving my family, which eases my overall stress.",
      "phase": "exploring"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has successfully elicited the client's detailed story and reflected it empathetically, demonstrating strong rapport and psychological safety with no evident resistance. The client has agreed on the goal of managing academic stress and family expectations, showing insight and some resolution steps (e.g., utilizing counseling services). However, Change Talk remains tentative and ambivalent, focusing mainly on concerns and feelings of being stuck rather than explicit motivation for concrete change or commitment. There are no strong Change Talk utterances signaling readiness to move forward with specific planning. Given the thorough exploration and the client’s current ambivalence, the session should continue exploring before advancing.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "It's wonderful to hear that counseling services have been providing you with valuable support and strategies to manage your anxiety. Having a safe space to process your feelings and gain clarity can be incredibly helpful in navigating challenging situations. It sounds like this has been especially beneficial in helping you handle academic pressures without adding to the stress from your family's expectations. How are you feeling about your ability to continue managing these challenges?",
      "phase": "exploring"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "I'm feeling somewhat more confident in my ability to manage these challenges thanks to the strategies from counseling, but I'm still anxious about maintaining that progress without letting family expectations overwhelm me. Overall, it's helping me stay focused on taking small steps forward to address my academic concerns.",
      "phase": "exploring"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has actively elicited the client's story and reflected it back accurately, demonstrating consistent empathy and building rapport throughout (e.g., reflecting the client's anxiety, addressing family expectations, and acknowledging feelings of being stuck). The client has agreed on the goals of managing anxiety and academic challenges and shows psychological safety with no resistance observed. However, Change Talk is present but relatively tentative and mild, focusing mostly on coping strategies rather than explicit motivation for change or commitment. There is no clear explicit request for next steps from the client yet. Given the thorough exploration and rapport, but limited strong Change Talk and no explicit move towards action planning, continuing in Exploring is advisable to deepen motivation before moving forward.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "It's completely normal to still feel anxious, even when you're making progress. Remember that change and growth are often gradual processes, and it's important to acknowledge and celebrate the small steps you're taking. It sounds like you're doing a great job of staying focused on addressing your academic concerns. Have you considered setting some small, achievable goals for yourself to help maintain your progress and reduce the risk of feeling overwhelmed by family expectations?",
      "phase": "exploring"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "Yes, I've considered setting small, achievable goals like focusing on daily routines to manage my anxiety and tackle academic tasks step by step. However, I'm still worried that these goals might not fully shield me from the pressure of family expectations, making it challenging to maintain my progress.",
      "phase": "exploring"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited the client's story comprehensively, reflecting back key emotions and concerns, establishing rapport and empathy consistently (e.g., acknowledging stress and anxiety, using reflective summaries). The client has acknowledged feeling stuck but also shared proactive steps taken (e.g., seeking counseling, considering small goals). There is minimal resistance, and the client links change efforts to personal goals (managing anxiety, academic progress). Although explicit commitment language is moderate, the client expresses some confidence in managing challenges and a desire to set achievable goals. The conversation shows readiness to deepen motivation and explore change strategies, meeting Exploring phase objectives and signaling readiness to move forward.\",\n  \"determination\": \"move\"\n}",
      "phase": "exploring"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "It's great that you're setting small, achievable goals to manage your anxiety and tackle academic tasks. These goals can provide a sense of structure and accomplishment, even in the face of ongoing challenges. It's important to remember that while setting these goals can help, they may not completely shield you from the pressure of family expectations. That's why it's crucial to continue seeking support and practicing selfcare to help manage your anxiety and maintain your progress. Have you identified any selfcare activities that help you feel more grounded and centered when you're feeling overwhelmed?",
      "phase": "guiding"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "Yes, I've identified selfcare activities like going for walks and practicing deep breathing exercises, which help me feel more grounded when anxiety builds. However, I'm still concerned that these might not fully counteract the stress from family expectations, making it challenging to maintain my emotional balance.",
      "phase": "guiding"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The counselor has successfully evoked discrepancy between the client's academic challenges and family expectations, exploring the client's ambivalence and anxiety. The client has reflected on life with and without change, mentioning progress through counseling and small achievable goals, indicating some movement towards change. Although the client expresses ongoing anxiety and concerns about family pressure, there is activation and taking-steps language (e.g., seeking counseling, setting goals, practicing self-care). Importantly, ambivalence and sustain-talk have decreased, and the client is articulating specific actions to manage stress and academic concerns. Therefore, the session has met guiding phase objectives and shows readiness signals to move forward.\",\n  \"determination\": \"move\"\n}",
      "phase": "guiding"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "It's fantastic that you've identified some selfcare activities that help you feel more grounded when anxiety builds. Remember that these activities, while helpful, may not entirely eliminate the stress from family expectations. However, by continuing to practice these selfcare activities and seeking support, you're giving yourself the best chance to manage your anxiety and maintain your emotional balance. Are there any additional strategies you've considered to help manage the stress related to family expectations, like setting boundaries or communicating your needs?",
      "phase": "choosing"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "Yes, I've considered strategies like setting boundaries with my family by choosing the right time and way to share updates, as well as practicing how to communicate my needs clearly without sounding defensive. However, I'm still anxious that these approaches might not prevent the stress from escalating, making it tough to fully protect my emotional wellbeing.",
      "phase": "choosing"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has identified specific, small achievable goals such as managing anxiety through daily routines and self-care activities like walks and deep breathing. They have also considered boundary-setting and communicating needs with family as strategies to handle stress. The therapist and client collaboratively discussed these steps, indicating a shared action plan with concrete steps. However, the client still expresses anxiety and concern about fully managing family expectations, and no clear timeline or explicit follow-up plan has been established. There is some commitment to ongoing self-care and small steps, but no strong commitment language indicating readiness to move forward. Therefore, the Choosing objectives are partially met but not substantially enough to advance.\",\n  \"determination\": \"continue\"\n}",
      "phase": "choosing"
    },
    {
      "index": 20,
      "role": "therapist",
      "statement": "It's understandable that you're still feeling anxious, even with these strategies in place. Setting boundaries and communicating your needs can be challenging, especially when it comes to family dynamics. Remember that you can't control how others react, but you can control how you respond. It's important to continue practicing these strategies, and if necessary, seek additional support from your counselor or a trusted friend. Do you feel like you have a strong support network in place to help you navigate these challenges?",
      "phase": "choosing"
    },
    {
      "index": 21,
      "role": "client",
      "statement": "I feel like I have a decent support network through my school's counseling services and by reaching out to trusted friends, which has been helpful so far. However, I'm still worried that this network might not fully shield me from the anxiety caused by family expectations as I navigate these challenges.",
      "phase": "choosing"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has collaboratively identified specific, achievable goals such as focusing on daily routines, managing anxiety step-by-step, and practicing self-care activities like walks and deep breathing. They have acknowledged potential barriers, notably ongoing family expectations, and discussed strategies including setting boundaries and clear communication. The client expresses moderate confidence and is actively taking steps with school counseling support and trusted friends. There is sustained commitment talk about continuing small steps and seeking support. The client also agrees on follow-up through their counseling services and peer network. The dialogue reflects minimal resistance and an emerging focus on maintaining progress and emotional balance, indicating readiness to plan next steps and review progress.\",\n  \"determination\": \"move\"\n}",
      "phase": "choosing"
    },
    {
      "index": 22,
      "role": "therapist",
      "statement": "It's great that you have a support network in place, but it's understandable that you're still worried about the impact of family expectations. Remember, the goal isn't necessarily to shield yourself completely from anxiety, but to develop the tools and resilience to manage it when it arises. By continuing to utilize your support network and practice selfcare, you're building a solid foundation to help you navigate these challenges. Do you feel like you're making progress in developing these tools and resilience?",
      "phase": "terminating"
    },
    {
      "index": 23,
      "role": "client",
      "statement": "I'm feeling like I'm making some progress in developing these tools and resilience, thanks to the support and strategies from counseling. However, I'm still anxious that family expectations could undermine this progress, making it challenging to maintain my emotional balance.",
      "phase": "terminating"
    },
    {
      "index": "al",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively summarized the client's goals and action steps, including managing anxiety, setting small goals, practicing self-care, and using support networks. The client acknowledges these summaries and expresses readiness while still noting some anxiety. The therapist gently introduces closure by affirming progress and encouraging ongoing practice of strategies. Follow-up options are implied (continuing counseling support), and the therapist reinforces support and encouragement. A natural pause is present with the client reflecting on progress and ongoing concerns. All five termination strategies are addressed, and the client expresses agreement with the summary and support plan.\",\n  \"determination\": \"stop\"\n}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hi there! What's on your mind today? I'm here to listen and offer support.\nclient: I'm really stressed about a recent issue with one of my professors that affected my grades, and it's making me anxious about how to handle the fallout with my family. I'm worried this could impact my academic standing and future opportunities.\ntherapist: That sounds like a really tough situation, especially with the added pressure of family expectations. It's understandable that you're feeling anxious. Have you considered reaching out to your professor to discuss the issue?\nclient: I've already tried reaching out to my professor during the semester, but it didn't lead to any resolution, which adds to my anxiety. I'm hesitant to try again because I'm worried it might not change the outcome and could worsen my stress about family expectations.\ntherapist: It can be frustrating when attempts to address a problem don't yield the desired results. It's natural to feel hesitant about trying again, especially when there's so much at stake. It sounds like your family's expectations are a significant source of stress. Have you thought about discussing your concerns with a trusted family member or friend?\nclient: I've thought about talking to a trusted friend, but I'm hesitant because I'm worried it might lead to more stress about my family's high expectations. I'm not sure if discussing it would help without first resolving the academic issues myself.\ntherapist: It's clear that you're feeling caught between a rock and a hard place. On one hand, you're dealing with the stress of unresolved academic issues, and on the other, you're worried about the potential fallout from your family's expectations. It's a lot to handle. It sounds like you're feeling a bit stuck, unsure of how to move forward. Is that accurate?\nclient: Yes, that feels accurateI'm definitely feeling stuck between handling these academic challenges and the weight of my family's expectations. It's making it hard for me to figure out my next steps without escalating my anxiety.\ntherapist: It can be incredibly overwhelming to feel like you're facing a problem from multiple angles, especially when it's impacting your mental health. It's important to remember that you're not alone in this. Many people experience similar struggles, and there are resources available to help. Have you considered seeking support from your school's counseling services? They may be able to offer guidance and strategies to help you manage your anxiety and navigate the academic challenges you're facing.\nclient: Yes, I've already sought support from my school's counseling services to help manage my anxiety and navigate these academic challenges. It's been reassuring to have that resource, as it allows me to address my feelings of being stuck without immediately escalating the stress from family expectations.\ntherapist: It's great that you've already taken the initiative to seek support from your school's counseling services. That's a really positive step in managing your anxiety and navigating these academic challenges. It sounds like you're trying to find a balance between addressing your feelings of being stuck and minimizing the stress from your family's expectations. How have the counseling services been helping you so far?\nclient: The counseling services have been helping me by providing strategies to manage my anxiety and offering a supportive space to process my feelings. This has allowed me to gain some clarity on handling academic pressures without immediately involving my family, which eases my overall stress.\ntherapist: It's wonderful to hear that counseling services have been providing you with valuable support and strategies to manage your anxiety. Having a safe space to process your feelings and gain clarity can be incredibly helpful in navigating challenging situations. It sounds like this has been especially beneficial in helping you handle academic pressures without adding to the stress from your family's expectations. How are you feeling about your ability to continue managing these challenges?\nclient: I'm feeling somewhat more confident in my ability to manage these challenges thanks to the strategies from counseling, but I'm still anxious about maintaining that progress without letting family expectations overwhelm me. Overall, it's helping me stay focused on taking small steps forward to address my academic concerns.\ntherapist: It's completely normal to still feel anxious, even when you're making progress. Remember that change and growth are often gradual processes, and it's important to acknowledge and celebrate the small steps you're taking. It sounds like you're doing a great job of staying focused on addressing your academic concerns. Have you considered setting some small, achievable goals for yourself to help maintain your progress and reduce the risk of feeling overwhelmed by family expectations?\nclient: Yes, I've considered setting small, achievable goals like focusing on daily routines to manage my anxiety and tackle academic tasks step by step. However, I'm still worried that these goals might not fully shield me from the pressure of family expectations, making it challenging to maintain my progress.\ntherapist: It's great that you're setting small, achievable goals to manage your anxiety and tackle academic tasks. These goals can provide a sense of structure and accomplishment, even in the face of ongoing challenges. It's important to remember that while setting these goals can help, they may not completely shield you from the pressure of family expectations. That's why it's crucial to continue seeking support and practicing selfcare to help manage your anxiety and maintain your progress. Have you identified any selfcare activities that help you feel more grounded and centered when you're feeling overwhelmed?\nclient: Yes, I've identified selfcare activities like going for walks and practicing deep breathing exercises, which help me feel more grounded when anxiety builds. However, I'm still concerned that these might not fully counteract the stress from family expectations, making it challenging to maintain my emotional balance.\ntherapist: It's fantastic that you've identified some selfcare activities that help you feel more grounded when anxiety builds. Remember that these activities, while helpful, may not entirely eliminate the stress from family expectations. However, by continuing to practice these selfcare activities and seeking support, you're giving yourself the best chance to manage your anxiety and maintain your emotional balance. Are there any additional strategies you've considered to help manage the stress related to family expectations, like setting boundaries or communicating your needs?\nclient: Yes, I've considered strategies like setting boundaries with my family by choosing the right time and way to share updates, as well as practicing how to communicate my needs clearly without sounding defensive. However, I'm still anxious that these approaches might not prevent the stress from escalating, making it tough to fully protect my emotional wellbeing.\ntherapist: It's understandable that you're still feeling anxious, even with these strategies in place. Setting boundaries and communicating your needs can be challenging, especially when it comes to family dynamics. Remember that you can't control how others react, but you can control how you respond. It's important to continue practicing these strategies, and if necessary, seek additional support from your counselor or a trusted friend. Do you feel like you have a strong support network in place to help you navigate these challenges?\nclient: I feel like I have a decent support network through my school's counseling services and by reaching out to trusted friends, which has been helpful so far. However, I'm still worried that this network might not fully shield me from the anxiety caused by family expectations as I navigate these challenges.\ntherapist: It's great that you have a support network in place, but it's understandable that you're still worried about the impact of family expectations. Remember, the goal isn't necessarily to shield yourself completely from anxiety, but to develop the tools and resilience to manage it when it arises. By continuing to utilize your support network and practice selfcare, you're building a solid foundation to help you navigate these challenges. Do you feel like you're making progress in developing these tools and resilience?\nclient: I'm feeling like I'm making some progress in developing these tools and resilience, thanks to the support and strategies from counseling. However, I'm still anxious that family expectations could undermine this progress, making it challenging to maintain my emotional balance.",
  "completed": true,
  "turns": 24
}