{
  "id": "107lmbj",
  "timestamp": 1673222400000,
  "category": "school_life",
  "concern": "I’m looking for advice on how to make a decision on majors. I am currently taking full-time PSEO courses at a private college in Minnesota, in my Junior year of HS. I am covering my generals, but soon I am going to have to make a decision so I don't waste next year on random courses that might not benefit my future. This first semester of college has been amazing, and also really anxiety provoking when I consider how fast time is passing. I can't imagine how much greater my anxiety will be when I actually have to start paying for the classes I take. \n\nMy plan has always been to go to school for years on end and earn my VMD license. I do really enjoy working with animals and have fostered numerous cats and dogs. I even plan to get my school paid for by joining the military, the army has a vet school program. I get good grades and enjoy the biology and science classes I have taken, but recently I have been very anxious about my future. I'm beginning to question my motives. I feel like I haven't really explored other career options because it has just always been known that I will go into a veterinary career. I have heard my entire life,\n\n“you're an animal whisperer,” \n\n“you wouldn't do well working with actual humans,”\n\n“you can do anything you want in life,”\n\nfrom the adults that seem to know everything there is to learn. I feel like at this point, I can't change my career path because it is just socially accepted that this is it. I would be happy to be a Vet! I know there are many who struggle to see cruelty cases every day, and there is absolutely change needed to our animal healthcare system in the US. But there are so many other options to take with my schooling and my life. Do I really want to spend my 20’s in labs and classrooms? Do I want to lose my faith in humanity when I see animals abused again and again? Can I make more of a difference if I choose to do something else with my time but donate to organizations that already make a difference? I just have this lurking feeling that getting a different job might be more realistic for the life I want. I enjoy school, but I lack any kind of social life, and I don't want it to be this way forever. I feel like I’m missing something that seems to motivate everyone else. \n\nI enjoy the arts and have been active in the art scene in my city. I went to a Performing arts High School and loved the environment to uplift my community. But there isn’t enough money to support a mediocre vocalist in our current media craze. I so enjoy history and would love a job as a environmental historian, or maybe an environmental chemist. Anything to study the world around me, and appreciate the natural ways of the world, and how we are so insignificant but create such wide problems. What I wouldn't do to be an anthropologist, working towards uncovering the truth behind our human development. But these fields pay so little, in a scene so wide. \n\nHow did you decide what to do with your life? How did you decide what to major in? Is there a major that can satisfy the possibility of everything I could do? What if I get through my first veterinary med class just to puke at an incision site? Do I go for a lighter job, say, environmental preservation, with the possibility of never retiring? It's all some big scam, sure, but I have this feeling it matters so much. \n\nAnd then comes actually choosing the school to best serve my major! And does it really matter where you go? Do schools really vary so much under the same curriculum? Is it normal to be so worked up about this? I just can't help thinking this decision I make at such a young age might make me unhappy for the rest of my life. The potential for success is so great, and the likelihood of unhappiness also. Any advice is appreciated. Or maybe just thanks for reading my brain dump.",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hi there! What's on your mind today? I'm here to listen and provide a nonjudgmental space for you to share your thoughts and concerns. ",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "I'm feeling really anxious about deciding on a major and career path, especially since I've always been steered towards veterinary medicine but am curious about other fields like the arts or environmental studies. It's overwhelming to think that this choice could shape my future happiness and social life in ways I'm not sure about yet.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has provided a safe, nonjudgmental environment, and the client has shared a detailed story expressing anxiety and ambivalence about their career and educational choices. The therapist's empathic opening and the client's extensive narrative indicate psychological safety and rapport. However, the client expresses multiple concerns and uncertainties without clear, strong Change Talk statements indicating readiness for change or commitment. There is no explicit agreement on session goals yet, and resistance is not evident but neither is strong motivation. Given the ongoing exploration of feelings and options without a shift towards planning or change talk, the session is appropriately still in Exploring phase.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "It sounds like you're feeling a lot of pressure to make a big decision about your future, and you're also grappling with the desire to explore other interests. It's totally normal to feel overwhelmed and uncertain in this situation. Have you thought about what draws you to these other fields, or what worries you about pursuing them?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "I'm drawn to fields like the arts for the creative community and sense of upliftment they provide, and to environmental studies for their focus on understanding and preserving the natural world. However, I'm worried about the financial instability and lower earning potential in these areas, which makes me anxious about longterm security and balancing my passions with practical life needs.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited a detailed and rich client story centered on anxiety about major and career decisions, reflecting empathy and rapport through validating the client's feelings and asking open questions about interests and concerns (turns 1-4). The client expresses ambivalence, linking career choices to personal values like creativity, social life, and financial security, but no explicit Change Talk about commitment or taking steps is present yet. Resistance is minimal, but the client remains uncertain and exploratory. Session goals are implicitly aligned with exploring options rather than planning change. Therefore, the Exploring phase objectives are met, but the session is not yet ready to move to Guiding because strong Change Talk and client readiness signals for change planning have not sufficiently emerged.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It sounds like you're torn between your passions and practical concerns, which is a common dilemma for many people. On one hand, you're drawn to the creative and uplifting aspects of the arts, and the meaningful work of environmental studies, but on the other hand, you're worried about the financial stability and security that may come with pursuing those fields. It's understandable to feel anxious about balancing your passions with practical needs. Have you considered exploring ways to combine your interests, or finding a career path that incorporates elements of both?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "Yes, I've considered ways to combine my interests, like perhaps integrating animal welfare with environmental studies to create a career that feels more holistic and meaningful. However, I'm still anxious about whether such paths would provide the financial stability I need to avoid longterm regrets.",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited and reflected the client's story thoroughly, demonstrating empathy and building rapport by validating the client's feelings of anxiety and ambivalence about career choices. The client has openly shared complex concerns and values, showing psychological safety and low resistance. However, while the therapist has begun exploring the client's interests and worries, the client has not yet expressed explicit Change Talk related to commitment or activation toward change, nor have they requested next steps. The conversation remains in a broad exploration of feelings and options without clear movement toward motivation for change or action planning.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It sounds like you're exploring ways to align your passions with your career goals, which is a great step. The idea of combining animal welfare and environmental studies into a holistic career path sounds really interesting. However, it's understandable that you're still feeling anxious about the financial stability aspect. Have you done any research into the job prospects and earning potential in this field, or talked to anyone who works in a similar role?",
      "phase": "exploring"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "I've done some initial research on job prospects in fields like environmental science, which seem to offer modest starting salaries and potential for growth in roles like conservation, but I'm concerned it might not provide the financial security I crave. I haven't yet talked to anyone in a similar role, as my anxiety has kept me from reaching out, making me feel even more uncertain about committing to this path.",
      "phase": "exploring"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has shared a detailed and nuanced story about their major and career decision anxiety, reflecting on passions, practical concerns, and social expectations, which the therapist has consistently reflected empathetically and validated. The therapist and client have mutually explored goals around career clarity and emotional processing, demonstrating psychological safety. However, Change Talk specifically indicating motivation or commitment to change is limited; the client expresses ongoing anxieties and uncertainty rather than clear motivation or plans. Resistance is minimal, but the client remains in exploration mode without clear signals of readiness to move forward. Therefore, the session objectives for Exploring are substantially met, but the client is not yet signaling readiness to advance.\",\n  \"determination\": \"continue\"\n}",
      "phase": "exploring"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It sounds like you're taking steps to gather information, but your anxiety is holding you back from reaching out to people who might have valuable insights. It's understandable to feel nervous about making a commitment without all the information you'd like to have. Have you considered starting with smaller steps, like reaching out to a career counselor or someone in your network who might know someone in the field?",
      "phase": "exploring"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "I've thought about reaching out to a career counselor as a smaller step to gather more insights, but my anxiety often holds me back from initiating those conversations. It might help alleviate some of my uncertainty about combining my interests with practical career options.",
      "phase": "exploring"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has elicited and reflected the client's story thoroughly, demonstrating consistent empathy and rapport throughout the session. The client has openly shared anxieties and explored various career interests, indicating psychological safety. Session goals around exploring major and career uncertainties appear mutually understood. However, while the client shows desire and reason for change (exploring new fields beyond veterinary medicine), explicit strong Change Talk about commitment or activation to change remains minimal, and anxiety/resistance about next steps persists. The conversation is progressing without circularity but has not clearly moved into motivation strengthening or planning. Hence, the session is ready to move from Exploring to Guiding to deepen motivation and elicit stronger Change Talk.\",\n  \"determination\": \"move\"\n}",
      "phase": "exploring"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "It's great that you're considering reaching out to a career counselor, even if anxiety is making it difficult. Remember that career counselors are there to help you navigate these kinds of decisions, and they're likely used to working with people who are feeling anxious or uncertain. Would it help if you thought of some specific questions to ask them beforehand, so you feel more prepared going into the conversation?",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "client Yes, thinking of specific questions beforehand would help me feel more prepared and less overwhelmed during the conversation, as it could give me a sense of control over my uncertainties. However, I'm still anxious that even with preparation, the answers might not fully resolve my fears about career choices and financial stability.",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has explored discrepancies between current expectations and personal values, expressing concerns about financial stability and passion alignment, reflecting ambivalence. They have weighed pros and cons of veterinary medicine versus arts and environmental fields, indicating awareness of potential futures. The therapist has used reflective listening and encouraged consideration of smaller steps like contacting a career counselor. The client articulated specific next steps (reaching out to a career counselor) and recognized anxiety barriers but showed some Activation Talk (e.g., considering specific questions to prepare). Sustained ambivalence and anxiety remain but have lessened. Overall, the client shows emerging readiness with some commitment to action, justifying progression to Choosing phase to collaboratively develop plans to overcome barriers.\",\n  \"determination\": \"move\"\n}",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "It's understandable that even with preparation, you might still feel anxious about the unknowns surrounding your career choices and financial stability. It's important to remember that uncertainty is a natural part of the decisionmaking process, and it's okay to feel some anxiety around it. That being said, gathering as much information as possible can help you make a more informed decision. Have you considered setting a deadline for yourself to make a decision, so that you don't feel like you're stuck in limbo indefinitely?",
      "phase": "choosing"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "I've considered setting a deadline for myself to make a decision, as it could help push me out of this ongoing uncertainty, but I'm anxious that it might increase my stress and lead to a choice I later regret due to incomplete exploration of my options.",
      "phase": "choosing"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has articulated specific concerns and explored various career paths, but the conversation lacks a clear, specific goal or action plan with concrete steps, timeline, or follow-up strategies. The client has expressed intent to reach out to a career counselor and prepare questions, showing some commitment talk, but anxiety remains a significant barrier and no concrete plan for overcoming it or scheduling the outreach was established. Anticipated barriers like anxiety are acknowledged, but contingency planning (e.g., alternative resources or steps if outreach fails) was not developed. The client neither expressed confidence levels nor agreed on a monitoring or follow-up method, so Choosing objectives remain unmet.\",\n  \"determination\": \"continue\"\n}",
      "phase": "choosing"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "It's true that setting a deadline could potentially increase stress, but it can also help you prioritize your time and energy towards making a decision. To help mitigate the risk of regret, have you thought about creating a pros and cons list for each potential career path, including factors like job satisfaction, financial stability, and personal growth?",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "I've thought about creating a pros and cons list for each career path, as it could help organize my thoughts on factors like job satisfaction and financial stability, but I'm anxious that it might oversimplify the emotional and longterm impacts, potentially leading to regrets if I don't fully capture my uncertainties.",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has not yet selected a clear, specific goal or developed a concrete action plan with timeline and contingency strategies. They express ongoing anxiety and uncertainty, and no firm commitments or self-monitoring methods have been agreed upon. The dialogue revolves around exploring options and acknowledging feelings but lacks explicit planning or commitment language ('Change Talk'). The client remains hesitant about initiating steps like contacting a career counselor despite considering it. There is no clear shift toward planning next contacts or follow-up. Therefore, Choosing objectives are not substantially met, and readiness signals are minimal.\",\n  \"determination\": \"continue\"\n}",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "That's a valid concern. While a pros and cons list can be helpful, it's important to remember that it's just one tool in your decisionmaking process. To help address your anxieties, you could consider adding a column to your list for potential emotional impacts or longterm considerations, or even creating a separate list for those factors. Have you also thought about what your gut instinct is telling you about each career path?",
      "phase": "choosing"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "Yes, I've thought about my gut instinct, which leans towards pursuing something in environmental studies for its deeper sense of purpose and connection to the natural world. However, I'm anxious that following this instinct might lead to regrets if it doesn't align with the financial stability I've always associated with a veterinary career.",
      "phase": "choosing"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has moved through exploring and guiding phases and is now in the Choosing phase where a specific action plan should be co-developed. The client has identified a tentative goal to reach out to a career counselor with prepared questions to better explore career options integrating their interests and concerns about financial stability. The client acknowledges anxiety but shows willingness to take this concrete step, indicating some commitment talk. However, the plan lacks explicit timeline, contingency strategies for high anxiety, and a defined follow-up or monitoring method. The client expresses lingering doubts and no mention is made of setting a decision deadline or monitoring progress after the outreach. Thus, while the client shows readiness signals and a nascent action plan, the Choosing objectives are only partially met and the plan is not fully solidified.\",\n  \"determination\": \"continue\"\n}",
      "phase": "choosing"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "It sounds like you're caught between your heart and your head, which is a tough position to be in. Your gut instinct is telling you to pursue environmental studies for the deeper sense of purpose it offers, but you're worried about the financial stability that might come with that choice. Have you considered ways to mitigate the financial risks, such as exploring scholarships or grants, or considering parttime work while you're studying?",
      "phase": "choosing"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "Yes, I've considered exploring scholarships and grants to help with the costs of studying environmental fields, as well as parttime work to build financial security. However, I'm still anxious that these measures might not fully alleviate the longterm financial risks, potentially leading to regrets if my career path doesn't provide the stability I've envisioned.",
      "phase": "choosing"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The client has co-created a clear, specific goal around deciding on a major and career path, acknowledging the need to set deadlines and research options. They've identified action steps such as reaching out to a career counselor, preparing questions, exploring financial aid, and considering part-time work. Anticipated barriers like anxiety and fear of regret are openly discussed with contingency strategies (e.g., smaller outreach steps, pros and cons lists with emotional factors added). The client expresses sustained commitment talk about preparing questions and taking smaller steps, with minimal resistance. The conversation naturally shifts toward planning next contacts and progress review, showing readiness for closure.\",\n  \"determination\": \"move\"\n}",
      "phase": "choosing"
    },
    {
      "index": 20,
      "role": "therapist",
      "statement": "It's natural to feel anxious about the longterm financial implications of your career choices. While scholarships, grants, and parttime work can help, it's important to also consider the potential earning potential and job prospects in the field. Have you researched the average salaries and job growth projections for environmental careers, and compared them to those for veterinary medicine?",
      "phase": "terminating"
    },
    {
      "index": 21,
      "role": "client",
      "statement": "I've done some research on average salaries and job growth for environmental careers, which show modest starting pay with potential increases in roles like conservation, compared to the higher earning potential in veterinary medicine. However, this comparison heightens my anxiety about choosing a path that might compromise longterm financial security and lead to future regrets.",
      "phase": "terminating"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "{\n  \"reasoning\": \"The therapist has effectively summarized the client's goals and concerns regarding career and major choice, acknowledging anxieties and ambivalence. They discussed coping strategies like breaking decisions into smaller steps, pros and cons lists with emotional considerations, and financial risk mitigation (scholarships, part-time work). The client has acknowledged these summaries and expressed readiness to use strategies like reaching out to a career counselor with prepared questions. The therapist gently introduced closure, affirmed client autonomy, and invited follow-up actions. Encouragement and support were reinforced, and next steps, including seeking career counseling and decision deadlines, were discussed. These align with Termination objectives and all five readiness strategies.\",\n  \"determination\": \"stop\"\n}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hi there! What's on your mind today? I'm here to listen and provide a nonjudgmental space for you to share your thoughts and concerns. \nclient: I'm feeling really anxious about deciding on a major and career path, especially since I've always been steered towards veterinary medicine but am curious about other fields like the arts or environmental studies. It's overwhelming to think that this choice could shape my future happiness and social life in ways I'm not sure about yet.\ntherapist: It sounds like you're feeling a lot of pressure to make a big decision about your future, and you're also grappling with the desire to explore other interests. It's totally normal to feel overwhelmed and uncertain in this situation. Have you thought about what draws you to these other fields, or what worries you about pursuing them?\nclient: I'm drawn to fields like the arts for the creative community and sense of upliftment they provide, and to environmental studies for their focus on understanding and preserving the natural world. However, I'm worried about the financial instability and lower earning potential in these areas, which makes me anxious about longterm security and balancing my passions with practical life needs.\ntherapist: It sounds like you're torn between your passions and practical concerns, which is a common dilemma for many people. On one hand, you're drawn to the creative and uplifting aspects of the arts, and the meaningful work of environmental studies, but on the other hand, you're worried about the financial stability and security that may come with pursuing those fields. It's understandable to feel anxious about balancing your passions with practical needs. Have you considered exploring ways to combine your interests, or finding a career path that incorporates elements of both?\nclient: Yes, I've considered ways to combine my interests, like perhaps integrating animal welfare with environmental studies to create a career that feels more holistic and meaningful. However, I'm still anxious about whether such paths would provide the financial stability I need to avoid longterm regrets.\ntherapist: It sounds like you're exploring ways to align your passions with your career goals, which is a great step. The idea of combining animal welfare and environmental studies into a holistic career path sounds really interesting. However, it's understandable that you're still feeling anxious about the financial stability aspect. Have you done any research into the job prospects and earning potential in this field, or talked to anyone who works in a similar role?\nclient: I've done some initial research on job prospects in fields like environmental science, which seem to offer modest starting salaries and potential for growth in roles like conservation, but I'm concerned it might not provide the financial security I crave. I haven't yet talked to anyone in a similar role, as my anxiety has kept me from reaching out, making me feel even more uncertain about committing to this path.\ntherapist: It sounds like you're taking steps to gather information, but your anxiety is holding you back from reaching out to people who might have valuable insights. It's understandable to feel nervous about making a commitment without all the information you'd like to have. Have you considered starting with smaller steps, like reaching out to a career counselor or someone in your network who might know someone in the field?\nclient: I've thought about reaching out to a career counselor as a smaller step to gather more insights, but my anxiety often holds me back from initiating those conversations. It might help alleviate some of my uncertainty about combining my interests with practical career options.\ntherapist: It's great that you're considering reaching out to a career counselor, even if anxiety is making it difficult. Remember that career counselors are there to help you navigate these kinds of decisions, and they're likely used to working with people who are feeling anxious or uncertain. Would it help if you thought of some specific questions to ask them beforehand, so you feel more prepared going into the conversation?\nclient: client Yes, thinking of specific questions beforehand would help me feel more prepared and less overwhelmed during the conversation, as it could give me a sense of control over my uncertainties. However, I'm still anxious that even with preparation, the answers might not fully resolve my fears about career choices and financial stability.\ntherapist: It's understandable that even with preparation, you might still feel anxious about the unknowns surrounding your career choices and financial stability. It's important to remember that uncertainty is a natural part of the decisionmaking process, and it's okay to feel some anxiety around it. That being said, gathering as much information as possible can help you make a more informed decision. Have you considered setting a deadline for yourself to make a decision, so that you don't feel like you're stuck in limbo indefinitely?\nclient: I've considered setting a deadline for myself to make a decision, as it could help push me out of this ongoing uncertainty, but I'm anxious that it might increase my stress and lead to a choice I later regret due to incomplete exploration of my options.\ntherapist: It's true that setting a deadline could potentially increase stress, but it can also help you prioritize your time and energy towards making a decision. To help mitigate the risk of regret, have you thought about creating a pros and cons list for each potential career path, including factors like job satisfaction, financial stability, and personal growth?\nclient: I've thought about creating a pros and cons list for each career path, as it could help organize my thoughts on factors like job satisfaction and financial stability, but I'm anxious that it might oversimplify the emotional and longterm impacts, potentially leading to regrets if I don't fully capture my uncertainties.\ntherapist: That's a valid concern. While a pros and cons list can be helpful, it's important to remember that it's just one tool in your decisionmaking process. To help address your anxieties, you could consider adding a column to your list for potential emotional impacts or longterm considerations, or even creating a separate list for those factors. Have you also thought about what your gut instinct is telling you about each career path?\nclient: Yes, I've thought about my gut instinct, which leans towards pursuing something in environmental studies for its deeper sense of purpose and connection to the natural world. However, I'm anxious that following this instinct might lead to regrets if it doesn't align with the financial stability I've always associated with a veterinary career.\ntherapist: It sounds like you're caught between your heart and your head, which is a tough position to be in. Your gut instinct is telling you to pursue environmental studies for the deeper sense of purpose it offers, but you're worried about the financial stability that might come with that choice. Have you considered ways to mitigate the financial risks, such as exploring scholarships or grants, or considering parttime work while you're studying?\nclient: Yes, I've considered exploring scholarships and grants to help with the costs of studying environmental fields, as well as parttime work to build financial security. However, I'm still anxious that these measures might not fully alleviate the longterm financial risks, potentially leading to regrets if my career path doesn't provide the stability I've envisioned.\ntherapist: It's natural to feel anxious about the longterm financial implications of your career choices. While scholarships, grants, and parttime work can help, it's important to also consider the potential earning potential and job prospects in the field. Have you researched the average salaries and job growth projections for environmental careers, and compared them to those for veterinary medicine?\nclient: I've done some research on average salaries and job growth for environmental careers, which show modest starting pay with potential increases in roles like conservation, compared to the higher earning potential in veterinary medicine. However, this comparison heightens my anxiety about choosing a path that might compromise longterm financial security and lead to future regrets.",
  "completed": true,
  "turns": 22
}