{
  "id": "10pknnn",
  "timestamp": 1675123200000,
  "category": "academic",
  "concern": "I have never been in an academic setting that challenged me so much. In undergrad I was always on top of my work and had enough time to enjoy myself, go to the gym, and even party. In my second year of my PhD program all I do is work and on the weekends I usually sleep or go out somewhere just to try to enjoy myself. Now that the semester has begun I lost my Sundays to a full day of class work. I am so lucky to do what I love, but I love it a lot less when I am being overworked. It does not help that my PI is an absolute workaholic. How do people not burn out working 6 days a week with such mentally involved tasks?",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hello! It's great to have you here. What's been on your mind lately that you'd like to talk about?",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "I've been feeling pretty overwhelmed with my PhD program lately. It's like there's no time for anything but work, and it's starting to wear me down.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client's story and feelings about being overwhelmed by their PhD program have been expressed in detail, including their past experiences and current struggles. Empathy has been built, and the root of the concern is clear. It is appropriate to move to the next phase to focus on motivation and change.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "It sounds like your PhD program is really consuming a lot of your energy and time. How do you feel this is affecting other areas of your life right now?",
      "phase": "guiding"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "Honestly, it's like everything else is taking a backseat. I'm not spending as much time on things that used to make me happy or relaxed, and it's frustrating.",
      "phase": "guiding"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a clear concern about feeling overwhelmed and a lack of balance between work and personal life, but specific change goals or strategies for addressing this have not yet been established. More exploration is needed to evoke Change Talk and clarify goals.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "It seems like you're really missing those activities that used to bring you joy and relaxation. What do you think life would look like if you managed to find a better balance between your work and those other areas?",
      "phase": "guiding"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "I think I'd feel a lot more like myself again, you know? I'd have more energy, more joy, and probably be a lot less stressed if I could fit in time for the things I enjoy.",
      "phase": "guiding"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has clearly expressed the impact of their PhD workload on their life and the desire for change. Discrepancy between behavior and values has been evoked, and the client has described a vision of life with change. However, specific change goals or increased confidence haven't been explicitly addressed yet.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "That sounds like a wonderful vision of balance and fulfillment. On a scale from 0 to 10, how confident do you feel about making some changes to achieve that sense of self again?",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "I’d say maybe a 5 or 6? It feels like there’s room to make changes, but I’m not entirely sure where to start or how to manage everything without slipping up.",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a vision of life with better work-life balance and acknowledged a discrepancy between current stress and desired joy. Change Talk is present, with a confidence level of 5-6. However, uncertainty about how to start suggests more guidance is needed on specific steps.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It's great that you see some potential for change, even if the path isn't entirely clear yet. What small steps do you think could move you closer to that balance and fulfillment you're envisioning?",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "I guess maybe setting some boundaries with my work time would be a start, like making sure I have a cut-off time in the evening. Also, trying to bring back some activities I used to enjoy, even if it's just a little bit each week, might help too.",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a strong desire for change and identified specific steps like setting work boundaries and reintroducing enjoyable activities. Confidence is around 5-6, showing moderate readiness. Discrepancy between current life and desired balance is clear, with change talk present. However, confidence could be reinforced further before moving to planning.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "Those sound like thoughtful and manageable steps. How do you imagine your life might change if you started setting those boundaries and reintroducing activities you love?",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "I think I'd feel a lot more like myself again, you know? I'd have more energy, more joy, and probably be a lot less stressed if I could fit in time for the things I enjoy.",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has articulated a clear discrepancy between their values (balance, joy, energy) and current behavior (overwhelmed and overworked). They have expressed change talk and identified potential steps (setting boundaries and reintroducing activities). The confidence level is tentative but within a range (5-6) that allows for action planning. Ambivalence appears addressed with a focus on small steps.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "It sounds like setting boundaries and reintroducing enjoyable activities could really enhance your well-being. Based on what you’ve shared, possible options could include setting a specific evening cut-off time for work or choosing one activity to reintroduce into your routine each week. What goal would you like to set, and what first step do you feel ready to take?",
      "phase": "choosing"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "I think setting a specific cut-off time for work would be a good place to start. Maybe I’ll aim to stop working by 7 PM every night and see how that goes.",
      "phase": "choosing"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has set a clear goal of establishing a work cut-off time and has identified an initial action step. However, there is no discussion yet of potential barriers or self-monitoring strategies. The client’s confidence level is moderate, suggesting room for further exploration and support.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "That sounds like a great first step towards creating more balance. How do you plan to ensure you stick to the 7 PM cut-off time, and what might you do if you encounter challenges sticking to this goal?",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "I guess I'll try setting an alarm or reminder on my phone as a prompt to stop work. If I run into challenges, like feeling the need to finish something urgent, I might need to prioritize tasks better or adjust my schedule for the next day.",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has clearly identified a goal - to stop work by 7 PM - and has a concrete action plan to set phone reminders. They have discussed potential barriers, such as urgent tasks, and strategies to address them, like prioritizing tasks. The client shows confidence in taking steps towards change and is aware of the necessary actions to restore balance.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "You've really thought this through, and your plan to set a 7 PM work cut-off time with phone reminders sounds like a solid step towards finding balance. Prioritizing tasks and being flexible with your schedule can be a great way to handle any unexpected challenges. It's encouraging to hear you're open to adjusting things if needed. Remember, it's about progress, not perfection. As you move forward, be kind to yourself and celebrate the small wins. If you find yourself needing extra support, feel free to reach out. You've got a thoughtful plan, and I believe in your ability to make these changes. Looking forward to hearing how it's going for you.",
      "phase": "terminating"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "Thanks, I appreciate your support and advice. I’ll definitely keep you posted on how it's going.",
      "phase": "terminating"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has identified specific steps to improve work-life balance, such as setting a work cut-off time, and discussed strategies to overcome challenges. A next-step plan is in place, indicating readiness to conclude.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hello! It's great to have you here. What's been on your mind lately that you'd like to talk about?\nclient: I've been feeling pretty overwhelmed with my PhD program lately. It's like there's no time for anything but work, and it's starting to wear me down.\ntherapist: It sounds like your PhD program is really consuming a lot of your energy and time. How do you feel this is affecting other areas of your life right now?\nclient: Honestly, it's like everything else is taking a backseat. I'm not spending as much time on things that used to make me happy or relaxed, and it's frustrating.\ntherapist: It seems like you're really missing those activities that used to bring you joy and relaxation. What do you think life would look like if you managed to find a better balance between your work and those other areas?\nclient: I think I'd feel a lot more like myself again, you know? I'd have more energy, more joy, and probably be a lot less stressed if I could fit in time for the things I enjoy.\ntherapist: That sounds like a wonderful vision of balance and fulfillment. On a scale from 0 to 10, how confident do you feel about making some changes to achieve that sense of self again?\nclient: I’d say maybe a 5 or 6? It feels like there’s room to make changes, but I’m not entirely sure where to start or how to manage everything without slipping up.\ntherapist: It's great that you see some potential for change, even if the path isn't entirely clear yet. What small steps do you think could move you closer to that balance and fulfillment you're envisioning?\nclient: I guess maybe setting some boundaries with my work time would be a start, like making sure I have a cut-off time in the evening. Also, trying to bring back some activities I used to enjoy, even if it's just a little bit each week, might help too.\ntherapist: Those sound like thoughtful and manageable steps. How do you imagine your life might change if you started setting those boundaries and reintroducing activities you love?\nclient: I think I'd feel a lot more like myself again, you know? I'd have more energy, more joy, and probably be a lot less stressed if I could fit in time for the things I enjoy.\ntherapist: It sounds like setting boundaries and reintroducing enjoyable activities could really enhance your well-being. Based on what you’ve shared, possible options could include setting a specific evening cut-off time for work or choosing one activity to reintroduce into your routine each week. What goal would you like to set, and what first step do you feel ready to take?\nclient: I think setting a specific cut-off time for work would be a good place to start. Maybe I’ll aim to stop working by 7 PM every night and see how that goes.\ntherapist: That sounds like a great first step towards creating more balance. How do you plan to ensure you stick to the 7 PM cut-off time, and what might you do if you encounter challenges sticking to this goal?\nclient: I guess I'll try setting an alarm or reminder on my phone as a prompt to stop work. If I run into challenges, like feeling the need to finish something urgent, I might need to prioritize tasks better or adjust my schedule for the next day.\ntherapist: You've really thought this through, and your plan to set a 7 PM work cut-off time with phone reminders sounds like a solid step towards finding balance. Prioritizing tasks and being flexible with your schedule can be a great way to handle any unexpected challenges. It's encouraging to hear you're open to adjusting things if needed. Remember, it's about progress, not perfection. As you move forward, be kind to yourself and celebrate the small wins. If you find yourself needing extra support, feel free to reach out. You've got a thoughtful plan, and I believe in your ability to make these changes. Looking forward to hearing how it's going for you.\nclient: Thanks, I appreciate your support and advice. I’ll definitely keep you posted on how it's going.",
  "completed": false
}