{
  "id": "10hyi0s",
  "timestamp": 1674259200000,
  "category": "emotional",
  "concern": "I just got a PSM degree and I ended up getting a good job so I can’t complain too much. But does anyone else feel a little embarrassed that they have a PSM vs an MS? If someone asks, I usually just say Masters and don’t get into it. But if someone asks for more detail I tell them its a PSM not an MS and they seem to get confused on what it is and just nod. Lol.\n\nAlso, does it seem to anyone else that most employers don’t know the difference between the two degrees? Do you put “Professional Science Masters” on your resume of just “Masters of xx”? \n\nPart of me is insecure because my undergrad is in a social science and my grad STEM. So I feel like an imposter at my job. Part of me wishes I just got an MS…..",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hey there, I'm really glad you're here. I'm here to listen and support you without judgment, so feel free to share whatever's on your mind.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Thanks for being here. I’m just feeling a bit off about my degree and how it’s perceived, you know?",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is in its early stages, with only one turn. The client has shared their primary concern about their degree and feelings of insecurity. However, more exploration is needed to fully understand the essence of their story and establish rapport.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "It sounds like you're feeling a bit uncertain about your degree, and that's completely understandable. I'm here to listen and help you work through those feelings, if you'd like to share more about what's been on your mind.",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "**Client (to therapist's questions about PSM vs. MS and employer perception):** I’m just worried that people don’t really get what my degree is, and I feel kinda awkward explaining it. It’s like, I’m not sure if it carries the same weight or respect as other degrees.\n\n**Continuing the conversation as the client:** Yeah, I mean, I worked super hard for it, but I can’t shake this feeling that maybe it’s not seen as legit by some folks. Like, I’m in this STEM job now, which is awesome, but coming from a totally different undergrad background, I keep thinking, do I even belong here? Sometimes I wonder if I should’ve just pushed for a different kind of master’s, you know, something more traditional. Have you seen other people deal with this kind of doubt about their qualifications or whatever?",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has had only two turns, and the client is still sharing the essence of their concerns about perceptions of their degree. More exploration is needed to fully understand their thoughts and feelings and to build rapport before moving to the Guiding phase. \",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "Yeah, I can imagine how disheartening it must feel to doubt your qualifications after all your hard work. It's not uncommon for people to question their choices, especially when navigating new or unfamiliar environments. I'm curious, what are some of the specific concerns that make you feel like your degree isn't seen as legitimate?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "**Client (responding as the client):** Thanks for getting that. I guess I’m just worried that when people hear it’s a PSM and not a traditional MS, they might think it’s less rigorous or something, even though I know I learned a ton of practical skills. Like, I’ve had moments where I’m explaining it to colleagues or at networking stuff, and I can tell they’re kinda confused or don’t know what to make of it. Also, since my undergrad wasn’t in STEM, I feel like I’m always playing catch-up, and I’m scared someone’s gonna call me out for not having the “right” background. Do you think that’s just in my head, or is there a real chance people are judging me for this?",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has met the goals of the Exploring phase by eliciting the essence of the client's story, including their thoughts and relevant context. Empathy and rapport appear to be established, and some mutually agreed goals are emerging. The conversation has reached the minimum of 3 turns. Therefore, it's appropriate to transition to the Guiding phase.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It’s understandable to feel like your degree might not be perceived as traditional or rigorous, but remember that your PSM has given you practical skills that are valuable in the real world. It’s also natural to feel like you’re playing catch-up when your background is different, but that doesn’t mean you don’t belong. You’ve worked hard to be where you are, and your unique perspective can be a strength in a STEM job. As for people judging you, it’s hard to say, but I’d encourage you to focus on your own confidence and self-worth, rather than what others might think.",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "**Client (responding as the client):** Thanks for saying that, it helps to hear I’m not totally off base for feeling this way. I guess I just gotta keep reminding myself that I earned this spot, even if my path looks different, you know? I do think my mix of backgrounds gives me a unique angle sometimes, but it’s hard to feel confident when I’m still second-guessing myself. What do you think I can do to kinda build up that confidence and stop worrying so much about how others see my degree?",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed feelings of doubt and insecurity regarding their degree, and there is some acknowledgment of their unique perspective. However, we have only seen one turn in the guiding phase. Exploration of discrepancy, confidence, and specific goals or steps has not been fully addressed yet.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It sounds like you're already taking steps in the right direction by acknowledging your unique strengths and recognizing that your hard work has earned you your place in this STEM job. Perhaps we can explore ways to reframe your thoughts about your degree, focusing on the practical skills and real-world value it brings to your work. It might also be helpful to practice assertive responses when explaining your degree to others, so you can feel more confident in your ability to communicate its value.",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "**Client (responding as the client):** Yeah, that makes a lot of sense. I like the idea of reframing how I think about my degree—focusing on what I bring to the table instead of what I think I’m missing. Practicing how to talk about it could help too, ‘cause I always stumble over my words when someone asks. Do you have any tips on how to explain it in a way that sounds strong and not like I’m making excuses? And maybe some ways to kinda quiet that voice in my head that keeps doubting me?",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has explored the discrepancy between the client's perception of their degree and their career goals, and the client has expressed a desire to change their self-perception. Change Talk is present, with some specific ideas for next steps. However, we're only 2 turns into the Guiding phase, which suggests we should continue to ensure all guiding goals are met before moving to Choosing.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "You're already showing great self-awareness by recognizing the need to shift your focus towards your strengths and practical skills. One approach could be to prepare a concise, confident response that highlights the unique aspects of your PSM degree, such as its emphasis on real-world application or the specific skills you've gained. As for quieting that doubting voice, try to acknowledge it without letting it take over—remind yourself of your hard work and accomplishments, and focus on how your diverse background brings a valuable perspective to your work.",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "**Client (responding as the client):** Thanks, that’s really helpful. I think having a go-to line about my PSM being focused on practical, hands-on skills could make me sound more sure of myself. And yeah, I need to keep reminding myself of what I’ve done instead of what I think I lack—it’s just tough sometimes when that doubt creeps in. How do you suggest I start building that habit of focusing on the positive stuff, especially on days when I’m feeling like a total fraud?",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed doubts and insecurities but also acknowledged their strengths. Change talk is present, such as the desire to reframe thoughts and develop confident responses. The therapist has helped explore discrepancies and supported the client's self-awareness. Since three turns are completed and the client displays readiness signals, it's appropriate to move to the Choosing phase to develop strategies and action plans.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "To help you build that habit of focusing on the positive, let's start by creating a personalized affirmation that highlights your strengths and accomplishments. This could be something like, \"\"I earned my PSM through hard work and determination, and my unique blend of skills and experiences brings value to my work.\"\" Repeating this affirmation to yourself, especially on days when you're feeling doubtful, can help to counteract those negative thoughts. Another approach could be to keep a \"\"success journal\"\" where you write down one thing you accomplished each day, no matter how small. Over time, this can help you build a mindset that focuses on your strengths and achievements, rather than your perceived shortcomings.",
      "phase": "choosing"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "**Client (responding as the client):** Hey, I really like the idea of the affirmation thing—it feels kinda cheesy at first, but I can see how repeating something positive could stick with me over time. And the success journal sounds cool too, like a way to actually see proof of what I’m doing right instead of just dwelling on the negatives. I think I’ll start with jotting down even little wins, like solving a problem at work or getting through a tough meeting. Do you think it’s okay if some days I can’t think of anything big to write down, or should I push myself to find something no matter what? Also, how long do you think it takes before this kinda stuff starts to really change how I feel about myself?",
      "phase": "choosing"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client and therapist are in the Choosing phase, having collaboratively developed an action plan with affirmations and a success journal. The client shows readiness signals, accepting and engaging with the proposed action plan. However, since there has only been one turn in the current phase, it is too soon to consider moving to termination.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "That's great to hear that you're open to trying these strategies! It's perfectly fine if some days you can't think of anything big to write down in your success journal—the important thing is to be consistent and recognize that even small accomplishments are worth acknowledging. Over time, you may find that you're able to identify more of these moments, and they can become a valuable source of encouragement. As for how long it takes to see a change in how you feel about yourself, everyone is different, but many people start to notice a shift within a few weeks of practicing affirmations and keeping a success journal. The key is to be patient and persistent, as developing a more positive mindset is a process that takes time and practice.",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "**Client (responding as the client):** Cool, I’m glad it’s okay to just write down the small stuff on those off days—takes some pressure off. I’ll stick with it and see how it feels after a few weeks, even if it’s a bit weird at first. Patience isn’t really my strong suit, though, so do you have any tricks to keep me motivated to keep up with the journal and affirmations when I’m tempted to just skip them? And like, what should I do if I start feeling like it’s not working after a while?",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has a clear action plan involving affirmations and a success journal to build confidence about their degree. They have discussed barriers like self-doubt, with strategies to address them. They express commitment and are taking steps towards change. The conversation is not stuck in circles, so advancement is appropriate.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "client",
      "statement": "Hey, I’m really glad to hear you’re willing to give it a shot, even if it feels a bit off at first. To keep yourself motivated with the journal and affirmations, maybe try setting a quick daily reminder on your phone or pairing it with something you already do, like having your morning coffee—make it part of a routine. Also, if you start feeling like it’s not working after a while, could we check in about it, or do you have any other ideas for tweaking things to keep it fresh? I just wanna make sure I don’t give up too soon, ya know?",
      "phase": "terminating"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "{{\n\"reasoning\": \"The conversation has reached a natural stopping point with the client expressing understanding and willingness to implement suggested strategies. A summary of goals and coping strategies was discussed, meeting termination goals.\",\n\"determination\": \"stop\"\n}}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hey there, I'm really glad you're here. I'm here to listen and support you without judgment, so feel free to share whatever's on your mind.\nclient: Thanks for being here. I’m just feeling a bit off about my degree and how it’s perceived, you know?\ntherapist: It sounds like you're feeling a bit uncertain about your degree, and that's completely understandable. I'm here to listen and help you work through those feelings, if you'd like to share more about what's been on your mind.\nclient: **Client (to therapist's questions about PSM vs. MS and employer perception):** I’m just worried that people don’t really get what my degree is, and I feel kinda awkward explaining it. It’s like, I’m not sure if it carries the same weight or respect as other degrees.\n\n**Continuing the conversation as the client:** Yeah, I mean, I worked super hard for it, but I can’t shake this feeling that maybe it’s not seen as legit by some folks. Like, I’m in this STEM job now, which is awesome, but coming from a totally different undergrad background, I keep thinking, do I even belong here? Sometimes I wonder if I should’ve just pushed for a different kind of master’s, you know, something more traditional. Have you seen other people deal with this kind of doubt about their qualifications or whatever?\ntherapist: Yeah, I can imagine how disheartening it must feel to doubt your qualifications after all your hard work. It's not uncommon for people to question their choices, especially when navigating new or unfamiliar environments. I'm curious, what are some of the specific concerns that make you feel like your degree isn't seen as legitimate?\nclient: **Client (responding as the client):** Thanks for getting that. I guess I’m just worried that when people hear it’s a PSM and not a traditional MS, they might think it’s less rigorous or something, even though I know I learned a ton of practical skills. Like, I’ve had moments where I’m explaining it to colleagues or at networking stuff, and I can tell they’re kinda confused or don’t know what to make of it. Also, since my undergrad wasn’t in STEM, I feel like I’m always playing catch-up, and I’m scared someone’s gonna call me out for not having the “right” background. Do you think that’s just in my head, or is there a real chance people are judging me for this?\ntherapist: It’s understandable to feel like your degree might not be perceived as traditional or rigorous, but remember that your PSM has given you practical skills that are valuable in the real world. It’s also natural to feel like you’re playing catch-up when your background is different, but that doesn’t mean you don’t belong. You’ve worked hard to be where you are, and your unique perspective can be a strength in a STEM job. As for people judging you, it’s hard to say, but I’d encourage you to focus on your own confidence and self-worth, rather than what others might think.\nclient: **Client (responding as the client):** Thanks for saying that, it helps to hear I’m not totally off base for feeling this way. I guess I just gotta keep reminding myself that I earned this spot, even if my path looks different, you know? I do think my mix of backgrounds gives me a unique angle sometimes, but it’s hard to feel confident when I’m still second-guessing myself. What do you think I can do to kinda build up that confidence and stop worrying so much about how others see my degree?\ntherapist: It sounds like you're already taking steps in the right direction by acknowledging your unique strengths and recognizing that your hard work has earned you your place in this STEM job. Perhaps we can explore ways to reframe your thoughts about your degree, focusing on the practical skills and real-world value it brings to your work. It might also be helpful to practice assertive responses when explaining your degree to others, so you can feel more confident in your ability to communicate its value.\nclient: **Client (responding as the client):** Yeah, that makes a lot of sense. I like the idea of reframing how I think about my degree—focusing on what I bring to the table instead of what I think I’m missing. Practicing how to talk about it could help too, ‘cause I always stumble over my words when someone asks. Do you have any tips on how to explain it in a way that sounds strong and not like I’m making excuses? And maybe some ways to kinda quiet that voice in my head that keeps doubting me?\ntherapist: You're already showing great self-awareness by recognizing the need to shift your focus towards your strengths and practical skills. One approach could be to prepare a concise, confident response that highlights the unique aspects of your PSM degree, such as its emphasis on real-world application or the specific skills you've gained. As for quieting that doubting voice, try to acknowledge it without letting it take over—remind yourself of your hard work and accomplishments, and focus on how your diverse background brings a valuable perspective to your work.\nclient: **Client (responding as the client):** Thanks, that’s really helpful. I think having a go-to line about my PSM being focused on practical, hands-on skills could make me sound more sure of myself. And yeah, I need to keep reminding myself of what I’ve done instead of what I think I lack—it’s just tough sometimes when that doubt creeps in. How do you suggest I start building that habit of focusing on the positive stuff, especially on days when I’m feeling like a total fraud?\ntherapist: To help you build that habit of focusing on the positive, let's start by creating a personalized affirmation that highlights your strengths and accomplishments. This could be something like, \"\"I earned my PSM through hard work and determination, and my unique blend of skills and experiences brings value to my work.\"\" Repeating this affirmation to yourself, especially on days when you're feeling doubtful, can help to counteract those negative thoughts. Another approach could be to keep a \"\"success journal\"\" where you write down one thing you accomplished each day, no matter how small. Over time, this can help you build a mindset that focuses on your strengths and achievements, rather than your perceived shortcomings.\nclient: **Client (responding as the client):** Hey, I really like the idea of the affirmation thing—it feels kinda cheesy at first, but I can see how repeating something positive could stick with me over time. And the success journal sounds cool too, like a way to actually see proof of what I’m doing right instead of just dwelling on the negatives. I think I’ll start with jotting down even little wins, like solving a problem at work or getting through a tough meeting. Do you think it’s okay if some days I can’t think of anything big to write down, or should I push myself to find something no matter what? Also, how long do you think it takes before this kinda stuff starts to really change how I feel about myself?\ntherapist: That's great to hear that you're open to trying these strategies! It's perfectly fine if some days you can't think of anything big to write down in your success journal—the important thing is to be consistent and recognize that even small accomplishments are worth acknowledging. Over time, you may find that you're able to identify more of these moments, and they can become a valuable source of encouragement. As for how long it takes to see a change in how you feel about yourself, everyone is different, but many people start to notice a shift within a few weeks of practicing affirmations and keeping a success journal. The key is to be patient and persistent, as developing a more positive mindset is a process that takes time and practice.\nclient: **Client (responding as the client):** Cool, I’m glad it’s okay to just write down the small stuff on those off days—takes some pressure off. I’ll stick with it and see how it feels after a few weeks, even if it’s a bit weird at first. Patience isn’t really my strong suit, though, so do you have any tricks to keep me motivated to keep up with the journal and affirmations when I’m tempted to just skip them? And like, what should I do if I start feeling like it’s not working after a while?\nclient: Hey, I’m really glad to hear you’re willing to give it a shot, even if it feels a bit off at first. To keep yourself motivated with the journal and affirmations, maybe try setting a quick daily reminder on your phone or pairing it with something you already do, like having your morning coffee—make it part of a routine. Also, if you start feeling like it’s not working after a while, could we check in about it, or do you have any other ideas for tweaking things to keep it fresh? I just wanna make sure I don’t give up too soon, ya know?",
  "completed": true
}