{
  "id": "wwd3sq",
  "timestamp": 1661299200000,
  "category": "emotional",
  "concern": "I’m 25, and will be graduating this year (my last term this fall). I will be 26 by then.\n\nI dropped out of uni. Immigrated as a student when I was 20. Worked a few part time jobs and took a few summer off to work and did a few internships, just to get myself through college.\n\nI feel beyond shit for being way too behind everyone I know. People in my uni are mostly around 18-21 and I just feel embarrassed sometime. I mean, I know “it’s not a race” but I get severe axiety sometime just to think about it.\n\nAnyone graduated in their mid-late 20s, how did you get over overthinking and how is life going?",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hello there! I'm so glad you've decided to join me today. Please, take your time and share with me whatever's been on your mind. Whether it's a specific concern or just a general feeling, I'm here to listen and support you in any way I can.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Hey, thanks for having me. I’ve just been feeling really overwhelmed lately with graduating later than most people I know, and it’s messing with my head a bit.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has only had one turn. The client's concern and context need further exploration to build rapport and fully understand their perspective and emotions before moving to the guiding phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "I'm sorry to hear that. It sounds like you've been feeling really stuck lately. Can you tell me a bit more about how this has been affecting you?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "Yeah, it’s just this constant weight, you know, like I’m always comparing myself to others who seem so much further ahead. It makes me anxious and kinda embarrassed, especially being around younger students who are on a different timeline.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is still in the early stages with only 2 turns. The client has shared their concern about feeling overwhelmed and anxious about graduating later than peers, but more exploration of their thoughts and feelings is needed to build rapport and fully understand their context.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "I can imagine how tough that must be, feeling like you're always looking over your shoulder and comparing yourself to others. It sounds like you're carrying around a lot of pressure and maybe even some shame. Can you tell me more about what it's like to feel embarrassed around younger students?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "client: Yeah, it’s like I stick out, you know, being older and still figuring stuff out while they’re just breezing through on the “normal” track. I keep thinking they’re judging me or wondering why I’m still here, even though I know that’s probably just in my head.",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shared the essence of their story, including feelings of being overwhelmed, anxious, and embarrassed about graduating later than peers. There's rapport and empathy, and the conversation has touched on mutual understanding of the client's struggles. The goals of the Exploring phase have been largely met.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It sounds like you're holding yourself to a pretty high standard and feeling like you don't quite measure up. It's interesting that you mention this being in your head, because that makes me wonder what it would be like if you could start being a little kinder to yourself.",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "Yeah, I get that, but being kinder to myself feels so hard when I’m constantly reminded I’m not where I “should” be. I just wish I could stop obsessing over the age thing and focus on what I’ve actually done to get here.\n\nSo, like, how do I even start to shift my thinking on this? I mean, I know I’ve worked hard, but it’s tough to feel proud when I keep seeing everyone else moving faster.",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is in the early stages of the Guiding phase. The therapist has begun to explore the client's feelings and perceptions but has not yet met the goals of fully exploring discrepancies or evoking change talk. It's important to continue guiding for more insight and motivation before moving to the Choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "It's really brave of you to be open about how tough this has been. It sounds like you're carrying a lot of self-doubt, but I'm curious—have you ever stopped to think about what your life might look like if you were able to shift your focus from comparison to your own progress? Maybe we could explore what that could feel like for you.",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Honestly, I haven’t really thought about it that way, like focusing just on my own stuff without the constant comparison. It sounds nice, but I’m not even sure where to begin with that—can we maybe break it down or something?",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation goals of the Guiding phase have largely been met—discrepancy between the client's values and behavior is evident; the client is considering life without constant comparison, indicating Change Talk. The client is showing readiness to explore next steps, asking to break down strategies for a mindset shift. As the current phase has only 2 turns, continue to explore and strengthen the client's motivation before moving to Choosing.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "Let's take a moment to imagine that life without the constant comparison. How might it feel to focus on your own progress and celebrate your hard work? Perhaps we can start by exploring the values and strengths that brought you to this point, and how those can guide your journey forward.",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "client: That sounds kinda relieving, honestly, to just think about my own path without the weight of everyone else’s timeline. Can we, like, dig into how I can actually start seeing my hard work as something to be proud of, instead of just a reminder of how long it took?",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is in the guiding phase and has only had 3 turns. The client is starting to explore life without constant comparison and showing readiness to change, but the process of exploring values and strengths needs more time before moving to choosing action plans.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "That's a great place to start—let's explore those values and strengths that have gotten you to this point. Maybe we can look at some specific moments where your hard work paid off, even if it didn't look exactly how you imagined. What comes to mind when you think of a time when your efforts really made a difference, no matter how small?",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Hmm, I guess one thing that comes to mind is when I managed to land an internship a couple of years back, even though I had to hustle like crazy to balance it with school and work. It felt like a small win at the time, but looking back, I’m kinda proud I pulled it off despite everything.",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n  \"reasoning\": \"The client has engaged in Change Talk, expressing a desire to focus on their own progress. They've acknowledged a specific past achievement, indicating some confidence. Ambivalence is decreasing and a next step is emerging: shifting focus from comparison to self-progress. The conversation is not stuck.\",\n  \"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "That's a great example, and it shows your resilience and determination. Let's build on that by exploring what steps you could take to continue celebrating your hard work and progress.",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "client: Yeah, I’d like that—focusing on those small wins could maybe help me feel less stuck on the timeline thing. How do we, like, keep that mindset going, especially when I’m around people who seem so much further ahead?",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client and therapist have begun exploring specific steps to shift focus from comparison to personal achievements, a sign of progress in the Choosing phase. However, they've only just started developing an action plan, and more discussion on barriers and self-monitoring is needed.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "That's a great question, and it's understandable that you'd feel that way. One possible approach could be to reflect on the progress you've made so far, and the steps you took to get there, whenever you're feeling discouraged by comparisons. You could also try sharing your successes with people who support you, and focus on the things you've accomplished rather than the timeline.",
      "phase": "choosing"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "client: That makes sense, like reminding myself of what I’ve actually done instead of just seeing where others are at. I guess I’m just worried that even with that, I’ll still feel outta place or like I’m playing catch-up, ya know?",
      "phase": "choosing"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client and therapist have collaboratively explored and developed a clear action plan. The client has expressed commitment to focusing on their own progress and strategies to counteract comparison. With only two turns in the Choosing phase, it is best to continue and ensure the client feels confident and supported in their plan.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "It’s understandable to feel that way, especially when surrounded by others who seem ahead. Maybe we can brainstorm some strategies that help you stay grounded in your own journey, like setting personal milestones or reminding yourself of how far you've come. What do you think?",
      "phase": "choosing"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "Yeah, I think that could help, like having my own goals to focus on instead of looking sideways all the time. I’m just not sure how to start setting those milestones without feeling overwhelmed, ya know?",
      "phase": "choosing"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has a clear goal of shifting focus to personal progress and an action plan involving setting personal milestones. Barriers like comparison and feeling out of place are discussed, with strategies like reflecting on progress and sharing successes. The client shows commitment to change by expressing a desire to focus on own achievements.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 20,
      "role": "client",
      "statement": "therapist, I appreciate the idea of personal milestones, and I’m definitely open to trying it. Could we maybe talk through how to break them down into something manageable so I don’t stress myself out even more?",
      "phase": "terminating"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client is actively engaged in exploring strategies to shift focus from comparison to personal progress. The session should continue to develop actionable steps for setting personal milestones and reinforcing positive thinking.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "terminating"
    },
    {
      "index": 21,
      "role": "client",
      "statement": "I'm glad you're open to working on this together. Can we maybe spend a few minutes figuring out a couple of small, doable goals to start with, just to get the ball rolling?",
      "phase": "terminating"
    },
    {
      "index": "al",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation indicates progress in identifying goals and strategies, but the client seeks further guidance on setting milestones. The session is not yet fully concluded with actionable next steps.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "terminating"
    },
    {
      "index": 22,
      "role": "client",
      "statement": "Yeah, I’d really like that. Let’s start with something small so I don’t feel like I’m taking on too much at once.",
      "phase": "terminating"
    },
    {
      "index": "am",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has identified steps for self-compassion and personal milestones. The therapist has helped outline coping strategies and next steps, meeting the termination goals.\",\n\"determination\": \"stop\"\n}\n```",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hello there! I'm so glad you've decided to join me today. Please, take your time and share with me whatever's been on your mind. Whether it's a specific concern or just a general feeling, I'm here to listen and support you in any way I can.\nclient: Hey, thanks for having me. I’ve just been feeling really overwhelmed lately with graduating later than most people I know, and it’s messing with my head a bit.\ntherapist: I'm sorry to hear that. It sounds like you've been feeling really stuck lately. Can you tell me a bit more about how this has been affecting you?\nclient: Yeah, it’s just this constant weight, you know, like I’m always comparing myself to others who seem so much further ahead. It makes me anxious and kinda embarrassed, especially being around younger students who are on a different timeline.\ntherapist: I can imagine how tough that must be, feeling like you're always looking over your shoulder and comparing yourself to others. It sounds like you're carrying around a lot of pressure and maybe even some shame. Can you tell me more about what it's like to feel embarrassed around younger students?\nclient: client: Yeah, it’s like I stick out, you know, being older and still figuring stuff out while they’re just breezing through on the “normal” track. I keep thinking they’re judging me or wondering why I’m still here, even though I know that’s probably just in my head.\ntherapist: It sounds like you're holding yourself to a pretty high standard and feeling like you don't quite measure up. It's interesting that you mention this being in your head, because that makes me wonder what it would be like if you could start being a little kinder to yourself.\nclient: Yeah, I get that, but being kinder to myself feels so hard when I’m constantly reminded I’m not where I “should” be. I just wish I could stop obsessing over the age thing and focus on what I’ve actually done to get here.\n\nSo, like, how do I even start to shift my thinking on this? I mean, I know I’ve worked hard, but it’s tough to feel proud when I keep seeing everyone else moving faster.\ntherapist: It's really brave of you to be open about how tough this has been. It sounds like you're carrying a lot of self-doubt, but I'm curious—have you ever stopped to think about what your life might look like if you were able to shift your focus from comparison to your own progress? Maybe we could explore what that could feel like for you.\nclient: Honestly, I haven’t really thought about it that way, like focusing just on my own stuff without the constant comparison. It sounds nice, but I’m not even sure where to begin with that—can we maybe break it down or something?\ntherapist: Let's take a moment to imagine that life without the constant comparison. How might it feel to focus on your own progress and celebrate your hard work? Perhaps we can start by exploring the values and strengths that brought you to this point, and how those can guide your journey forward.\nclient: client: That sounds kinda relieving, honestly, to just think about my own path without the weight of everyone else’s timeline. Can we, like, dig into how I can actually start seeing my hard work as something to be proud of, instead of just a reminder of how long it took?\ntherapist: That's a great place to start—let's explore those values and strengths that have gotten you to this point. Maybe we can look at some specific moments where your hard work paid off, even if it didn't look exactly how you imagined. What comes to mind when you think of a time when your efforts really made a difference, no matter how small?\nclient: Hmm, I guess one thing that comes to mind is when I managed to land an internship a couple of years back, even though I had to hustle like crazy to balance it with school and work. It felt like a small win at the time, but looking back, I’m kinda proud I pulled it off despite everything.\ntherapist: That's a great example, and it shows your resilience and determination. Let's build on that by exploring what steps you could take to continue celebrating your hard work and progress.\nclient: client: Yeah, I’d like that—focusing on those small wins could maybe help me feel less stuck on the timeline thing. How do we, like, keep that mindset going, especially when I’m around people who seem so much further ahead?\ntherapist: That's a great question, and it's understandable that you'd feel that way. One possible approach could be to reflect on the progress you've made so far, and the steps you took to get there, whenever you're feeling discouraged by comparisons. You could also try sharing your successes with people who support you, and focus on the things you've accomplished rather than the timeline.\nclient: client: That makes sense, like reminding myself of what I’ve actually done instead of just seeing where others are at. I guess I’m just worried that even with that, I’ll still feel outta place or like I’m playing catch-up, ya know?\ntherapist: It’s understandable to feel that way, especially when surrounded by others who seem ahead. Maybe we can brainstorm some strategies that help you stay grounded in your own journey, like setting personal milestones or reminding yourself of how far you've come. What do you think?\nclient: Yeah, I think that could help, like having my own goals to focus on instead of looking sideways all the time. I’m just not sure how to start setting those milestones without feeling overwhelmed, ya know?\nclient: therapist, I appreciate the idea of personal milestones, and I’m definitely open to trying it. Could we maybe talk through how to break them down into something manageable so I don’t stress myself out even more?\nclient: I'm glad you're open to working on this together. Can we maybe spend a few minutes figuring out a couple of small, doable goals to start with, just to get the ball rolling?\nclient: Yeah, I’d really like that. Let’s start with something small so I don’t feel like I’m taking on too much at once.",
  "completed": true
}