{
  "id": "x1svam",
  "timestamp": 1661817600000,
  "category": "interpersonal",
  "concern": "Hi everyone, \n\nIt's my first time posting here. \n\nI'm going into the third year of my PhD in a few weeks. I've been struggling with a pretty bad depression over the last couple of months and it's partially due to the loneliness and isolation that comes along with doctoral work/endlessly working by myself day in and day out. I've started to lose motivation and struggling with feelings of sadness most days. \n\nDoes anyone have any tips, coping strategies or advice for how to work through this? \n\n&amp;#x200B;\n\nThanks to anyone who takes the time to reach out!",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Hey there, I'm so glad you're here. I want you to feel completely comfortable sharing whatever is on your mind, so please take your time and know that this is a safe and non-judgmental space. What's been going on lately that's been weighing on you?",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Hey, thanks for being so welcoming. I’ve just been feeling really down and isolated with my PhD work, and it’s been hard to shake off the sadness most days.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation so far includes only one turn. The therapist has initiated rapport, and the client has shared their concern. However, more exploration is needed to fully understand the client's thoughts and context.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "I can see how challenging that must be, feeling alone in such a significant part of your life. It sounds like the weight of your PhD work has been really overwhelming lately, and it’s important to acknowledge that. Can you tell me more about what’s been making it so hard to shake off the sadness?",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "Yeah, it’s just been tough to keep going when I’m always by myself, grinding through research with no one to really connect with. I guess I feel like I’m losing sight of why I even started this, and that just makes the sadness stick around more.",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is still in the early stages with only 2 turns. The therapist has started to understand the client's feelings of isolation and lack of motivation with their PhD work. More exploration is needed to fully grasp the client's situation and thoughts.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "That sounds really isolating, and it's understandable that you're struggling with the loss of purpose when you're feeling so disconnected from your work. It's important to remember that it's okay to feel this way, and that you don't have to face this alone. Can you tell me more about what initially drew you to pursue a PhD, and how that feeling of purpose might have shifted over time?",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "Hey, yeah, I started my PhD because I was super passionate about my field and wanted to make a real impact through my research. But now, it just feels like I’m stuck in this endless cycle of work with no real connection to that original excitement, and I’m not sure how to get it back.",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has included three turns, successfully eliciting the essence of the client's story, thoughts, and context. The therapist has shown empathy and understanding, and there is a mutual understanding of the client's struggle and goals. Enough rapport has been built to move to the Guiding phase.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It's clear that your initial passion for your field was a driving force, and it's understandable that you're feeling disconnected from that excitement now. Perhaps reflecting on the values that initially drew you to your research could help you reconnect with your purpose. On a scale of 0 to 10, how confident do you feel in your ability to rekindle that sense of purpose?",
      "phase": "guiding"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "Hey, I’d probably say like a 2 or 3 right now. It just feels so far away, and I’m not really sure where to even start with getting that spark back.",
      "phase": "guiding"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has just started exploring the client's disconnection from their PhD work and initial passion. Confidence is low, at 2 or 3, indicating the client is not yet ready for action planning. The session should continue to further explore feelings and evoke more Change Talk.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "That must be really disheartening, feeling like that spark is out of reach right now. It might be helpful to start by exploring what values or aspects of your research initially excited you—can you think of a moment or experience that really embodied that sense of purpose for you?",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "Hey, yeah, I remember this one time early on when I presented a small piece of my research at a conference and got some really great feedback—it felt like I was actually contributing something meaningful. Thinking about that now, though, it just seems so distant, like I’m not sure I can get back to feeling that way again.",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed low confidence (2-3) and significant disconnection from their initial purpose. Although the conversation is exploring values, there is no specific change goal or decrease in ambivalence yet. With only 2 turns, it's early in the Guiding phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "That moment at the conference must have been incredibly fulfilling, and it's clear that it represented a time when you felt truly connected to your work. It's understandable that you're feeling uncertain about recapturing that sense of purpose now, but perhaps reflecting on what made that experience so meaningful could help you identify steps to move forward.",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "Hey, yeah, I think what made that moment so special was just feeling seen and valued for my ideas, like I was part of something bigger. I’m just not sure how to find that kind of validation or connection again with everything feeling so isolating right now.",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client is experiencing a strong sense of isolation and disconnection from their initial values and purpose. Although some Change Talk is present, their confidence is low (2 or 3), and no specific change goals have been identified. The session has only had 3 turns, so continuing in the Guiding phase is necessary to further explore and strengthen motivation.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "It sounds like that experience at the conference was a powerful reminder of the impact your work can have. Reflecting on the aspects of that moment that made it so meaningful could help you identify ways to reconnect with that sense of purpose and fulfillment.",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "Hey, yeah, I get that reflecting on that moment might help, but honestly, it’s hard to even imagine feeling that kind of connection again. I just feel so stuck in this isolation, like I’m not sure where to even look for that sense of impact anymore.",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client expressed feeling isolated and disconnected from the initial passion for their PhD. Confidence is low (2-3), and while some values and past positive experiences were explored, there is significant ambivalence about regaining motivation. The goals of the guiding phase are not fully met, and more exploration is needed to strengthen motivation before proceeding.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "It's understandable to feel overwhelmed by the isolation, but perhaps we could explore how you might begin to bridge that gap, even if just a little. What small steps could help you reconnect with the sense of impact that once felt so meaningful?",
      "phase": "guiding"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "Hey, I’m not really sure where to start with that, to be honest. Maybe reaching out to some peers or joining a study group or something could help, but even thinking about putting myself out there feels kinda draining right now.",
      "phase": "guiding"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client expresses low confidence (2-3) in re-finding purpose and shows ongoing ambivalence without clear change goals. Change Talk is present, but ambiguous. The client is exploring ideas but lacks a specific next step or increased confidence. Continue guiding to strengthen motivation and develop clear goals.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "It sounds like taking even small steps towards connection feels challenging, and it's important to acknowledge that. Perhaps we could focus on the potential benefits of reaching out, like sharing ideas and feeling supported. How do you think it might feel to have that kind of interaction again?",
      "phase": "guiding"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "Hey, I think it could feel kinda nice to have that interaction again, like a little boost or something. But I’m just worried I’ll feel even more out of place or like I don’t have much to contribute right now.",
      "phase": "guiding"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has been exploring potential action steps (e.g., reaching out to peers or joining a study group) and is starting to consider the benefits of these actions. However, their confidence remains low, and the client still expresses significant ambivalence and uncertainty. The goals of the Guiding phase have not been fully met, as change talk is weak and no specific change goals have been set.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "It's natural to have some concerns about stepping out of your comfort zone, but those worries don't have to stop you from exploring possibilities. Can you imagine how it might feel to share your thoughts and experiences with others, even if just a little, and discover that they resonate with someone else?",
      "phase": "guiding"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "Hey, yeah, I can kinda picture it feeling good to share stuff and maybe find that someone gets where I’m coming from. I just hope I don’t come off as too out of it or like I’m dragging the convo down, you know?",
      "phase": "guiding"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client is expressing ongoing ambivalence and uncertainty about their ability to reconnect with the initial passion for their PhD. The confidence level is low at 2-3, and while potential steps have been explored, the client remains unsure. Change Talk is present but not sufficiently strong to suggest readiness for moving to the Choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 20,
      "role": "therapist",
      "statement": "I hear you, it's really brave to share your fears about stepping out of your comfort zone. Remember, it's okay to start small and see how it feels. What if you focused on sharing just one idea or experience that you feel comfortable with, and then see how it goes from there?",
      "phase": "guiding"
    },
    {
      "index": 21,
      "role": "client",
      "statement": "Hey, yeah, I think starting with just one small thing could be doable, like mentioning a quick thought or something I’ve been working on. I’m still a bit nervous about how it’ll land, but I guess I won’t know until I try, right?",
      "phase": "guiding"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed ambivalence and low confidence, with no specific change steps defined. They are still exploring potential actions, showing readiness for further exploration but not yet choosing specific strategies. Additionally, the confidence level is below 6. Therefore, more guidance is needed before transitioning to the Choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 22,
      "role": "therapist",
      "statement": "That's a really brave and thoughtful approach, and it's great that you're considering taking that first step. Remember, it's okay to feel nervous, but sometimes taking that leap can lead to unexpected positive outcomes. How does it feel to think about taking that first step, even if it's just a small one?",
      "phase": "guiding"
    },
    {
      "index": 23,
      "role": "client",
      "statement": "Hey, it feels kinda scary but also a little exciting, you know, like I might actually get something out of it. I’m just trying to wrap my head around actually doing it without overthinking every little thing.",
      "phase": "guiding"
    },
    {
      "index": "al",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The guiding phase has explored the client's values and discrepancies between current feelings and original motivations. Change Talk has emerged with considerations of small steps like reaching out to peers. However, the client's confidence remains low, and ambivalence persists. Therefore, it's appropriate to continue in the guiding phase to strengthen confidence and resolve ambivalence before moving to choosing.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 24,
      "role": "therapist",
      "statement": "It's amazing how even small steps can lead to such a mix of emotions. The fact that you're able to feel both scared and excited about it shows that you're really tuning in to your inner voice. Can you think of a recent time when you've pushed through that nervousness, and how it felt afterward?",
      "phase": "guiding"
    },
    {
      "index": 25,
      "role": "client",
      "statement": "Hey, yeah, I can think of a time when I presented at a small seminar last semester, even though I was super nervous about it. I felt pretty relieved and kinda proud after, like I’d actually done something worthwhile, you know?",
      "phase": "guiding"
    },
    {
      "index": "am",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has expressed a specific change goal of reaching out and sharing ideas with peers, indicating a readiness to move forward. Confidence is low but there is a mix of fear and excitement about taking action. Change Talk includes steps towards reconnection with peers. The session has met guiding goals, including exploring life without change. We should advance to action planning.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 26,
      "role": "therapist",
      "statement": "That sounds like a really empowering experience, and it's great that you can look back and feel proud of yourself for pushing through those nerves. Building on that success, what if you drew on some of those same feelings of pride and relief to fuel your motivation as you prepare for your next step?",
      "phase": "choosing"
    },
    {
      "index": 27,
      "role": "client",
      "statement": "Hey, that’s a cool idea, using that past feeling to kinda boost myself now. I think remembering that relief and pride could help me push through the nerves for this next thing, you know?",
      "phase": "choosing"
    },
    {
      "index": "an",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client is in the early stages of developing an action plan, having acknowledged potential steps and expressed mixed emotions about moving forward. The current phase has just started with one turn focused on potential actions; more engagement is needed to solidify plans and address barriers.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 28,
      "role": "therapist",
      "statement": "That's a powerful connection to make, and it's great that you can tap into those positive emotions from your past experience. How do you think you might use that relief and pride as a source of motivation when you're feeling nervous about your next step?",
      "phase": "choosing"
    },
    {
      "index": 29,
      "role": "client",
      "statement": "Hey, I think I could remind myself of that seminar moment, like how good it felt to get through it, whenever I start doubting myself about this next step. Maybe just taking a sec to picture that relief could help me keep going, you know?",
      "phase": "choosing"
    },
    {
      "index": "ao",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The session has successfully reached a concrete action plan of taking small steps towards reconnection, like sharing ideas with peers. Barriers such as nervousness and self-doubt have been discussed, and the client has identified a self-monitoring strategy by recalling past successes for motivation. Given the readiness signals and only 2 turns, further steps in this phase could solidify their plan.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 30,
      "role": "therapist",
      "statement": "That's a great strategy! Visualizing that relief and pride can be a powerful motivator. When you picture that moment, do you think it could also help you focus on the specific actions you took to get through the seminar presentation, like maybe practicing beforehand or taking deep breaths before speaking?",
      "phase": "choosing"
    },
    {
      "index": 31,
      "role": "client",
      "statement": "Hey, yeah, I think picturing that moment could definitely remind me of the little things I did, like practicing a ton and just breathing to calm down before I started. It might help me focus on those steps again when I’m feeling stuck or nervous, you know?",
      "phase": "choosing"
    },
    {
      "index": "ap",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has identified a clear goal of reconnecting with their sense of purpose and developed a concrete action plan to share ideas in a social setting. They discussed potential barriers, such as nervousness and isolation, and agreed on self-monitoring strategies, like recalling past successes. Client demonstrates readiness through commitment and taking-steps talk.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 32,
      "role": "client",
      "statement": "therapist: I'm glad you can see how those small, actionable steps contributed to your success. How about setting aside a specific time this week to practice one of those strategies, like deep breathing or rehearsing, to build confidence for your next challenge?\n\nclient: Hey, that sounds like a solid plan. I’ll try to carve out some time this week to focus on that and get myself in a good headspace. So, before we wrap up, do you have any other quick tips for keeping that confidence up?",
      "phase": "terminating"
    },
    {
      "index": "aq",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The session covered a recap of past achievements, strategies to overcome current challenges, and a plan for next steps. The client shows readiness to apply these strategies, suggesting readiness for session closure.\",\n\"determination\": \"stop\"\n}\n```",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Hey there, I'm so glad you're here. I want you to feel completely comfortable sharing whatever is on your mind, so please take your time and know that this is a safe and non-judgmental space. What's been going on lately that's been weighing on you?\nclient: Hey, thanks for being so welcoming. I’ve just been feeling really down and isolated with my PhD work, and it’s been hard to shake off the sadness most days.\ntherapist: I can see how challenging that must be, feeling alone in such a significant part of your life. It sounds like the weight of your PhD work has been really overwhelming lately, and it’s important to acknowledge that. Can you tell me more about what’s been making it so hard to shake off the sadness?\nclient: Yeah, it’s just been tough to keep going when I’m always by myself, grinding through research with no one to really connect with. I guess I feel like I’m losing sight of why I even started this, and that just makes the sadness stick around more.\ntherapist: That sounds really isolating, and it's understandable that you're struggling with the loss of purpose when you're feeling so disconnected from your work. It's important to remember that it's okay to feel this way, and that you don't have to face this alone. Can you tell me more about what initially drew you to pursue a PhD, and how that feeling of purpose might have shifted over time?\nclient: Hey, yeah, I started my PhD because I was super passionate about my field and wanted to make a real impact through my research. But now, it just feels like I’m stuck in this endless cycle of work with no real connection to that original excitement, and I’m not sure how to get it back.\ntherapist: It's clear that your initial passion for your field was a driving force, and it's understandable that you're feeling disconnected from that excitement now. Perhaps reflecting on the values that initially drew you to your research could help you reconnect with your purpose. On a scale of 0 to 10, how confident do you feel in your ability to rekindle that sense of purpose?\nclient: Hey, I’d probably say like a 2 or 3 right now. It just feels so far away, and I’m not really sure where to even start with getting that spark back.\ntherapist: That must be really disheartening, feeling like that spark is out of reach right now. It might be helpful to start by exploring what values or aspects of your research initially excited you—can you think of a moment or experience that really embodied that sense of purpose for you?\nclient: Hey, yeah, I remember this one time early on when I presented a small piece of my research at a conference and got some really great feedback—it felt like I was actually contributing something meaningful. Thinking about that now, though, it just seems so distant, like I’m not sure I can get back to feeling that way again.\ntherapist: That moment at the conference must have been incredibly fulfilling, and it's clear that it represented a time when you felt truly connected to your work. It's understandable that you're feeling uncertain about recapturing that sense of purpose now, but perhaps reflecting on what made that experience so meaningful could help you identify steps to move forward.\nclient: Hey, yeah, I think what made that moment so special was just feeling seen and valued for my ideas, like I was part of something bigger. I’m just not sure how to find that kind of validation or connection again with everything feeling so isolating right now.\ntherapist: It sounds like that experience at the conference was a powerful reminder of the impact your work can have. Reflecting on the aspects of that moment that made it so meaningful could help you identify ways to reconnect with that sense of purpose and fulfillment.\nclient: Hey, yeah, I get that reflecting on that moment might help, but honestly, it’s hard to even imagine feeling that kind of connection again. I just feel so stuck in this isolation, like I’m not sure where to even look for that sense of impact anymore.\ntherapist: It's understandable to feel overwhelmed by the isolation, but perhaps we could explore how you might begin to bridge that gap, even if just a little. What small steps could help you reconnect with the sense of impact that once felt so meaningful?\nclient: Hey, I’m not really sure where to start with that, to be honest. Maybe reaching out to some peers or joining a study group or something could help, but even thinking about putting myself out there feels kinda draining right now.\ntherapist: It sounds like taking even small steps towards connection feels challenging, and it's important to acknowledge that. Perhaps we could focus on the potential benefits of reaching out, like sharing ideas and feeling supported. How do you think it might feel to have that kind of interaction again?\nclient: Hey, I think it could feel kinda nice to have that interaction again, like a little boost or something. But I’m just worried I’ll feel even more out of place or like I don’t have much to contribute right now.\ntherapist: It's natural to have some concerns about stepping out of your comfort zone, but those worries don't have to stop you from exploring possibilities. Can you imagine how it might feel to share your thoughts and experiences with others, even if just a little, and discover that they resonate with someone else?\nclient: Hey, yeah, I can kinda picture it feeling good to share stuff and maybe find that someone gets where I’m coming from. I just hope I don’t come off as too out of it or like I’m dragging the convo down, you know?\ntherapist: I hear you, it's really brave to share your fears about stepping out of your comfort zone. Remember, it's okay to start small and see how it feels. What if you focused on sharing just one idea or experience that you feel comfortable with, and then see how it goes from there?\nclient: Hey, yeah, I think starting with just one small thing could be doable, like mentioning a quick thought or something I’ve been working on. I’m still a bit nervous about how it’ll land, but I guess I won’t know until I try, right?\ntherapist: That's a really brave and thoughtful approach, and it's great that you're considering taking that first step. Remember, it's okay to feel nervous, but sometimes taking that leap can lead to unexpected positive outcomes. How does it feel to think about taking that first step, even if it's just a small one?\nclient: Hey, it feels kinda scary but also a little exciting, you know, like I might actually get something out of it. I’m just trying to wrap my head around actually doing it without overthinking every little thing.\ntherapist: It's amazing how even small steps can lead to such a mix of emotions. The fact that you're able to feel both scared and excited about it shows that you're really tuning in to your inner voice. Can you think of a recent time when you've pushed through that nervousness, and how it felt afterward?\nclient: Hey, yeah, I can think of a time when I presented at a small seminar last semester, even though I was super nervous about it. I felt pretty relieved and kinda proud after, like I’d actually done something worthwhile, you know?\ntherapist: That sounds like a really empowering experience, and it's great that you can look back and feel proud of yourself for pushing through those nerves. Building on that success, what if you drew on some of those same feelings of pride and relief to fuel your motivation as you prepare for your next step?\nclient: Hey, that’s a cool idea, using that past feeling to kinda boost myself now. I think remembering that relief and pride could help me push through the nerves for this next thing, you know?\ntherapist: That's a powerful connection to make, and it's great that you can tap into those positive emotions from your past experience. How do you think you might use that relief and pride as a source of motivation when you're feeling nervous about your next step?\nclient: Hey, I think I could remind myself of that seminar moment, like how good it felt to get through it, whenever I start doubting myself about this next step. Maybe just taking a sec to picture that relief could help me keep going, you know?\ntherapist: That's a great strategy! Visualizing that relief and pride can be a powerful motivator. When you picture that moment, do you think it could also help you focus on the specific actions you took to get through the seminar presentation, like maybe practicing beforehand or taking deep breaths before speaking?\nclient: Hey, yeah, I think picturing that moment could definitely remind me of the little things I did, like practicing a ton and just breathing to calm down before I started. It might help me focus on those steps again when I’m feeling stuck or nervous, you know?\nclient: therapist: I'm glad you can see how those small, actionable steps contributed to your success. How about setting aside a specific time this week to practice one of those strategies, like deep breathing or rehearsing, to build confidence for your next challenge?\n\nclient: Hey, that sounds like a solid plan. I’ll try to carve out some time this week to focus on that and get myself in a good headspace. So, before we wrap up, do you have any other quick tips for keeping that confidence up?",
  "completed": true
}