{
  "id": "znn21k",
  "timestamp": 1671148800000,
  "category": "school_life",
  "concern": " A blurb on my situation and why I’m asking this: I’m currently in my school’s business program (includes majors in finance, economics, info sys, marketing, etc) with the aim of graduating with a bachelors in management information systems, however calculus has been a major roadblock for me.   \nI barely passed precalculus at a cc the first time I took it, failed calculus at the cc, then had to retake precalculus due to credit issues when transferring but failed it this time, and now I’ll need to take calculus again at a cc, and I have little hope that I’ll pass. I have a deadline to pass that class this next semester and if I don’t I’ll be kicked from the business program and won’t have access to any of the above listed majors. Already the prospects of having a nice info sys job are starting to dim. The only major I can think of that will allow me to not take calculus and graduate in a reasonable time is interdisciplinary studies. My remaining classes until I graduate would be poli sci because why not, I think it’s an interesting subject and there’d be no point to taking my remaining business or finance or information systems classes if I can’t have that major at the end of it.  \n\n\n..  \n\n\nTl;dr I suck at calculus  \n\n\nSo basically what my two questions are: will I be stuck working minimum wage jobs with the degree in the title or is there some hope for a “normal” working-in-an-office job?  \nWhat are some jobs that are open to both business and political science majors (because I’m assuming that’s where I’d most likely be heading with this plan)?",
  "dialogue_total": [
    {
      "index": 0,
      "role": "therapist",
      "statement": "Welcome to our session today! I'm here to listen and support you. Please feel free to share whatever thoughts or concerns you have on your mind.",
      "phase": "exploring"
    },
    {
      "index": 1,
      "role": "client",
      "statement": "Thanks for being here to talk. I’m just really stressed about my situation with school and failing calculus, and I’m worried about what kind of future I’ll have if I can’t stay in the business program.\n\nTherapist: I can hear how much this is weighing on you, and it’s completely okay to feel stressed about this. Let’s explore your concerns about your future and see what options might be available to you.\n\nAssistant: Yeah, I appreciate that. I’m just kinda lost right now, ya know? Like, if I don’t pass calculus and get kicked outta the business program, I’m thinking of switching to interdisciplinary studies with a focus on poli sci, but I’m scared I’ll end up with no good job options. I just wanna know if there’s any hope for a decent office job or something, and maybe what kinda jobs could mix business and poli sci stuff together.",
      "phase": "exploring"
    },
    {
      "index": "aa",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is still in the early stages of the Exploring phase, with only one substantial exchange where the client has shared their concerns and context. More exploration is needed to fully understand the client's situation and build rapport.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 2,
      "role": "therapist",
      "statement": "That’s a really understandable fear, and it’s great that you’re thinking about potential paths. Let’s talk more about what you want in a job, and maybe explore some options that blend business and poli sci.",
      "phase": "exploring"
    },
    {
      "index": 3,
      "role": "client",
      "statement": "Cool, I’m glad to dive into that. Honestly, I just want something stable, like a 9-to-5 where I’m not stuck doing minimum wage stuff forever, ya know? I’m not super picky, but I’d love to use some of the business skills I’ve picked up, even if I can’t finish that major, and maybe tie in some of the poli sci interests I’ve got. What do you think could work for me with that mix?",
      "phase": "exploring"
    },
    {
      "index": "ab",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has only had two turns, which is below the minimum threshold for moving to the next phase. The client has shared their concerns and some context, but further exploration is needed to fully understand their thoughts and build rapport before guiding.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 4,
      "role": "therapist",
      "statement": "You're clearly passionate about combining your business and political science interests, and it's great that you're thinking about what kind of job would give you the stability and satisfaction you're looking for. Let's explore some options that could bring those two fields together, like working in public policy or government relations for a private company, or even a role in non-profit management that leverages your business skills while allowing you to engage with political issues.",
      "phase": "exploring"
    },
    {
      "index": 5,
      "role": "client",
      "statement": "Hey, that actually sounds kinda promising. I hadn’t really thought about stuff like public policy or government relations before, but I can see how my business background could fit in there, even if it’s not a full degree. Non-profit management sounds interesting too, ‘cause I like the idea of doing something meaningful. Do you think I’d need extra training or certs for those kinds of roles, or could I jump in with just a bachelor’s in interdisciplinary studies?",
      "phase": "exploring"
    },
    {
      "index": "ac",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has clearly articulated their situation, concerns, and potential pathways. The therapist has demonstrated understanding and empathy, and there is a mutual focus on exploring career options. However, the conversation has only had 3 turns and can benefit from further exploration of the client's feelings and goals before moving to guiding.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 6,
      "role": "therapist",
      "statement": "It sounds like you’re really open to exploring these options, and it’s great that you’re thinking about how to bridge your interests in business and political science. Let’s talk more about what you might need to get into these roles, and whether there are any additional certifications or training that could help you stand out in the job market.",
      "phase": "exploring"
    },
    {
      "index": 7,
      "role": "client",
      "statement": "Yeah, I’m definitely open to figuring this out. I just wanna know if a bachelor’s in interdisciplinary studies will be enough to get my foot in the door for something like public policy or non-profit work, or if I’m gonna need to go back for more classes or certs. Like, I’m already stressed about the time and money I’ve put into school, so adding more on top of that kinda freaks me out. What do you think—can I make it work with what I’ve got, or should I start looking into extra stuff now?",
      "phase": "exploring"
    },
    {
      "index": "ad",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation has met the goals of the Exploring phase. The client has shared their concerns, and the therapist has shown empathy and understanding while exploring the client's thoughts on potential career paths. They have discussed the client's interest in combining business and political science and considered future steps. This mutual understanding and rapport-building suggest readiness to move to the Guiding phase.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "exploring"
    },
    {
      "index": 8,
      "role": "therapist",
      "statement": "Your interdisciplinary studies degree is a great foundation, and you can definitely leverage your business and political science background to get into public policy or non-profit work. While additional certifications or training might give you an edge, it's not necessarily a requirement. Let's focus on your strengths and the skills you've developed so far, and we can explore options that align with your current degree.",
      "phase": "guiding"
    },
    {
      "index": 9,
      "role": "client",
      "statement": "**Client (me, continuing the conversation):** Hey, that’s reassuring to hear that my degree might be enough to start with. I’m just wondering, like, what specific skills or stuff I should focus on highlighting when I’m applying for jobs in public policy or non-profits, ya know? I’ve got some business coursework under my belt, and I’m taking poli sci classes now, but I’m not super confident about how to sell that to an employer. Got any tips on how I can make myself stand out without extra certs or whatever right away?",
      "phase": "guiding"
    },
    {
      "index": "ae",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The session is still in its early stages with only one turn in the Guiding phase. The client is expressing concerns about their future career options and educational path. More exploration is needed to clarify their goals and build confidence before moving on to the Choosing phase.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 10,
      "role": "therapist",
      "statement": "You've got a solid foundation with your interdisciplinary studies degree and coursework in business and political science. When applying for jobs in public policy or non-profits, focus on highlighting transferable skills like problem-solving, critical thinking, communication, and collaboration, which you've likely developed through your studies and any extracurricular activities. Consider showcasing specific projects or assignments that demonstrate your understanding of both business and political concepts, and don't be afraid to emphasize your unique perspective as someone who can bridge these two fields.",
      "phase": "guiding"
    },
    {
      "index": 11,
      "role": "client",
      "statement": "**Client (me, continuing the conversation):** Thanks, that’s super helpful to think about. I’ve done some group projects in my business classes where we had to analyze data and present solutions, and I’ve written a few papers in poli sci that kinda tied into policy issues, so maybe I can play those up. I’m just a bit nervous about, like, not having a super clear career path or specific job title in mind yet. Do you think it’s okay to just apply to a bunch of stuff in those fields and see what sticks, or should I try to narrow it down more before I start looking?",
      "phase": "guiding"
    },
    {
      "index": "af",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The conversation is progressing well, with the client showing openness to new ideas and expressing interest in potential career paths that blend business and political science. However, with only 2 turns in the Guiding phase, it's important to ensure sufficient exploration of these options and further reducing ambivalence before moving to action planning.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 12,
      "role": "therapist",
      "statement": "It’s completely fine to explore a range of opportunities in public policy and non-profits, as it can help you discover what truly resonates with you. By applying to various roles and gaining experience, you’ll gain clarity on your strengths and interests, and can refine your career path over time.",
      "phase": "guiding"
    },
    {
      "index": 13,
      "role": "client",
      "statement": "**Client (me, continuing the conversation):** Cool, that takes some pressure off, honestly. I guess I’ll start looking into different roles in those areas, maybe internships or entry-level stuff, just to get a feel for what’s out there. I’m kinda worried about not having much real-world experience yet, though—do you think employers will care about that, or can I make up for it with my coursework and, like, enthusiasm when I interview?",
      "phase": "guiding"
    },
    {
      "index": "ag",
      "role": "sc_master",
      "statement": "```json\n{\n  \"reasoning\": \"The client has expressed interest in exploring new career paths and is open to applying for a variety of roles. They have expressed a specific change goal by considering roles in public policy or non-profits. Change Talk is present, and they are actively considering next steps. As the session is at the third turn, it's appropriate to move to the Choosing phase.\",\n  \"determination\": \"move\"\n}\n```",
      "phase": "guiding"
    },
    {
      "index": 14,
      "role": "therapist",
      "statement": "You're not alone in that concern, and many employers understand that new grads often have limited direct experience. While they might look for potential and a strong foundation in relevant coursework, your enthusiasm, eagerness to learn, and any transferable skills you've developed through group projects or assignments can definitely make a positive impression. It's also worth considering highlighting any relevant extracurricular activities or volunteer work that demonstrate your passion for the field, as these can help offset a lack of formal experience.",
      "phase": "choosing"
    },
    {
      "index": 15,
      "role": "client",
      "statement": "**Client (me, continuing the conversation):** That makes sense, I appreciate the boost of confidence. I’ve done a little volunteering here and there, like helping out at community events, so maybe I can mention that. I’m just wondering, though, how do I even start finding these entry-level gigs or internships in public policy or non-profits? Like, are there specific websites or resources I should check out, or should I just hit up my school’s career center for help?",
      "phase": "choosing"
    },
    {
      "index": "ah",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has shown readiness to explore new career paths and discussed a clear action plan. However, there is only one turn in the Choosing phase, and the client is still seeking specific resources and guidance on next steps. It is essential to continue exploring these aspects before transitioning to Terminating.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 16,
      "role": "therapist",
      "statement": "You can definitely start by reaching out to your school's career center—they often have valuable resources and connections in the field. Additionally, websites like Idealist, LinkedIn, and even local government or non-profit organization websites can be great places to search for entry-level opportunities. Don't forget to leverage your network by letting friends, family, and professors know you're looking—sometimes the best leads come from personal connections.",
      "phase": "choosing"
    },
    {
      "index": 17,
      "role": "client",
      "statement": "**Client (me, continuing the conversation):** Thanks, that’s really helpful to know where to look. I’ll definitely check out the career center and poke around on those websites. I hadn’t thought about asking people I know for leads, so I’ll try mentioning it to a few professors or friends. Do you think it’s cool to just reach out to people on LinkedIn, like, cold message them about opportunities, or does that come off as weird or pushy?",
      "phase": "choosing"
    },
    {
      "index": "ai",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has a clear goal to transition to interdisciplinary studies and is exploring job options that integrate business and political science. They have discussed potential barriers, like lack of experience, and have accepted guidance on how to address them. They show readiness through planning to seek internships and networking. With only 2 turns in the Choosing phase, we should continue to solidify the plan.\",\n\"determination\": \"continue\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 18,
      "role": "therapist",
      "statement": "You can definitely reach out to people on LinkedIn, and it's not considered weird or pushy if done thoughtfully. It's a common way to network and explore opportunities in your field. A simple, respectful message expressing your interest in their work and asking if they'd be open to a brief conversation about their experiences or advice can be a great starting point.",
      "phase": "choosing"
    },
    {
      "index": 19,
      "role": "client",
      "statement": "**Therapist:** I'm glad you're feeling proactive about reaching out, and yes, messaging on LinkedIn is totally fine as long as you keep it professional and genuine. Just make sure to personalize your message, mention something specific about their profile or work, and keep it brief to show you respect their time.\n\n**Client (me, continuing the conversation):** Got it, that’s a relief to hear. I’ll make sure to keep it short and sweet, maybe mention something cool from their profile so it doesn’t sound like a generic copy-paste. I’m kinda nervous about putting myself out there like that, though—do you have any tips on how to not sound, like, super awkward or desperate when I message them?",
      "phase": "choosing"
    },
    {
      "index": "aj",
      "role": "sc_master",
      "statement": "```json\n{\n\"reasoning\": \"The client has developed a clear action plan by identifying fields of interest (public policy, nonprofits) and understands potential barriers (lack of experience). They've discussed strategies to overcome these barriers, such as leveraging current skills, networking, and utilizing their school's resources. The client shows commitment and confidence by discussing actionable steps like reaching out on LinkedIn and exploring job options.\",\n\"determination\": \"move\"\n}\n```",
      "phase": "choosing"
    },
    {
      "index": 20,
      "role": "client",
      "statement": "**Therapist:** Absolutely, it’s normal to feel nervous about reaching out. A good tip is to focus on curiosity—frame your message as wanting to learn from their experience rather than asking for a job outright, and let your genuine interest in their work shine through.\n\n**Client (me, continuing the conversation):** Okay, that makes sense, just focusing on learning from them instead of seeming like I’m begging for something. Thanks for the advice—I think I’ll give it a shot and see how it goes.",
      "phase": "terminating"
    },
    {
      "index": "ak",
      "role": "sc_master",
      "statement": "{{\n\"reasoning\": \"The client has received detailed guidance on potential career paths, skills to highlight, and job search strategies, addressing their primary concerns and providing a plan forward. It seems appropriate to close the session now.\",\n\"determination\": \"stop\"\n}}",
      "phase": "terminating"
    }
  ],
  "dialogue_conv": "therapist: Welcome to our session today! I'm here to listen and support you. Please feel free to share whatever thoughts or concerns you have on your mind.\nclient: Thanks for being here to talk. I’m just really stressed about my situation with school and failing calculus, and I’m worried about what kind of future I’ll have if I can’t stay in the business program.\n\nTherapist: I can hear how much this is weighing on you, and it’s completely okay to feel stressed about this. Let’s explore your concerns about your future and see what options might be available to you.\n\nAssistant: Yeah, I appreciate that. I’m just kinda lost right now, ya know? Like, if I don’t pass calculus and get kicked outta the business program, I’m thinking of switching to interdisciplinary studies with a focus on poli sci, but I’m scared I’ll end up with no good job options. I just wanna know if there’s any hope for a decent office job or something, and maybe what kinda jobs could mix business and poli sci stuff together.\ntherapist: That’s a really understandable fear, and it’s great that you’re thinking about potential paths. Let’s talk more about what you want in a job, and maybe explore some options that blend business and poli sci.\nclient: Cool, I’m glad to dive into that. Honestly, I just want something stable, like a 9-to-5 where I’m not stuck doing minimum wage stuff forever, ya know? I’m not super picky, but I’d love to use some of the business skills I’ve picked up, even if I can’t finish that major, and maybe tie in some of the poli sci interests I’ve got. What do you think could work for me with that mix?\ntherapist: You're clearly passionate about combining your business and political science interests, and it's great that you're thinking about what kind of job would give you the stability and satisfaction you're looking for. Let's explore some options that could bring those two fields together, like working in public policy or government relations for a private company, or even a role in non-profit management that leverages your business skills while allowing you to engage with political issues.\nclient: Hey, that actually sounds kinda promising. I hadn’t really thought about stuff like public policy or government relations before, but I can see how my business background could fit in there, even if it’s not a full degree. Non-profit management sounds interesting too, ‘cause I like the idea of doing something meaningful. Do you think I’d need extra training or certs for those kinds of roles, or could I jump in with just a bachelor’s in interdisciplinary studies?\ntherapist: It sounds like you’re really open to exploring these options, and it’s great that you’re thinking about how to bridge your interests in business and political science. Let’s talk more about what you might need to get into these roles, and whether there are any additional certifications or training that could help you stand out in the job market.\nclient: Yeah, I’m definitely open to figuring this out. I just wanna know if a bachelor’s in interdisciplinary studies will be enough to get my foot in the door for something like public policy or non-profit work, or if I’m gonna need to go back for more classes or certs. Like, I’m already stressed about the time and money I’ve put into school, so adding more on top of that kinda freaks me out. What do you think—can I make it work with what I’ve got, or should I start looking into extra stuff now?\ntherapist: Your interdisciplinary studies degree is a great foundation, and you can definitely leverage your business and political science background to get into public policy or non-profit work. While additional certifications or training might give you an edge, it's not necessarily a requirement. Let's focus on your strengths and the skills you've developed so far, and we can explore options that align with your current degree.\nclient: **Client (me, continuing the conversation):** Hey, that’s reassuring to hear that my degree might be enough to start with. I’m just wondering, like, what specific skills or stuff I should focus on highlighting when I’m applying for jobs in public policy or non-profits, ya know? I’ve got some business coursework under my belt, and I’m taking poli sci classes now, but I’m not super confident about how to sell that to an employer. Got any tips on how I can make myself stand out without extra certs or whatever right away?\ntherapist: You've got a solid foundation with your interdisciplinary studies degree and coursework in business and political science. When applying for jobs in public policy or non-profits, focus on highlighting transferable skills like problem-solving, critical thinking, communication, and collaboration, which you've likely developed through your studies and any extracurricular activities. Consider showcasing specific projects or assignments that demonstrate your understanding of both business and political concepts, and don't be afraid to emphasize your unique perspective as someone who can bridge these two fields.\nclient: **Client (me, continuing the conversation):** Thanks, that’s super helpful to think about. I’ve done some group projects in my business classes where we had to analyze data and present solutions, and I’ve written a few papers in poli sci that kinda tied into policy issues, so maybe I can play those up. I’m just a bit nervous about, like, not having a super clear career path or specific job title in mind yet. Do you think it’s okay to just apply to a bunch of stuff in those fields and see what sticks, or should I try to narrow it down more before I start looking?\ntherapist: It’s completely fine to explore a range of opportunities in public policy and non-profits, as it can help you discover what truly resonates with you. By applying to various roles and gaining experience, you’ll gain clarity on your strengths and interests, and can refine your career path over time.\nclient: **Client (me, continuing the conversation):** Cool, that takes some pressure off, honestly. I guess I’ll start looking into different roles in those areas, maybe internships or entry-level stuff, just to get a feel for what’s out there. I’m kinda worried about not having much real-world experience yet, though—do you think employers will care about that, or can I make up for it with my coursework and, like, enthusiasm when I interview?\ntherapist: You're not alone in that concern, and many employers understand that new grads often have limited direct experience. While they might look for potential and a strong foundation in relevant coursework, your enthusiasm, eagerness to learn, and any transferable skills you've developed through group projects or assignments can definitely make a positive impression. It's also worth considering highlighting any relevant extracurricular activities or volunteer work that demonstrate your passion for the field, as these can help offset a lack of formal experience.\nclient: **Client (me, continuing the conversation):** That makes sense, I appreciate the boost of confidence. I’ve done a little volunteering here and there, like helping out at community events, so maybe I can mention that. I’m just wondering, though, how do I even start finding these entry-level gigs or internships in public policy or non-profits? Like, are there specific websites or resources I should check out, or should I just hit up my school’s career center for help?\ntherapist: You can definitely start by reaching out to your school's career center—they often have valuable resources and connections in the field. Additionally, websites like Idealist, LinkedIn, and even local government or non-profit organization websites can be great places to search for entry-level opportunities. Don't forget to leverage your network by letting friends, family, and professors know you're looking—sometimes the best leads come from personal connections.\nclient: **Client (me, continuing the conversation):** Thanks, that’s really helpful to know where to look. I’ll definitely check out the career center and poke around on those websites. I hadn’t thought about asking people I know for leads, so I’ll try mentioning it to a few professors or friends. Do you think it’s cool to just reach out to people on LinkedIn, like, cold message them about opportunities, or does that come off as weird or pushy?\ntherapist: You can definitely reach out to people on LinkedIn, and it's not considered weird or pushy if done thoughtfully. It's a common way to network and explore opportunities in your field. A simple, respectful message expressing your interest in their work and asking if they'd be open to a brief conversation about their experiences or advice can be a great starting point.\nclient: **Therapist:** I'm glad you're feeling proactive about reaching out, and yes, messaging on LinkedIn is totally fine as long as you keep it professional and genuine. Just make sure to personalize your message, mention something specific about their profile or work, and keep it brief to show you respect their time.\n\n**Client (me, continuing the conversation):** Got it, that’s a relief to hear. I’ll make sure to keep it short and sweet, maybe mention something cool from their profile so it doesn’t sound like a generic copy-paste. I’m kinda nervous about putting myself out there like that, though—do you have any tips on how to not sound, like, super awkward or desperate when I message them?\nclient: **Therapist:** Absolutely, it’s normal to feel nervous about reaching out. A good tip is to focus on curiosity—frame your message as wanting to learn from their experience rather than asking for a job outright, and let your genuine interest in their work shine through.\n\n**Client (me, continuing the conversation):** Okay, that makes sense, just focusing on learning from them instead of seeming like I’m begging for something. Thanks for the advice—I think I’ll give it a shot and see how it goes.",
  "completed": true
}